{
    "intents": [
        {
            "tag": "breakfast",
            "patterns": [
                "Bread Baking: Sourdough Waffles: 1. In medium bowl, combine flour, baking powder, sugar, and salt. Whisk until well combined.2. In separate medium bowl, whisk eggs and milk until combined. Add sourdough starter and whisk until completely blended. Add flour mixture and butter and stir until combined. Depending on thickness of starter, you might need to adjust batter. It should be the consistency of pancake batter. Add flour or milk as needed to reach that consistency.3. Cook in waffle iron according to manufacturer's directions.",
                "Hummingbird Pancakes: Heat a nonstick griddle over medium heat.In a large bowl, combine the baking mix and cinnamon. In a separate bowl, whisk together the half-and-half, mashed bananas, pineapple, sugar, butter and egg until smooth. Add the wet mixture to the dry and stir just until the dry ingredients are moistened, taking care not to overmix. Fold in the pecans.Using a 1/4-cup measure, pour the batter onto the griddle and cook the pancakes for 2 to 4 minutes, watching for the tops to start bubbling. Flip and cook for 2 to 4 more minutes. Repeat the process with the remaining batter. Serve with sliced bananas and strawberries.",
                "Fried Eggs With Ramps, Morels, and Bacon: 1. Heat bacon along with 1 tablespoon (15ml) water in a medium cast iron or stainless steel skillet over medium heat, stirring, until water evaporates, bacon fat renders, and bacon is completely crisp, about 5 minutes. Using a slotted spoon, transfer bacon to a bowl and set aside.2. Return skillet to medium-high heat until lightly smoking. Add morels and cook, stirring and tossing frequently, until barely starting to brown, about 2 minutes. Add 1 tablespoon (15g) butter and cook, stirring, until morels are nicely browned but not burnt, 1 to 2 minutes longer.3. Add ramps and cook, stirring and tossing frequently, until whites are browned and tender and greens are crisp in spots, about 2 minutes. Add 2 tablespoons (30ml) water, soy sauce, lemon juice, and remaining tablespoon butter. Remove from heat and set aside.4. Heat canola oil in a medium nonstick or well-seasoned cast iron skillet over medium-high heat until shimmering. Add eggs, season with salt and pepper, and cook, occasionally using a spoon to baste hot oil over the whites to help them cook, until whites are set, edges are crisp, and yolk is still runny.5. Place a slice of toast on each of two plates. Top each with a fried egg. Return morel/ramp mixture to high heat and stir in bacon. Cook over high heat until liquid reduces to a creamy, emulsified sauce. Season to taste with salt and pepper. Spoon morels and ramps over and around fried eggs. Sprinkle with chives and serve.",
                "Ultra-Buttery Irish Scones : Preheat oven to 375°. Line a rimmed baking sheet with parchment paper.Whisk milk, granulated sugar, and kosher salt in a medium bowl until sugar and salt dissolve. Whisk flour and baking powder in a large bowl. Cut 10 Tbsp. butter into 1/2\" cubes, add to flour mixture, and blend with a pastry cutter or your fingertips until pea-size pieces form with some larger chunks remaining. Add milk mixture and stir with a fork until large clumps form. Gently knead in the bowl until dough just comes together. Transfer to a lightly floured work surface.With a lightly floured rolling pin, roll out dough to a 14x8\" rectangle, with long side facing you. Heat 2 Tbsp. butter in a small, microwave-proof bowl in the microwave until softened but not melted, about 20 seconds. Spread evenly over dough with fingertips, then sprinkle currants evenly on top and press to adhere. Fold up bottom third of dough over center, then fold down top third to meet bottom edge, as if folding a letter. Fold in half crosswise, then, using a rolling pin, gently flatten into an 8x4\" rectangle.Cut dough in half lengthwise and in quarters crosswise to form 8 even squares. Transfer to prepared pan, spacing 2\" apart. Sprinkle tops generously with demerara sugar and lightly with flaky sea salt.Bake until scones are golden brown, 25-30 minutes. Meanwhile, melt remaining 4 Tbsp. butter in a small saucepan over medium-low heat. When butter bubbles, remove from heat and skim off foam from surface. As soon as the scones come out of the oven, lightly brush tops with clarified butter, leaving behind white solids in bottom of saucepan. Cool scones on sheet on a wire rack and serve hot, warm, or room temperature."
            ]
        }, {
            "tag": "dessert",
            "patterns": [
                "Frozen Mini S'mores Pies : Heat butter and honey in a small saucepan over medium or in a microwave-safe bowl, stirring occasionally, until butter is melted. Pulse graham crackers in a food processor until fine crumbs form. With the motor running, drizzle in butter-honey mixture and process until well combined. Transfer mixture to a medium bowl.Using an electric mixer on high speed, beat cream cheese in a large bowl until creamy, about 3 minutes. Add condensed milk and cocoa powder and beat until smooth.Using a whisk or electric mixer on medium-high speed, whip cream in another medium bowl to stiff peaks. Gently fold into cocoa powder mixture.Line muffin pan with paper liners. Pour cocoa powder mixture into a pastry bag or plastic bag with the corner snipped off and pipe evenly into muffin cups. Top each with 1 1/2 Tbsp. cracker crumb mixture, breaking up crumbs to completely cover, then press down gently to adhere. Freeze until set, at least 3 hours.Heat corn syrup, sugar, and 1/4 cup water in a small saucepan over low until sugar is melted. Increase heat to medium and cook until an instant-read thermometer registers 240˚F, about 5 minutes.Meanwhile, using electric mixer on medium-high speed (or a stand mixer fitted with the whisk attachment), beat egg whites and cream of tartar in a large bowl until soft peaks form. Reduce mixer speed to low and carefully add sugar syrup to egg whites in a slow and steady stream. Increase speed to high and beat until mixture is light, glossy, and fluffy, 6–8 minutes.Remove pies from molds, turn upside down, and remove paper liners. Dollop each pie with meringue. Using kitchen torch, carefully torch fluff. Serve immediately or return to freezer until ready to serve.Pies (without topping) can be made 2 weeks ahead; cover and freeze. Pies (with topping) can be made 5 days ahead; keep frozen.",
                "French Toast Bread Pudding: Preheat the oven to 350 degrees.Arrange the bread in two layers in a 9 by 13 by 2-inch baking dish, cutting the bread to fit the dish. Set aside.In a large bowl, whisk together the eggs, half-and-half, honey, orange zest, vanilla, and salt. Pour the mixture over the bread and press the bread down. Allow to soak for 10 minutes.Place the baking dish in a larger roasting pan and add enough very hot tap water to the roasting pan to come an inch up the side of the baking dish. Cover the roasting pan tightly with aluminum foil, tenting it so the foil doesn't touch the pudding. Make two slashes in the foil to allow steam to escape. Bake for 45 minutes, remove the aluminum foil, and bake for another 40 to 45 minutes, until the pudding puffs up and the custard is set. Remove from the oven and cool slightly.With a small sieve, dust lightly with confectioners' sugar and serve hot in squares with maple syrup on the side.",
                "Salted Honey and Chocolate Bark: A candy thermometer",
                "Alfajores With Coconut Dulce de Leche: Place a rack in middle of oven; preheat to 375°. Bring condensed milk, coconut milk, and ½ tsp. salt to a boil in a small saucepan over medium-high heat. Scrape mixture into a 13x9\" baking dish and bake, stirring every 15 minutes or so, until very thick and a light caramel color, 40–50 minutes. Mixture will look lumpy, broken, and very pasty—that’s exactly what you want. Let cool in dish 1 hour, then transfer to a food processor and process until smooth. Set dulce de leche aside for serving.Meanwhile, whisk almond flour and 2¼ cups all-purpose flour in a medium bowl to combine. Using an electric mixer on medium-high speed, beat butter, sugar, and 1½ tsp. salt in a large bowl, scraping down sides and bottom of bowl as needed, until pale and creamy, about 3 minutes. Add egg yolk, vanilla, and ¼ cup honey and beat until combined, about 2 minutes. Reduce speed to low, add dry ingredients, and mix, scraping down sides and bottom of bowl, until incorporated. Divide dough in half and pat each piece into a 1\"-thick disk. Wrap in plastic and chill until firm, at least 2 hours.Preheat oven to 350°. Roll out 1 disk of dough on a lightly floured sheet of parchment paper, dusting with more flour as needed to keep dough from sticking, to about ⅛\" thick. Punch out shapes with lightly floured cookie cutters and transfer to 2 parchment-lined baking sheets, spacing 1\" apart. Pat scraps into a 1\"-thick disk, wrap with plastic, and chill 10 minutes if soft.Bake a sheet of cookies, rotating halfway through, until edges are lightly browned, 7–9 minutes. Let cool 10 minutes on baking sheet, then transfer to a wire rack and let cool completely. Bake remaining sheet of cookies. Line baking sheets with fresh sheets of parchment paper and repeat process with remaining disk of dough.Divide coconut evenly among 3 bowls. Add 1 Tbsp. food-coloring powder (sift if needed) to a bowl of coconut and toss until coconut is coated; add more powder if a more intense color is desired. Repeat with remaining food-coloring powder and another bowl of coconut. Leave 1 bowl of coconut white. If using, add some luster dust to all 3 bowls and toss to combine.Turn half of the cookies over to expose flat side; spread 1 tsp. dulce de leche over (this will be the inside of the sandwiches); set aside.Heat remaining 2 Tbsp. honey in a small bowl in the microwave just until warm (you want it to be loose), then stir in 2 tsp. warm water. Working one at a time, lightly brush honey over the top of remaining cookies (the ones that have not been filled with dulce de leche). Immediately dip tops into a bowl of coconut; press additional coconut onto cookie to cover any bald spots. Close up cookie sandwiches, coconut side up.Do Ahead: Dulce de leche can be made 1 month ahead; place in an airtight container and freeze. Thaw in refrigerator overnight before using. Dough can be made 3 days ahead; keep chilled. Cookies can be baked (but not assembled) 2 days ahead; store airtight at room temperature.",
                "Pies-N-Thighs Biscuits: Preheat oven to 375°. Pulse baking powder, salt, sugar, baking soda, and 5½ cups flour in a food processor. Add butter and pulse until the texture of coarse meal with a few pea-size pieces of butter remaining.Transfer mixture to a large bowl. Mix in buttermilk with a fork, then gently knead just until a shaggy dough comes together.Pat out dough on a lightly floured surface until 1¼” thick. Cut out biscuits with a 3” biscuit cutter, rerolling scraps once.Place biscuits on a parchment-lined baking sheet and brush tops with egg. Bake until golden brown, 30–35 minutes.",
                "Chocolate Avocado Milkshake: 1. Pour milk into freezer safe container and freeze until half frozen, about 1 1/2 hours.2. While milk is freezing, place chocolate and water in microwave safe bowl and heat on high power until chocolate is melted, about 30 seconds. Whisk in cocoa until smooth; set aside.3. Halve and pit avocado. Scoop avocado flesh into blender. Add chocolate mixture, sugar, vanilla, and frozen milk. Blend until smooth, 15 to 30 seconds. Serve.",
                "Coconut Macaroons with Salted Caramel: 1. In small bowl, stir together sugar, flour, and salt for pastry cream.2. In another bowl, whisk egg yolks until blended and then add dry mixture slowly, mixing to yield thick and pasty consistency.3. To make pastry cream: in a small saucepan, scald milk over medium-high heat. When you start seeing bubbles around the edges, take milk off heat, and add slowly to egg and flour mixture.4. Return mixture to saucepan and heat over medium heat, whisking vigorously for about a minute as it cooks into a viscous, thick cream. Stir in vanilla, cover with plastic wrap and let cool completely.5. Heat oven to 350°F, and line baking sheet with parchment paper or cooking spray.6. In a large bowl, combine coconut, egg white, sugar, salt, and pastry cream.7. Form the dough into mounds and place on the baking sheet. Bake until golden brown, about 25-35 minutes, rotating trays halfway through baking.8. For the optional salted caramel: Combine sugar, water and corn syrup in saucepan and bring to a boil over medium heat until mixture turns a light amber color. Remove from heat and stir in other ingredients. Allow to cool slightly (about 5 to 10 minutes) before drizzling on the cookies so that it thickens and looks prettier.",
                "Caramel Apples: Add the sugar, corn syrup and 1/2 cup water to a small saucepan over medium-high heat. Stir a few times before the sugar begins to boil to combine the ingredients. Attach a candy thermometer to the inside of the pan and bring the syrup to a boil. Cook until the syrup begins to turn an amber color, then swirl the syrup to even out the color. Continue to cook until the syrup is a deep amber and the thermometer reads between 375 and 380 degrees F, then remove from the heat. Carefully pour in the cream and gently whisk to combine. Stir in the butter, vanilla and a pinch of salt until smooth. Keep off the heat but keep the thermometer attached to the pan.Pierce the apples through the stem ends about halfway through with candy apple sticks. Line a baking sheet with parchment and lightly spray with nonstick cooking spray.When the temperature of the caramel reads around 190 degrees F, dip an apple, using the stick as a handle and swirling to coat completely. Allow excess caramel to drip off the bottom and use a spatula to help remove any large amount of caramel, as it will pool around the apple when you set it down to cool on the lined baking sheet. Repeat with the remaining apples, gently heating the caramel on the stovetop over low heat, stirring, if it gets too thick for dipping. Allow the caramel to set and cool completely before serving or wrapping apples, about 1 hour. (See Cook's Note.)",
                "Hazelnut Butter Cake with Sea Salt Caramel: Preheat oven to 350°. Butter an 8”-diameter cake pan. Line with a parchment round; butter parchment. Dust pan with flour.Pulse hazelnuts and 1 Tbsp. granulated sugar in a food processor until finely ground; set aside 2 Tbsp. nut mixture. Whisk baking powder, salt, 1 cup flour, and remaining nut mixture in a medium bowl.Using an electric mixer on high speed, beat ½ cup butter and remaining granulated sugar in a large bowl until light and fluffy, about 3 minutes. Add eggs one at a time, beating to blend between additions. Reduce speed to low and mix in dry ingredients. Scrape batter into prepared pan, and sprinkle with reserved nut mixture and raw sugar.Bake until cake is golden brown and a tester inserted into the center of cake comes out clean, 40–45 minutes. Transfer pan to a wire rack; let cake cool in pan before turning out.DO AHEAD: Cake can be baked 1 day ahead. Keep wrapped tightly at room temperature.",
                "Aunt Marian's Summer Squash Custard Pie : Heat the oven to 400 degrees F. Line a 9-inch pie pan with crust, then crimp the edges decoratively.To prepare the zucchini, trim the ends and cut each squash lengthwise into quarters, turning each squash into four long strips. Cut away the pointed edge of each strip, removing and discarding the seeds. Line up the strips and cut each one crosswise into 1/2-inch chunks. You should have about 6 cups of chopped zucchini.In a medium saucepan with a tight-fitting lid, bring 3/4 cup water to a rolling boil. Add the chopped zucchini, cover, and cook until the zucchini is tender and bright green, softened, but still holding its shape without turning to mush, 4 to 5 minutes. Remove from the heat and drain well.In a small bowl, combine the sugar, cornstarch, nutmeg, and salt. Stir with a fork to mix everything well. In a medium bowl, combine the cream, eggs, butter, vanilla, and vinegar. Using a whisk or a fork, stir to combine everything well. Add the sugar mixture and stir to dissolve the dry ingredients and mix everything together into a thick, smooth filling.Transfer the zucchini back to the empty saucepan and mash it to make it as soft and smooth as possible. Drain off any extra liquid that the zucchini releases. Measure it out, so that you have about 2 1/2 cups. Fold the mashed, drained zucchini into the filling and stir to mix everything together well.Pour the filling into the piecrust. Place the pie on the middle shelf of the oven. Bake for 10 minutes. Reduce the heat to 325 degrees F, and bake until the filling is firm and nicely browned, and a knife inserted in the center of the pie comes out clean, 30 to 40 minutes.Place the pie on a cooling rack or a folded kitchen towel and let cool to room temperature. Serve at room temperature or slightly chilled.",
                "Valentine's Day Dark Chocolate Cake: Have all your ingredients at room temperature. Preheat the oven to 350°. Butter the pan of your choice or line the pan with wax paper or parchment and butter the paper.With a hand mixer or a stand mixer fitted with the paddle attachment, whip the butter for 1 minute on high speed, then scrape down the sides of the bowl with a spatula. Add the sugar to the butter and beat on high speed for 2 minutes. Scrape down the sides of the bowl again.With the mixer on medium-low speed, add the vanilla extract; then add the eggs one at a time. Scrape down the edges of the bowl midway through.Combine the flour, cocoa powder, baking soda, and sea salt in a separate bowl.With the mixer on low speed, add half the flour mixture. When it’s mostly incorporated, add half the sour cream. Add the remainder of the dry and wet ingredients, scraping down the sides of the bowl between additions. Stop mixing as soon as you have a smooth batter.Pour the batter into the prepared pan and bake until the middle of the cake feels springy when you gently press your finger against it (approximately 30-35minutes). All ovens are different, so it’s important to do the fingerprint test to see if the cake is done.Let the cake cool completely before icing.",
                "Rhubarb and White Chocolate Lattice Tart : Combine flour, sugar, and salt in processor; blend 5 seconds. Add butter. Using on/off turns, process until mixture resembles coarse meal. Whisk egg and 1 tablespoon cream in small bowl to blend; add to flour mixture. Using on/off turns, blend until dough comes together in moist clumps, adding more cream by teaspoonfuls if dough is dry. Gather dough into ball. Shape 2/3 of dough into disk; shape remaining dough into rectangle. Wrap both dough pieces and chill at least 2 hours and up to 1 day.Combine rhubarb, sugar, and whisky in large skillet. Sauté over medium heat until sugar dissolves and syrup begins to bubble. Cover and simmer until rhubarb is almost tender, about 6 minutes. Transfer contents of skillet to strainer set over large bowl (reserve skillet). Drain rhubarb well. Return juices from bowl to same skillet. Boil over medium-high heat until juices are reduced to 3 tablespoons, about 5 minutes. Remove skillet from heat and reserve juices.Preheat oven to 375°F. Roll out dough rectangle on lightly floured surface to 91/2-inch square; cut into 9 strips. Arrange strips on small baking sheet; chill.Roll out dough disk on lightly floured surface to 11-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Trim overhang to 3/4 inch. Fold in and press sides until top edge of crust is slightly higher than pan side. Pierce crust with fork. Line with foil; fill with dried beans or pie weights. Bake crust until sides are set, about 18 minutes. Remove foil and beans. Bake until crust is pale golden, pressing with back of fork if crust bubbles, about 15 minutes longer. Cool crust 15 minutes.Sprinkle white chocolate over crust. Top with rhubarb. Spoon juices over. Arrange 5 dough strips atop filling, spacing evenly apart. Arrange remaining strips atop filling in opposite direction, forming lattice. Seal ends of strips to crust, trimming excess dough. Brush lattice with glaze.Bake tart until filling bubbles and lattice is golden, about 50 minutes. Cool tart slightly in pan on rack. Push up pan bottom, releasing tart. Cut tart into wedges and serve warm or at room temperature with whipped cream.",
                "Figgy Sundaes: Toast nuts over low heat in a small pan. Warm the chocolate hazelnut spread in the microwave on high until it has the consistency of hot fudge sauce, 40 seconds to 1 minute. In sundae cups or small bowls, layer ice cream with sliced cookies, toasted nuts, and chocolate hazelnut sauce. Garnish with a twist of whipped cream from a canister.",
                "Peppermint Bark Popcorn: Heat popcorn in the microwave according to package instructions. Set aside.Place the white chocolate and vegetable oil in a microwave-safe bowl and microwave in 20-second intervals, stirring in between, until fully melted.Pour popcorn into a gallon-size resealable plastic bag, add white chocolate and peppermint bark, and toss until fully coated. Spread the white chocolate-covered popcorn on an even layer on a parchment-lined baking sheet or tray, then top with candy cane pieces and sprinkles. Let set for 3 to 5 minutes before serving.",
                "Upside-Down Apple Praline Cake: Preheat the oven to 350 degrees F. Spray two 9-inch round cake pans with baking spray.Pour 1/4 cup melted butter into each cake pan. Sprinkle each evenly with 3/4 cup brown sugar. Arrange the apple slices in a single layer over the brown sugar.In a large bowl, beat the remaining 1 cup softened butter and the granulated sugar with a mixer at medium speed until fluffy. Add the eggs, one at a time, beating well after each addition. Beat in the vanilla.In a medium bowl, combine the flour, baking powder, cinnamon, salt and nutmeg. Gradually add the flour mixture to the butter mixture, alternating with the buttermilk, beginning and ending with the flour mixture and beating just until the dry ingredients are moistened after each addition.Pour the batter evenly into the prepared pans. Bake until a wooden pick inserted in the center comes out clean, 35 to 45 minutes. Let cool in the pans for 20 minutes. Invert the cakes onto wire racks (the apple side should be facing up) and let cool completely.Spread half of the Caramel Mousse evenly over the top of one cake layer. Sprinkle with candy-coated pecans. Place the remaining cake layer on top and spread with the remaining Caramel Mousse. Drizzle with the caramel topping and sprinkle with more pecans before serving, if desired. Store the cake in the refrigerator until ready to serve.In a small bowl, sprinkle the gelatin over the cold water and let soften for 2 minutes. Add the boiling water, stirring to dissolve.In a large bowl, beat the heavy cream with a mixer on high speed until foamy. Gradually add the confectioners' sugar, beating until stiff peaks form. Slowly add the gelatin mixture, beating until combined. The mixture will look like it is melting, but will firm up. Stir in the caramel topping. Cover and refrigerate for at least 2 hours before using.",
                "Hot Dog Pull-Apart Cupcake Cake: Color about 2 cups buttercream the color of a hotdog bun using ivory food coloring with a few drops of brown. Color about 2 cups of buttercream the color of a hot dog, using equal parts red and brown food coloring. Color a small amount buttercream (about 1/2 cup) deep red, for ketchup. Color a small amount buttercream (about 1/2 cup) deep yellow, for mustard. Color the remaining buttercream (about 1/2 cup) deep black, for grill marks.Arrange cupcakes in 3 horizontal rows, with 5 cupcakes in the top and bottom rows and 6 in the middle row.Use an ice cream scoop or large spoon to dollop about 1/4 cup hot dog color buttercream on the cupcakes in the middle row. Use an offset spatula to smooth the tops to make a long hotdog shape, curved at both ends. Smooth all the way to the edges of the cupcakes.Wash and dry the ice cream scoop and offset spatula. Dollop the hot dog bun color buttercream on the middle row of cupcakes and smooth all the way to the edges of the cupcakes, curving at the ends to resemble the hot dog bun. Dip the offset spatula in a little water and smooth the edges where the hotdog meets the bun last to keep the definition between the hotdog and the bun clean.Put the red, yellow and black buttercreams in separate pastry bags fitted with medium round tips. Pipe 5 evenly spaced diagonal lines with the black buttercream to make grill marks along the hot dog. Pipe a wavy row of red buttercream ketchup, then yellow buttercream mustard along the length of the hot dog. Snip the gummy bears into small pieces and scatter over the top of the hot dog for relish.",
                "Salted Caramel Banana Bread Is Literally The Stuff Of Dreams: Preheat oven to 350° and butter and flour a 9\"-x-5\" loaf pan. In a large bowl, whisk together flour, baking soda, and salt.In another large bowl, mix sugar, butter, buttermilk, vanilla, egg and egg yolk until smooth. Pour wet ingredients over dry and stir until combined, then fold in mashed bananas and caramel.Transfer batter to prepared baking dish and scatter with banana slices. Bake until deeply golden and a toothpick comes out clean, about 1 hour. Let cool at least 10 minutes.Drizzle with caramel and sprinkle with flaky sea salt before serving.",
                "Walnut Cake with American Frosting: Melted butter, for brushing pans7 ounces all-purpose flourPinch salt1 generous teaspoon baking powder7 tablespoons butter, softened8 ounces caster sugar (superfine)1 teaspoon vanilla extract2 eggs, separated3 1/2 ounces shelled walnuts, roughly chopped3 1/2 ounces milkPreheat the oven to 350 degrees F. Brush 2 (8-inch) or 3 (7-inch) cake pans or sandwich pans with melted butter, and dust with flour. Line the base of each pan with parchment or greaseproof paper.In a bowl, sift the flour with the salt, and baking powder.In a large bowl, or in an electric food mixer, cream the butter until soft. Add the sugar, and vanilla extract, and beat until the mixture is light and fluffy. Beat in the egg yolks, and then stir in the chopped walnuts. Fold in a quarter of the flour and milk into the mixture, alternating each, until they are incorporated.In a separate bowl, whisk the egg whites until they are stiff.Stir a quarter of the egg whites into the cake mixture, and then gently fold in the rest. Divide the batter between the tins, making a slight hollow in the center of each so that the cake rises evenly rather than forming a peak.Bake in the oven until firm to the touch or until a skewer inserted into the center of each cake comes out clean, about 16 to 20 minutes. Remove the cakes from the oven and allow to sit for 5 minutes, before turning out onto a wire rack to cool.To make the buttercream filling: Cream the butter until very soft, and then beat in the confectioners' sugar, and the vanilla extract. When the cakes are cool, spread the buttercream filling on one layer, and top with the second layer, sandwiching the layers together.Make the American frosting as described below. Spread the American frosting quickly over the cake with a palette knife, regularly dipping the knife into a jug of boiling water to help spread the icing. It sets very quickly at this stage, so speed is essential. Scatter with rose petals, if using, or arrange the walnut halves around the top of the cake, and allow the icing to set until it feels dry on the surface.To make the American Frosting: Ensure your cake is ready before you start, as this icing begins to set very quickly. Bring to the boil a saucepan of water large enough to hold a heatproof bowl. Place the egg whites in the bowl and whisk with a hand-held electric beater until very stiff.In a separate saucepan over a medium-high heat, dissolve the sugar in the water and boil for 5 to 10 minutes until the liquid is thick and syrupy and has reached the 'thread' stage - when the last few drops that fall from a metal spoon dipped into the syrup come off in one long, quite thick and syrupy thread.Pour the boiling syrup over the stiffly beaten egg whites, whisking all the time with the hand-held beater. Place the bowl in the saucepan of simmering water. Continue to whisk over the water for 10 to 15 minutes until the icing is snow white, very thick and meringue-like.Spread quickly over the cake with a palette knife, regularly dipping the knife into a jug of boiling water. The icing sets very quickly at this stage, so speed is essential."
            ]
        }, {
            "tag": "side",
            "patterns": [
                    "Dandelion Salad with Pomegranate Seeds, Pine Nuts, and Roasted Delicata Squash : Whisk pomegranate juice and vinegars in bowl. Gradually whisk in oil. Season with salt and pepper. Rewhisk before using.Melt 2 teaspoons butter in heavy large nonstick skillet over medium-high heat. Add 1/3 of squash wedges. Cook until browned on both sides, about 5 minutes total. Transfer squash wedges to rimmed baking sheet. Repeat 2 more times with remaining butter and squash wedges. Sprinkle squash with salt and pepper. (Can be prepared 6 hours ahead. Let stand at room temperature.)Preheat oven to 450°F. Transfer squash to oven; bake 20 minutes.Mix greens, pomegranate seeds, and pine nuts in large bowl. Toss with half of dressing. Divide among plates; top with squash. Drizzle with dressing.",
                    "Cheese and Bean Pupusas (Salvadoran Stuffed, Griddled Tortillas) with Cabbage Slaw: 1. Using wet hands, roll masa dough into 15 golf-ball-sized balls. Place balls on a baking sheet and cover with a moist towel. Working with one ball at a time, use your thumb to press a deep indent into the ball, then use your hands to work it into a small \"bowl\" with a 1/4-inch-thick edge.2. Place about 1 heaping tablespoon refried beans into the bottom of the \"bowl,\" then top with about 1 heaping tablespoon shredded cheese. Using moist fingers, carefully bring dough edge together, enclosing the filling within, and press to seal. Roll the ball in your hands to return it to a uniform ball shape. Carefully pat pupusa down into a flat round about 4 inches wide and about 3/4 inch thick; if edges crack, run a wet finger around them to smooth them. Place pupusas on a baking sheet and keep covered with a towel as you work. Repeat with remaining masa balls and fillings.3. Lightly coat a large cast iron skillet with oil and heat over medium heat until shimmering. Working in batches, add pupusas and fry, turning once, until well-browned and crisp, about 4 minutes per side. Drain pupusas on a paper towel-lined plate, than transfer them to plates and top with curtido. Serve with hot sauce and lime wedges, if desired.",
                    "Rainbow Rice: Chop peppers and onions into small pieces. Saute peppers and onions in olive oil and season with garlic and black pepper. Add mushrooms and olives to the mix. Slow cook 1 cup of rice with water according to package instructions. When done add peppers, mushrooms, onions and olives.",
                    "Grilled Bratwurst With Beer, Mustard, and Sauerkraut: 1. Light 1 chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil grilling grate.2. Combine beer, mustard, and sauerkraut in a 10-inch square-disposable aluminum pan. (Alternatively, construct a tray out of a double layer of heavy-duty aluminum foil, 10 inches square, with sides about 2 inches high.) Stir until mustard is broken up and mixture is homogeneous. Add thyme sprigs or bay leaves (if using). Nestle sausages into sauerkraut.3. Place tray on hot side of grill and cook until simmering, about 4 minutes. Slide to cooler side of grill. Cover grill, with vents over bratwurst. Cook with all vents open until bratwurst register 140 to 145°F (60 to 63°C) on an instant-read thermometer, about 20 minutes, turning once in the middle.4. Remove lid. Using tongs, remove bratwurst from sauerkraut and place directly on cooking grate over hot side of grill. Cook, turning occasionally, until well browned and crisp, about 3 minutes total. Return to sauerkraut. Toast buns over hot side of grill, if desired. Serve bratwurst with buns, mustard, and sauerkraut from pan.",
                    "Wonton Soup with Mushroom-Zucchini \"Meatballs\" : Pulse ginger, garlic, and miso in a food processor, scraping down sides of bowl, until smooth. Transfer half of mixture (about 2 Tbsp.) to a small bowl; set aside. Add three-quarters of zucchini and cremini mushrooms to food processor and pulse until uniform and finely chopped, about 45 seconds; transfer to a medium bowl. Pulse remaining zucchini and cremini mushrooms until combined, about 10 seconds; transfer to same medium bowl.Heat 1 Tbsp. coconut oil in a large nonstick skillet over medium. Add zucchini mixture and 1 1/2 tsp. salt and cook, spreading mixture flat and stirring occasionally, until beginning to brown and liquid evaporates, about 12 minutes. Transfer to a large bowl. Add egg, breadcrumbs, 1 Tbsp. soy sauce, 1 Tbsp. sesame oil, and 2 Tbsp. chopped cilantro and toss to combine.Heat 1 Tbsp. coconut oil in a large saucepan over low. Add reserved ginger mixture and cook, stirring occasionally, until fragrant and beginning to brown, about 2 minutes. Add broth and simmer until ready to use.Meanwhile, grease a rimmed baking sheet or large plate with coconut oil. Roll heaping tablespoonfuls of zucchini mixture into balls with your hands (you should have about 25). Transfer balls to prepared sheet.Add remaining 1 Tbsp. soy sauce, 1 Tbsp. sesame oil, and 1/2 tsp. salt to broth. Gently add meatballs with a slotted spoon, cover, and cook until meatballs are puffed and cooked through, about 5 minutes. Uncover, add bok choy, and cook until crisp-tender, about 3 minutes. Add snow peas and beech mushrooms, then drop in wonton wrappers one at a time. Cook, tilting pot back and forth to evenly cook meatballs and vegetables (do not stir to avoid breaking up meatballs), until vegetables are crisp-tender and wontons are cooked through, about 2 minutes.Divide soup among bowls, top with scallions and 1 Tbsp. cilantro leaves, and serve.Soup can be made 3 days ahead; cover and chill.",
                    "Sablé aux Olives Noires: 2. Hard-cook the egg in boiling water for 10 minutes. Cool it under running water. Shell the egg, slice it in half; remove and reserve the yolk.2. Pit the olives. Pat them dry to remove their layer of oil and chop them coarsely.3. In a food processor fitted with the plastic blade, add the ingredients in the following order: butter, oil, confectioners’ sugar, sea salt, hard-cooked egg yolk, flour, cornstarch, and finally, chopped olives. Process briefly, then form the dough into a ball, cover in plastic wrap, and chill in the refrigerator for 2 hours.4. Adjust oven racks to upper and lower middle positions and preheat a convection oven to 325°F or a traditional oven to 350°F.5. Divide the dough into two equal pieces. Flour a work surface, and roll out each piece into a ⅜-inch-thick round. Wrap in a piece of plastic wrap and store in the refrigerator until needed. Line baking sheets with parchment paper. Using a 2¼-inch-diameter cookie cutter, cut the dough into rounds and place them as you do so on the lined baking sheets.6. Place the baking sheets in the oven and bake for 18 minutes (if using a traditional oven, rotate the baking sheets back to front and top to bottom once during baking). Transfer the cookies to wire racks and cool completely before storing them in an airtight container.",
                    "Sous Vide Corn on the Cob: 1. Preheat a water bath to 183°F using a sous vide precision cooker. Place corn, butter, and aromatics inside 1 to 2 vacuum-seal bags and seal bags. Add two extra seals on each end to ensure sticking.2. Clip a heavy metal spoon or knife to the edge of each sous-vide bag with a heavy-duty binder clip to weigh the court down. Place in sous vide cooker and cook for 30 minutes. Open bags, remove corn from husks, discard aromatics and husks, and serve corn, passing extra butter at the table.",
                    "Rumaki Teriyaki: Stir together the teriyaki sauce and garlic in a medium bowl, then add the livers and water chestnuts. Toss to coat. Marinate, covered, in the refrigerator for 1 hour. Soak 24 toothpicks in cold water for at least 1 hour.Preheat the boiler. Remove the livers and water chestnuts from the marinade and discard the marinade. Lay 1 bacon half on a cutting board and place 1 piece of liver and 1 water chestnut in the center. Fold one side of the bacon over them, and thread a toothpick through the bacon, then the chestnut and liver. Wrap the remaining bacon edge around this parcel and secure on the toothpick. Repeat with remaining ingredients to make 24 rumaki.Broil the rumaki on a rack set over a baking sheet (covered with aluminum foil for easy clean up) 2 inches from the heat for 4 minutes. Flip them over and broil for 2 minutes more. Brush the rumaki with additional teriyaki sauce and return to the broiler for 2 more minutes. Place on a serving tray and serve immediately.",
                    "Roasted Beets With Citrus, Feta and Walnuts: 1. Preheat the oven to 425°F. Wipe or scrub the beets clean, then trim the stems down to one-inch, leaving the “tails” on. Place the beets on a large piece of aluminum foil and drizzle with 2 tablespoons of the olive oil. Wrap the foil around the beets to form a neat packet, then roast directly on a rack in the middle of the oven until tender when pierced with a knife, about 1 hour. Unwrap the beets and let sit until cool enough to handle. Peel the beets by rubbing the skin under cool running water, then cut into 1/8-inch thin slices.2. In a small bowl, whisk together remaining 3 tablespoons olive oil and red wine vinegar. Toss beets, citrus, and dressing together in a large bowl. Season to taste with salt and pepper. Transfer to a serving platter and Drizzle the juices from the bowl over top. Sprinkle feta, walnuts and scallions over top and serve.",
                    "Macaroni and Cheese Waffles: 1. Place pasta in a large pot and cover with lukewarm water by 2 inches. Add 2 tablespoons salt. Bring to a boil over high heat, stirring occasionally, and cook until pasta is tender, about 6 minutes after coming to a boil. Drain pasta.2. While pasta cooks, heat butter in a large Dutch oven over medium heat until melted. Add flour and cook, stirring, until pale golden blond. Slowly whisk in whole milk. Whisk in hot sauce and mustard. Bring to a simmer. Reduce heat to low and stir in 3/4 pounds grated cheese. Stir until melted. If smoother texture is desired, transfer to a blender and blend on high speed until glossy and smooth.3. When pasta is cooked, add cheese sauce and stir to combine. Pour mixture into a greased rimmed baking sheet and flatten with a spatula. Refrigerate until completely set, about 30 minutes.4. Preheat a waffle iron. Carefully cut macaroni and cheese into 8 even squares.5. Using a wide spatula, carefully lift one square and plate it on a cutting board. Cover top with 1/4 of remaining cheese. Place another square of macaroni on top of cheese, creating a sandwich.6. Place sandwich in waffle maker. Close and cook until golden brown on both sides and cheese has crisped up, about 6 minutes. Remove from waffle iron and serve with syrup and hot sauce. Repeat steps 4 through 6 for remaining waffles.",
                    "Fava Bean and Asparagus Salad: Preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing occasionally, until fragrant but not browned, 5–8 minutes. Let cool.Cook fava beans in a large saucepan of boiling salted water until tender, about 4 minutes. Using a slotted spoon, transfer to a colander set in a bowl of ice water. Drain, remove skins, and transfer beans to a small bowl.Combine shallot and vinegar in another small bowl; season with salt and pepper and set aside at least 10 minutes. Whisk oil into shallot mixture; season vinaigrette with salt and pepper.Combine beans, asparagus, watercress, mint, and tarragon in a large bowl; add vinaigrette and pistachios and toss to combine. Transfer to a serving platter and top with chive blossoms, if using.",
                    "Rich and Creamy Gravy With Fresh Herbs: 1. Melt butter over medium high heat in medium saucepan. Whisk in flour and cook, stirring frequently, until golden blonde, about 2 minutes.2. Gradually add in turkey drippings or stock in a steady stream, whisking constantly. Bring to a boil, reduce to a simmer, and cook until reduced to 3 cups, 10 to 15 minutes.3. Stir in heavy cream, sage, thyme, and rosemary. Continue to cook until warmed through, about 2 minutes. Season with salt and pepper to taste. Serve immediately or store in an airtight container in refrigerator for up to a week, reheating over medium-low heat before serving.",
                    "Roasted Carrot, Parsnip, and Potato Coins : Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 375°F. Spray 2 heavy large rimmed baking sheets with nonstick spray. Cut carrots and parsnips into 3- to 4-inch lengths. Fit processor with 1/4-inch-thick slicing disk. Working in batches, place carrot pieces upright and fitting snugly side by side in feed tube of processor. With machine running, use plunger to push down firmly on carrots and cut uniform round slices. Transfer carrot coins to extra-large bowl. Repeat with parsnips, then potatoes.Add olive oil, 2 teaspoons coarse salt, coriander, cardamom, and freshly ground black pepper to vegetable mixture and toss to coat. Divide mixture between prepared baking sheets. Roast vegetables until tender and golden brown around edges, about 1 hour. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm in 350°F oven until heated through, about 15 minutes.Transfer roasted vegetable coins to large bowl and serve.",
                    "Yellow Rice: Heat the oil in a medium saucepan, with a tight-fitting lid, over medium-high heat. Add the onion, pepper, and annatto, and cook, stirring, until somewhat soft, about 2 minutes. Add the rice and cook, stirring, until toasted, about 2 minutes more. Add water, salt, and bay leaf and bring to a boil. Wrap the lid tightly with a kitchen towel. Cover the rice, lower the heat to a simmer, cook for 20 minutes.Remove the rice from the heat and set aside, covered, for 10 minutes. Remove the lid and fluff the rice with a fork. Serve with the black beans.Put the beans in a large saucepan, add the water and bay leaf, and bring to a boil. Set aside, covered, for 1 hour.Return the beans to a boil, lower the heat to a simmer, cook uncovered, for 1 1/2 hours.Heat the oil in a medium skillet over medium-high heat. Add the onion and peppers and cook, stirring, until soft, about 5 minutes. Add the garlic, cumin, oregano, and coriander and cook, stirring, until fragrant, about 1 minute more. Add the onion mixture to the beans and continue simmering until the beans are very tender and the liquid has thickened, about 1 1/2 hours more.If the beans seem too thick, adjust the consistency with a little bit of water. Stir in the vinegar, season with the salt, cayenne, and pepper to taste. Serve.Yield: about 4 side dish servings",
                    "Wild Rice Dressing: Preheat oven to 350°. Toast pecans on a rimmed baking sheet, tossing once, until slightly darkened and fragrant, 6–8 minutes. Let cool, then coarsely chop.Cook wild rice in a large pot of boiling salted water until most of the grains have split and all are tender, 40–50 minutes; drain and rinse under cold running water. Shake off as much water as possible and let cool.Meanwhile, whisk vinegar, orange juice, and honey in a large bowl to combine. Add garlic and let sit 10 minutes to infuse. Fish out garlic; discard. Add rice and toss to coat.Heat ¼ cup oil in a large skillet over medium-high. Cook leeks, stirring occasionally, until tender and browned in spots, 8–10 minutes. Season with salt and transfer to bowl with rice; toss to coat.Wipe out skillet and heat another ¼ cup oil over medium-high until just beginning to smoke. Arrange mushrooms in skillet in a single layer and cook, undisturbed, until undersides are golden brown, about 2 minutes. Season with salt and pepper, toss, and continue to cook, tossing often and reducing heat as needed to avoid scorching, until golden brown all over, about 3 minutes longer. Mix in thyme and immediately transfer to bowl with rice. Add pecans and chives and drizzle with more oil; toss once more.Do Ahead: Rice can be cooked 1 day ahead. Let cool; cover and chill. Dressing can be made 3 hours ahead; store tightly wrapped at room temperature.",
                    "Milwaukee Dill Refrigerator Pickles: 1. For the Cold-Water Soak: In a large bowl, combine 1 gallon (4 liters) cold water with the 1 cup salt, stirring to dissolve the salt. Meanwhile, wash cucumbers, then trim off the flower-end (opposite of the stem) using a paring knife. Place cucumbers in cold saltwater bath. Let stand while you prepare the brine.2. For the Pickling Spice Mix and Brine: In a small bowl, stir together 2 tablespoons mustard seed with the allspice, juniper, turmeric, coriander, cloves, ground ginger, bay leaves, cinnamon, and star anise, if using. Measure out 1 tablespoon pickling spice blend and wrap in a either a cheesecloth sachet or metal tea strainer. Reserve remaining pickling spice for a future batch.3. In a medium stainless-steel saucepan, combine vinegar with 2 cups (475ml) water, the 2 tablespoons salt, and sugar, if using (sugar rounds out the sharp vinegar flavor, but is optional and a matter of personal preference). Add spice-mix sachet and set over medium heat, cover, and bring to about 115&degF (46°F) (just warm enough to dissolve the salt and sugar and infuse the brine with spice flavor). Remove from heat and let stand 15 minutes, then remove and discard spice sachet. Let cool to room temperature.4. Wash 2 (1-quart) glass canning jars with warm soapy water and rinse well. Divide the sliced onion, garlic, dill, and remaining 2 tablespoons mustard seed between the two jars, pressing firmly into the bottom.5. Drain cucumbers. Pack each jar with cucumbers, making sure the cucumbers do not rise above the shoulder of the jar (the curve just under the opening). Pickles should be packed firmly enough that the don't move around at all when the jar is shaken.6. Pour cooled brine into each jar, making sure cucumbers are completely covered by the brine.7. Close jars and transfer to refrigerator. Pickles will be ready after 3 weeks, and will keep refrigerated for up to 2 months.",
                    "Chilaquiles: Preheat oven to 425 degrees F.Gather your ingredients.Preheat a stainless 3-quart pot over high heat and a large cast-iron skillet, 10 to 12 inches, over medium-low heat; this will be your serving platter.Remove the stems and seeds of your dried chilies and toast in the pot, 2 minutes. Remove, then add oil, onions and jalapeno pepper. Soften onions, 3 to 4 minutes.Stack and cut the corn tortillas into 8 pieces, halved across, and then cut into 4 equal wide slices. Arrange on parchment lined baking sheet and spray with cooking spray. Bake to deeply golden and fragrant, 10 minutes.To onions, add pimenton, oregano and garlic. Stir and add water. Let it absorb, 1 to 2 minutes. Add chilies back to pot with chicken or vegetable stock, tomatoes, honey and cocoa powder if using. Simmer 7 to 8 minutes to plump the peppers. Puree in high powered blender or food processor, and then transfer to large cast-iron skillet. Reserve any extra in an airtight container for enchiladas or more chilaquiles.Chop red onion, cilantro and thinly slice radishes with truffle shaver, sharp knife or mandoline. Crumble the cotija or queso fresco. Shred the Pepper Jack cheese.Add tortillas to sauce in cast-iron skillet and toss to coat. Top with cheeses and place back in the oven for 5 to 10 minutes, or until cheese is melted and bubbling.Place 2 small nonstick skillets over medium heat (have some lids or foil on hand). Add a pat of butter to each pan, then crack an egg into each pan and cover. Cook until whites are solid and yolks still soft. Remove to a plate and repeat.Remove skillet from the oven and top with red onions, cilantro, radishes, pickled peppers and eggs.Serve the chilaquiles from the pan.",
                    "Creamy Dijon Leeks: Halve 1 bunch leeks lengthwise, then cut into 3-inch pieces. Cook in a steamer basket until tender, 10 to 12 minutes. Cook 1 minced shallot in a saucepan with 1 tablespoon olive oil, 2 minutes; season with salt. Add 1 tablespoon flour and cook 1 minute. Whisk in 1 cup chicken broth and cook until thickened, 4 minutes. Whisk in 1 1/2 tablespoons dijon mustard and 3 tablespoons minced parsley. Spoon over the leeks.",
                    "Farmers' Market Quinoa Salad: Preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool, then coarsely chop.Meanwhile, cook green beans and sugar snap peas in a pot of boiling salted water until no longer raw but still very crunchy, about 2 minutes. Using a slotted spoon, transfer to a bowl of ice water and let sit until cold, about 3 minutes. Drain, pat dry, and thinly slice into bite-size pieces.Blend herbs, oil, vinegar, mustard, and 2 Tbsp. toasted pistachios in a blender, adding water by the tablespoonful if dressing is too thick, until smooth and the consistency of heavy cream. Season with salt and pepper.Toss beans, peas, broccoli, pea shoots, quinoa, and remaining toasted pistachios in a medium bowl to combine. Drizzle salad with dressing and toss again to nicely coat everything; season with salt and pepper.",
                    "Grilled Asparagus, Zucchini, and Bread Salad with Olive-Caper Dressing: 1. Place onion slices flat on cutting board thread two wooden skewers through each onion slices to keep them flat as they grill. Place onions, zucchini, asparagus, and bread on two large rimmed baking sheets. Drizzle evenly with 1/4 cup olive oil and rub with hands to coat all the vegetables and bread evenly. Season everything with salt and pepper. Set aside.2. Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. If using a gas grill, preheat half the grill to high.3. When fire is ready, place bread over cool side of grill. Place onions in center of grill. Place zucchini cut-side-down over hot side. Cook, turning once until well charred on both sides and just starting to become tender, about 4 minutes total. Return to baking sheet. Check bread and flip and rotate to make sure it's drying evenly. Check onions and flip if necessary.4. Add asparagus to hot side of grill and cook, turning occasionally until well charred and barely tender, about 3 minutes total. Return to baking sheet. Continue cooking onions until charred and tender throughout, about 10 minutes total. Return to baking sheet.5. When bread is mostly dry, transfer to hot side of grill and cook, turning occasionally, until well toasted and lightly charred, about 1 minute total. Return to baking sheet. Split lemon and place on grill cut-side-down. Grill until lightly charred and warm about 4 minutes.6. Combine olives, capers, parsley, vinegar, and remaining 1/4 cup olive oil in a large bowl and whisk to combine. Cut zucchini, asparagus, bread, and onions into rough chunks and add to bowl. Season with salt and pepper and toss everything well to combine, adding extra olive oil to taste if desired.7. Transfer salad to a bowl and serve with charred lemon halves.",
                    "Salami Roll-Ups: Mix together the cream cheese and chives in a bowl. Cut the pimentos into small pieces.Spread a thin layer of the cream cheese mixture onto a salami slice; fold in half, then half again to form a wedge shape. Thread 2 pieces of pimento onto toothpicks and use to secure the roll-up. Repeat for the remaining salami slices.Slice the roll-ups in half and serve on a platter.",
                    "Purple Potatoes with Rosemary and Olives: Put the potatoes in a large saucepan with enough water to cover by 2 inches; season with salt. Bring to a boil over high heat, and then reduce the heat to maintain a steady simmer. Simmer until a paring knife just pierces through the potatoes, 20 to 25 minutes.Meanwhile, combine the oil and rosemary in a small skillet. Heat over medium heat until the rosemary sizzles; cook until fragrant, about 1 minute, and then remove from the heat and let stand.Drain the potatoes. When cool enough to handle, use a thin-bladed sharp knife to cut each in quarters. Very gently toss with the rosemary oil and olives. Season with salt and pepper. Serve warm.",
                    "Greek Yogurt Labneh: Line a large sieve with cheese-cloth; set over a medium deep bowl. Place yogurt in sieve. Gather edges of cheesecloth to cover yogurt. Place in refrigerator and let drain for 2-3 days.Gently squeeze out any excess liquid; discard liquid in bowl (yogurt will be very thick and resemble soft goat cheese). Roll yogurt into 3/4 inches balls. Place in an 8-ounces glass jar.Whisk oil, herbs, and lemon zest in a small bowl to combine. Season with salt and pepper. Pour over yogurt in jar. Cover; place in refrigerator and let marinate for at least 8 hours and up to 2 weeks.",
                    "DECORATIVE CENTERPIECES Port Wine Meringues with Swirls Bouquet: In a saucepan, over medium heat, simmer the port wine until reduced by 3/4, about 30 minutes. Cool completely. Syrup should be thick but still liquid when cooled.Put a cooling rack onto a parchment lined sheet pan to catch any drips. Using a small clean paint brush, paint a swirl line on half each meringue. Arrange them on cooling rack and let them dry overnight.Carefully pile the meringues into a large wide lipped vase or centerpiece of your choice. Syrup will still be sticky on meringues so be careful not to touch it or over handle the meringues.",
                    "BBQ Chicken and Fresh Strawberry Salad: HEAT greased grill to medium-high heat.GRILL chicken 10 min. on each side or until done (170F), turning and brushing occasionally with barbecue sauce. Cut into strips.COVER plate with greens; top with berries, onions and chicken.TOP with dressing.",
                    "Ultra-Crispy New Potatoes With Garlic, Herbs, and Lemon: 1. Adjust oven racks to lower and upper position and preheat oven to 500°F. Line two rimmed baking sheets with foil and place in oven. Place potatoes in a large saucepot and cover with cold water by 1-inch. Add 2 tablespoons salt and vinegar. Bring to a boil over high heat, reduce to a simmer, and cook until exteriors are tender, about 5 minutes. Potatoes should show a slight resistance when poked with a paring knife or a cake tester. Drain potatoes and transfer to a large bowl.2. Add 2 tablespoons oil to bowl with potatoes. Season with pepper and more salt to taste then toss until exteriors are slightly bashed up and coated in a thin layer of potato/oil paste. Spread remaining canola oil evenly over surfaces of hot foil-lined baking sheets, then divide potatoes evenly between them, using a thin spatula to arrange them cut-side down and using oven mitts or kitchen towels to maneuver the hot pans.3. Transfer baking sheets to the oven and roast until the bottoms of the potatoes are crisp and golden brown and can be easily lifted from the foil, about 30 minutes total, swapping top the trays top for bottom and rotating them once half way through roasting. Using a thin metal spatula, loosen all of the potatoes from the pan and toss. Return to oven and continue roasting until pale golden brown all over, about 15 minutes longer. Add shallots to pans and toss to coat in oil. Return to oven and roast until potatoes and shallots are deep golden brown, about 10 minutes longer. Remove from oven and transfer to a large bowl.4. Add parsley, chives, lemon zest, garlic, and olive oil to potatoes and toss to coat. Season to taste with salt and pepper. Serve immediately.",
                    "Grapefruit with Campari Syrup : Cut peel, including all white pith, from 2 grapefruit with a sharp knife. Cut segments free from membranes, letting them fall into a medium-mesh sieve set over a bowl. Squeeze juice from membranes into sieve, then discard membranes. Transfer grapefruit segments to a heatproof bowl and chill, uncovered, while making syrup.Squeeze juice from remaining grapefruit through sieve into bowl. Stir together 1 cup juice (reserve remainder for another use), 2 tablespoons sugar, and a pinch of salt in a nonreactive 10-inch heavy skillet and boil over moderately high heat, swirling skillet occasionally, until reduced to about 1/2 cup, about 4 minutes. Stir in Campari and sugar to taste, then immediately pour hot syrup over chilled grapefruit. Chill, uncovered, 15 minutes."
                ]
        }, {
            "tag": "drink",
            "patterns": [
                "Seasonal Milk Punch: Using a wooden spoon, muddle lemon zest, lime zest, orange zest, granulated sugar, and brown sugar in a medium bowl until fragrant, about 30 seconds. Add Port and bitters and let sit 15 minutes. Stir in bourbon, rum, lemon juice, lime juice, orange juice, and 1 cup water.Bring milk to a bare simmer in a medium saucepan. Immediately pour milk into Cognac mixture (milk will curdle right away). Cover and chill at least 1 hour and up to 24 hours.Strain mixture through a fine-mesh sieve lined with cheesecloth into a large bowl. Cover and chill until cold (any remaining curds should settle at the bottom of the pitcher).Carefully ladle clarified punch into a clean pitcher, leaving any remaining curds behind. Chill until ready to serve.",
                "Persephone: 1. Stir applejack, sweet vermouth, sloe gin, lemon juice, and simple syrup with ice until well chilled. Strain into a chilled coupe.",
                "Tropical Oatmeal Smoothie: Add the oats to a blender, cover and blend to a fine powder. Add 2 ice cubes, banana, coconut milk, lemon juice, vanilla and 1/8 teaspoon salt, cover and blend until smooth. Add the mango and pineapple, cover and blend until smooth, at least 1 minute.Pour the smoothie into two large chilled glasses and garnish with a pineapple wedge.",
                "Banana, Nutella, and Coconut Yogurt Shake with Chai Spices: 1. Combine frozen bananas, yogurt, Nutella, coconut milk, cinnamon, cardamom, ginger, and clove in a blender and blend on high until smooth. Serve garnished with coconut flakes if desired.",
                "Sazerac : In old-fashioned glass, add ice and set aside. In another, combine sugar, bitters, and water. Muddle until sugar is completely dissolved. Add rye whiskey, fill with ice, and stir well, about 15 seconds. From first glass, discard ice, then add Herbsaint. Holding glass horizontally, turn it so that Herbsaint completely coats the interior. Discard any excess. Strain contents of second glass into chilled glass. Twist lemon peel directly over drink to release essential oils, and serve.",
                "Limoncello: Put the lemon peels, lavender, if using, and rum or vodka in a container and let stand for 4 weeks.Strain the mixture into a decanter.Mix the sugar and water in a medium saucepan and bring to a boil. Reduce the heat and simmer until the sugar has dissolved. Let cool before adding to the rum mixture.Serve in small aperitif glasses.Store in the freezer for up to 1 year.",
                "Chocolate Mint Vodka Infusion: Combine vodka and cocoa beans in a sealable container and store in a warm, dry place. Agitate the mixture 2 or 3 times a day for 1 week. Six hours before serving, add the mint leaves. Strain through a coffee filter into a bottle, seal and store in your freezer.Serving suggestion: Serve ice cold without a garnish.",
                "Raspberry, Mint, and Kefir Smoothie: 1. For the Kefir Ice Cubes: Divide kefir between 4 slots of an ice cube tray, using about 2 tablespoons for each cube. Freeze overnight, remove from the tray, and store in a zipper-lock bag in the freezer.2. For the Smoothie: In a blender, blend raspberries until a rough puree forms. Add mint leaves, honey, liquid kefir, and kefir ice cubes and blend until completely smooth. Garnish with additional raspberries, if desired, and serve immediately.",
                "The Witty Comeback: Combine rye, Averna, lemon juice, and ginger simple syrup in a cocktail shaker; fill shaker with ice. Shake until outside of shaker is frosty, about 30 seconds. Strain into a coupe glass or a rocks glass filled with ice and garnish with orange twist.",
                "Sweet Peach Frozen Daiquiri With White Pepper and Green Tea: 1. For the White Pepper-Green Tea Syrup: Bring water to a boil in a medium saucepan. Stir in sugar to dissolve. Remove from heat and add tea bags. Let steep 5 minutes, then remove tea bags. Stir in peppercorns. Cover and let sit for 1 1/2 hours. Strain and bottle into an airtight container. Keep refrigerated up to 2 weeks.2. For the cocktail: At least 1 day before you want to serve the drink, combine rum, lime juice, and White Pepper Green Tea Syrup in an airtight container. Store in the freezer for at least 8 hours. When ready to serve, pour pre-chilled base into blender with peaches and ice. Blend until mixture is uniform and you don't hear chunks of ice rattling when you pause blender. Pour into serving glasses and, garnish with a peach slice and lime zest, and serve.",
                "DIY Celery Bitters: 1. Put the lemongrass, coriander, mint, allspice, and gentian root in a sealable glass jar. Muddle briefly to bruise and break the ingredients. Add the celery seed, celery, and vodka, then seal and shake. Let this mixture steep for 12 days, shaking daily.2. Strain out solids using a fine-mesh strainer, reserving the liquid in the original jar. Place the solids in a sauce pan along with the water and cook on medium heat for 5 to 7 minutes. It will come to a gentle boil and the liquid will reduce slightly. Let this cool, then return all the pan's contents to the original jar. Let steep for two more days.3. Strain out the solids, then filter the liquid through a coffee filter or cheese cloth. If using cheese cloth, you may have to do this two or three times until the liquid is free from debris. Store at room temperature for up to a year.",
                "Basil Lime Cooler: 1. For the Basil Syrup: Combine water, sugar, and basil leaves in a small saucepan. Heat over high heat until boiling, stirring to dissolve sugar. Reduce to a simmer and continue to cook for 10 minutes. Remove from heat and let cool. Strain through a fine mesh strainer. Basil syrup will keep for one week in a sealed container in the refrigerator.2. For the Cocktail: Combine 1 ounce basil syrup, lime juice, and vodka in a cocktail shaker filled with ice. Shake vigorously for 10 seconds. Fill a collins glass with ice, then strain the cocktail into the glass. Add extra basil leaves to the glass, top with seltzer and stir gently. Garnish with straw and basil sprig.",
                "Orangeade with Carrot Juice Floater: Mix together the orange juice and 2 cups cold water in a pitcher. Fill 4 glasses with ice, add enough orangeade to come three-quarters of the way up the glasses and top each with a shot of carrot juice. Serve immediately.",
                "Broccoli with Cheddar Cheese Sauce: Fill a medium saucepan with 1 inch of water and place a steamer inside. Bring the water to a boil, place the broccoli in the steamer, reduce the heat to medium, cover and steam until tender and bright green, about 5 minutes.Transfer the broccoli to a bowl and sprinkle lightly with salt and pepper. Top the broccoli with the Cheddar Cheese Sauce, or serve it on the side.Melt the butter in a medium saucepan over medium heat until foamy. Spoon the flour over the butter and cook, while stirring, until the flour becomes pasty. Pour in the milk while whisking and season with salt and pepper. Bring to a boil, reduce the heat to a medium simmer and cook for 5 to 8 minutes. Slowly add the cheese by handfuls and stir with a wooden spoon until melted and smooth.",
                "Homemade Tortilla Chips from 'Ultimate Nachos': 1. In a skillet over medium heat, heat the oil to 350º. You'll know the oil is ready when you add a small piece of tortilla to the skillet and it floats and bubbles.2. Cut round tortilla into triangle shapes of any size you want, then add the triangles to the oil.3. When one side becomes golden brown, about 1 minute, flip them over and fry the opposite sides until golden brown.4. Using a slotted spoon, remove the chips from the oil and transfer to paper towels to drain.5. Toss the chips with salt and the cayenne, if using.",
                "Dinner Salad with Radicchio and Roasted Sweet Potatoes: Blend cashews, oil, vinegar, red pepper flakes, fish sauce, honey, garlic, and ⅓ cup warm water in a blender until very creamy, smooth, and pourable. Taste dressing and season with salt.Do Ahead: Dressing can be made 3 days ahead. Cover and chill.",
                "Buff Smoothie: Combine the soy milk, juice, banana, strawberries, blueberries, and the peaches in the carafe of a blender. Cover and refrigerate overnight or up to 8 hours.In the morning, or when the fruit is partially thawed, put the carafe on the base of the blender, start at the lowest speed and slowly accelerate to medium, until you achieve a vortex. Blend on medium for 1 minute. Increase the speed to high and blend for an additional minute. Serve immediately.",
                "Skordalia (Greek Garlic and Potato Spread): 1. Preheat oven to 350°F. Set cubed potatoes in a colander and rinse under cold water until water runs clear. Transfer to a large saucepan and cover with cold water by at least 2 inches. Season water with salt until it is salty like tears. Bring water to a boil over high heat, then reduce heat to medium-low and simmer until a knife easily pierces potatoes with no resistance, 10 to 15 minutes. Drain potatoes in colander, then rinse with hot running water for 30 seconds.2. Meanwhile, in a food processor, combine almonds, garlic, 2 tablespoons (30ml) cold water, and wine vinegar and/or lemon juice. Process until garlic and almonds are reduced to a paste. Season with salt.3. Spread potatoes in an even layer on a rimmed baking sheet and transfer to oven until excess moisture has evaporated and surface of potatoes is dry, about 6 minutes.4. Using a potato ricer or a food mill with the finest disk, mash potatoes into a large mixing bowl. Alternatively, thoroughly mash potatoes with a potato masher in a large mixing bowl.5. Stir in olive oil and almond-garlic mixture until thoroughly incorporated. If skordalia looks like it's breaking slightly (i.e., if the oil does not fully incorporate to form a homogeneous mixture), stir in more cold water, 1 tablespoon at a time, beating well, until mixture is emulsified. Season with salt, then garnish with parsley and serve immediately with warm pita or bread, or chill until ready to serve.",
                "DIY Vodka Bar with Spicy Pomegranate and Lemongrass Limeade Mixers: Make the pomegranate mixer: In a bowl, add the pomegranate seeds, chile, orange juice, orange zest and pomegranate juice. Mix.Make the lemongrass mixer: In a bowl, add the lime juice, pulverized sugar, lime zest and lemongrass. Mix.On a buffet table, set up the mixers, bottles of alcohol, soda water, ice and highball glasses. Place some ice into a glass, add a spoonful of mixer, a shot of alcohol and top off with soda water."
            ]
        }, {
            "tag": "main",
            "patterns": [
                "Baked Acorn Squash With Wild Rice, Pecan, and Cranberry Stuffing: 1. Adjust oven rack to middle position and preheat oven to 375°F.2. Remove seeds from acorn squash: using a sharp chef's knife, trim away a small flat slice from the bottom of each squash so it sits flat. Then, cut off the top 1/2\" of each squash, exposing the seeds. Use a tablespoon to scrape out seeds and fibers. Place squash on a baking sheet, season lightly with salt and pepper, and drizzle each squash with 1/2 teaspoon olive oil. Bake for 45 minutes, then remove from oven.3. In the meantime, prepare the stuffing: heat 2 tablespoons olive oil in a large cast iron skillet over medium heat until shimmering. Add the onion, garlic and thyme and cook, stirring occasionally, until onion sweats but does not brown, about 4 minutes. Add cooked wild rice and cooked white rice to the skillet and stir to combine. Add chopped pecans, dried cranberries and ricotta salata and stir to combine. Season to taste with salt and pepper.4. Stuff each acorn squash with about 1/4 of stuffing mixture, packing stuffing into squash cavity and mounding it slightly. Drizzle each squash with 1/2 teaspoon olive oil and bake until squash is tender and stuffing browns slightly, about 40 minutes.",
                "Double whammy arrabbiata: Method Prick the whole, fresh chillies all over with a small sharp knife and add to a large frying pan. Cover with about 1cm of oil and let them sit on a really low heat – almost so they’re coddling – for about 10 minutes.Once they’ve softened, and the oil has taken a lot of the chilli flavour, pour away most of the oil (save it in a jar for a lovely chilli oil).Peel and finely slice the garlic, then add to the pan with the anchovies and oregano. Fry gently for a few minutes. Stir in the tinned tomatoes or passata, then bring everything to the boil. Be careful not to break the chillies — this will make the sauce very hot!Meanwhile, cook your pasta according to the packet instructions and get started on the pangrattato. Tear the bread into a food processor and blitz with a pinch of sea salt to make fine crumbs.Peel and crush the garlic, then add to a large pan with a good lug of oil on a medium heat. Allow it to flavour the oil, then chop and add a few pinches of dried chilli.After a minute or two add the breadcrumbs, then toss so everything gets coated in the garlic oil. Fry for 5 to 7 minutes, or until you’ve got crisp, golden breadcrumbs. Take the pan off the heat, leaving the breadcrumbs in there to stay warm.Drain the pasta, then add to the large pan with your sauce. Toss quickly to coat.Divide everything between bowls (making sure everyone gets a softened whole chilli). Sprinkle over some pangrattato and get stuck in.",
                "G's Quick Jambalaya: Heat a large pan over medium-high heat, and then pour in some oil. Add the bell peppers, garlic and shallots and sweat. Add the sausage, prawns and shrimp, pour in the white wine and bring to a simmer. Stir in the white rice, crawfish and butter. Season with the lemon juice and add cayenne, salt and black pepper to taste.",
                "Salmon Baked in Foil: Preheat the oven to 400 degrees F.Sprinkle salmon with 2 teaspoons olive oil, salt, and pepper. Stir the tomatoes, shallots, 2 tablespoons of oil, lemon juice, oregano, thyme, salt and pepper in a medium bowl to blend.Place a salmon fillet, oiled side down, atop a sheet of foil. Wrap the ends of the foil to form a spiral shape. Spoon the tomato mixture over the salmon. Fold the sides of the foil over the fish and tomato mixture, covering completely; seal the packets closed. Place the foil packet on a heavy large baking sheet. Repeat until all of the salmon have been individually wrapped in foil and placed on the baking sheet. Bake until the salmon is just cooked through, about 25 minutes. Using a large metal spatula, transfer the foil packets to plates and serve.",
                "Paneer Curry with Peas: Place flour in medium bowl. Add paneer to bowl; toss to coat with flour. Heat 2 tablespoons ghee in heavy large nonstick skillet over medium-high heat. Shake excess flour from paneer; add to skillet and cook until browned in spots, turning occasionally, about 4 minutes. Transfer paneer to plate; set aside. Reserve skillet.Place onion pieces in processor. Using on/off turns, process until finely chopped but not watery. Heat remaining 3 tablespoons ghee in reserved skillet over medium heat. Add cumin seeds and stir until aromatic, about 1 minute. Add chopped onion and cook until beginning to brown, stirring often, about 10 minutes. Add minced ginger, minced garlic, ground coriander, and minced serrano chile with seeds; stir 1 minute. Add crushed tomatoes with puree, 1/2 cup water, and turmeric; bring to simmer. Reduce heat to medium low; cover and simmer until mixture thickens slightly and flavors blend, stirring occasionally, about 15 minutes.Add shelled fresh peas and cooked paneer; gently fold to incorporate evenly. Cook mixture over medium-low heat until peas are tender and paneer is heated through, folding occasionally, about 5 minutes. Fold in garam masala and cilantro. Season curry to taste with salt and pepper. Serve with steamed basmati rice.",
                "Cheesy Baked Pasta with Cauliflower : Preheat oven to 350°F. Cook pasta in a large pot of boiling salted water until about halfway cooked (it needs to be very firm at this stage so that it doesn’t overcook when baked). Drain, reserving 1/2 cup pasta cooking liquid, and run under cold water to stop the cooking. Drain well.Lightly crush cherry tomatoes with your hands in a large bowl. Add mozzarella, provolone, cheddar, Parmesan, cream, and reserved ½ cup pasta cooking liquid and mix to combine. Season generously with salt and pepper. Add cauliflower and cooked pasta and toss to coat. Butter (or lightly coat) a 3-qt. or 13x9x2\" baking dish with butter. Scrape in pasta mixture and spread out into an even layer. Cover dish tightly with foil and bake pasta until hot throughout and steaming when foil is lifted, 20–25 minutes.Remove foil and increase oven temperature to 425°F. Continue to bake pasta until sauce is bubbling and top is browned and crunchy in spots, 25–30 minutes. Let cool slightly before serving.Pasta can be assembled 2 days ahead. Cover and chill until ready to bake.",
                "Walleye With Roasted Grapes and Fingerling Potatoes: 1. Adjust oven rack to middle position and preheat oven to 450°F. Add potatoes to a rimmed 12- by 18-inch baking sheet and drizzle with 2 tablespoons olive oil and season with a pinch of salt and pepper. Toss until evenly coated. Transfer sheet to oven and cook for 10 minutes.2. Carefully remove sheet pan from oven, and use a pair of tongs to move the potatoes to one end. Drizzle a tablespoon of oil over the empty end, and then add the grapes and the walleye fillets skin-side down. Season each fish fillet with a pinch of salt and pepper, and then top with few slices of garlic and a couple slices of lemon. Drizzle remaining tablespoon of olive oil over the fish.3. Return the sheet pan to the oven and cook until fish is fully cooked and potatoes are tender, 10 to 12 minutes.4. Divide the fish, grapes, and potatoes between four plates. Squeeze some juice from the uncut lemon half over each plate. Serve immediately.",
                "Make-Ahead Crispy Chicken Cutlets : Whisk egg yolks, mayonnaise, and salt in a large bowl until smooth. Add chicken and turn several times with tongs until evenly coated.Heat oil in a large skillet over medium-high until shimmering. Add panko and cook, stirring constantly with a wooden spoon, making sure to get around the edges to incorporate darker breadcrumbs, until golden brown, about 5 minutes. Let cool slightly, then stir in mustard powder, if using.Using tongs, place a cutlet in skillet. Pat surrounding toasted panko onto cutlet with one of your hands, pressing firmly to adhere. Turn and repeat on the other side with more breadcrumbs. Lightly shake off excess breadcrumbs. Transfer to a wire rack set inside a rimmed baking sheet (if you are making these ahead and freezing, skip wire rack and place directly on a baking sheet). Repeat with remaining cutlets, spacing evenly apart on baking sheet. Discard any remaining panko. At this point, breaded cutlets can be frozen up to 3 months. Freeze chicken on baking sheets until firm, about 1 hour, then transfer to resealable freezer bags or layer in an airtight container with sheets of parchment between cutlets.Preheat oven to 450°F and bake cutlets until cooked through and juices run clear when pierced with a knife, 10–12 minutes. If cutlets are frozen, they will take a little longer, 14–16 minutes. You can also bake chicken 1 or 2 at a time in a toaster oven at 450°F. Bake directly on rack, 12–14 minutes.",
                "Spaghetti With Tomato Sauce and Pan-Fried Eggplant: 1. Bring a large pot of salted water to a boil over high heat. Meanwhile, heat 2 tablespoons olive oil in a medium-sized saucepan over medium heat until shimmering. Add onion and cook, stirring until soft, 3 to 4 minutes. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add tomatoes and their juices, and use a potato masher or the back of a wooden spoon to break up the tomatoes into small pieces. Cook, stirring occasionally, until tomatoes have reduced into a thick sauce, 15 to 20 minutes. Remove from heat. Blend with an immersion blender or a countertop blender in batches. Add sugar, and season with salt and pepper to taste.2. While tomato sauce cooks, heat 1/2 cup of olive oil in a large 12-inch non-stick skillet over medium heat until shimmering. Spread the eggplant slices out in the skillet. The pieces will immediately soak up most of the oil, but will eventually expel the oil and start to brown. Stir occasionally until eggplants slices are browned on all sides, and just starting to crisp, 8 to 10 minutes. Remove slices with a slotted spoon and drain on paper towels.3. Cook spaghetti in boiling water according to package directions. When almost done, reserve 1/4 cup of pasta water. Drain pasta in a colander, and immediately transfer to the pot with the tomato sauce. Turn heat to medium, add the pasta water, and toss pasta until it is evenly coated with the sauce.4. Divide pasta between four plates. Top each with a quarter of the fried eggplant slices and sprinkle generously with freshly grated parmesan. Serve immediately",
                "Dinner Tonight: Garlic Shrimp with Basil, Tomatoes, and Pepper Flakes: 1. Heat olive oil in medium skillet until almost smoking, then add shrimp and cook, turning once, until just cooked through, about 1 minute per side. Remove with tongs or slotted spoon, leaving oil behind in skillet.2. Allow oil to cool for a minute, then add garlic and red pepper flakes and cook, stirring constantly, until fragrant, about 30 seconds. Add wine and reduce over high heat for 3-5 minutes until at least half has evaporated. Add tomatoes and most of basil and continue cooking until tomatoes begin to lose their shape. Season to taste with salt and pepper.3. Return shrimp to pan and cook until just heated through. Serve with cooked orzo.",
                "Sous Vide Burgers: 1. Preheat a water bath to desired final temperature using a sous-vide cooker, according to the chart above.2. Divide meat into four equal portions and gently shape each one into a patty slightly wider than your buns. Season generously with salt and pepper. Place patties in individual zipper-lock bags. Remove air from zipper-lock bags by closing the bags, leaving the last inch of the top unsealed. Slowly lower into the preheated water bath, sealing the bag completely just before it fully submerges. Cook according to the chart above.3. To Finish in a Pan: Remove the burgers from the bags and place them on a paper towel–lined plate. Pat dry very carefully on both sides and season with additional salt and pepper. Let the burgers rest at room temperature for 10 minutes to dry their exteriors. Before searing the burgers, have your toasted buns and condiments ready to accept them. Heat the oil in a large cast iron or stainless steel skillet over high heat until lightly smoking. Add the burger patties and cook, without moving, until just browned, about 1 minute. Flip the burger and add a slice of cheese to the top surface (if using). Cook until the second side is browned and the cheese is melted, 45 seconds to 1 minute longer. Transfer the burgers to the prepared buns, top as desired, and serve immediately.4. To Finish on the Grill: Remove the burgers from the bags and place them on a paper towel–lined plate. Pat dry very carefully on both sides and season with additional salt and pepper. Let the burgers rest at room temperature for 10 minutes to dry their exteriors. Before searing the burgers, have your toasted buns and condiments ready to accept them. Light one chimney full of charcoal (about 5 quarts of coals). When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Scrape the grill grates clean with a grill scraper, then oil the grates by holding an oil-dipped kitchen towel or paper towels in a set of tongs and rubbing them over the grates 5 to 6 times.5. Place the burgers directly over the hot side of the grill and cook until a deep, rich crust has formed, about 45 seconds to 1 minute. Flip burgers and add cheese (if using). Cook until the second side is browned and the cheese has melted, 45 seconds to 1 minute longer. If the fire threatens to flare up as the burgers drip fat into it, suffocate the fire by closing the grill lid until the flames die out. Alternatively, using a long spatula, transfer the burgers to the cooler side of the grill until the flames subside. Do not allow flames to engulf the burgers. Transfer the burgers to the prepared buns, top as desired, and serve immediately.",
                "Patricia Wells's Zucchini Carpaccio with Avocado, Pistachios, and Pistachio Oil : 1. For the Lemon Zest Salt: Combine the lemon zest and salt in the spice grinder, and grind into a fine powder. Transfer to a small jar and close with the lid. (Store, sealed in the jar, in the refrigerator for up to 1 week. After that the lemon flavor will begin to fade.)2. For the salad: In the jar, combine the lemon juice and flavored salt. Cover with the lid and shake to blend. Add the oil and shake to blend.3. With the mandoline or chef’s knife, slice the zucchini lengthwise as thin as possible. Arrange the slices on a platter and pour the dressing over them. Tilt the platter back and forth to coat the slices evenly. Cover with plastic wrap and let marinate at room temperature for 30 minutes, so the zucchini absorbs the dressing and does not dry out.4. Halve, pit, and peel the avocado, and cut it lengthwise into very thin slices. Carefully arrange the slices of marinated zucchini on individual salad plates, alternating with the avocado slices, slightly overlapping them. Sprinkle with the pistachio nuts. Garnish with the thyme sprigs and flowers and fleur de sel. Serve.",
                "La Reina Sandwich: Preheat an offset smoker for cooking at 250 degrees F.Rub pork collar generously with dry rub. Place pork in smoker and cook, brushing with Honey BBQ Glaze every hour, until internal temperature reaches 150 degrees F, about 5 hours.Let rest for 15 to 20 minutes, then slice into 1/4-inch slices.Meanwhile, put tomatoes in a pan, drizzle with 4 to 6 tablespoons olive oil, and sprinkle each side with dry rub. Cover with foil and smoke in smoker for 1 hour.Meanwhile, place onions in a medium saute pan with 2 tablespoons olive oil. Cook over low heat until onions are caramelized, soft and golden brown, 1 to 2 hours. Mash onions into a chunky paste.Slice open bolillo bread. Melt butter in a large saute pan or comal over medium-high heat. Place bolillo bread pieces in the pan cut-side down and cook until golden and toasted. Drizzle 2 tablespoons olive oil into the same pan. Place sliced pork collar into pan. Drizzle each side with Honey BBQ Glaze. Sear each side of pork for 2 to 3 minutes. (You may also use this same pan to warm up cooled smoked tomatoes, if needed.) Build 6 open-faced sandwiches, spreading a generous layer of caramelized onion paste on each piece of bread, layering the pork on top, layering on smoked tomatoes and drizzling with Honey BBQ Glaze.For the BBQ sauce: Preheat an offset smoker for cooking at 225 degrees F.Whisk together the ketchup, vinegar, mustard, onion, Worcestershire, pepper, dry rub and granulated garlic in a stainless steel or cast-iron pot until smooth. Place in smoker to cook until darkened, medium-thick and the onions have softened, 4 to 6 hours. (Alternately, cook BBQ sauce in a pan on the stovetop over low heat, covered, 4 to 6 hours.)For the glaze: Whisk together honey with 2 1/2 cups BBQ sauce until smooth and creamy (save the remaining BBQ sauce for another use).",
                "Goulash Soup : Pat beef dry. Heat oil in a large heavy pot over medium-high heat until it shimmers, then cook beef, stirring occasionally, until browned and beginning to exude liquid, 3 to 4 minutes. Add onions, garlic, caraway seeds, and marjoram and cook, stirring occasionally, until onions are translucent, about 5 minutes. Add flour and cook, stirring frequently, until mixture sticks to bottom of pot and is deep golden, about 10 minutes. Add tomato paste and cook, stirring, 1 minute, then stir in hot water and 1/2 teaspoon paprika. Bring to a boil, stirring occasionally, then simmer, partially covered, stirring occasionally, until meat breaks apart when pressed with a spoon, 1 1/2 to 2 hours. Chill, uncovered, until cool, then covered overnight (at least 8 hours).Remove solidified fat if desired, then bring soup to a simmer and remove from heat. Transfer meat with a slotted spoon to a bowl and coarsely shred with 2 forks. Return meat to soup and stir in ketchup, Worcestershire sauce, hot sauce, cayenne, sea salt, and remaining 1/2 teaspoon paprika and reheat over medium heat, stirring occasionally. Thin soup with water to desired consistency and season with salt and pepper.",
                "Quicker Chicken and Okra Gumbo: 1. Pulse onion, peppers, and celery in food processor until coarse chopped (don't purée). Add oil to Dutch oven and heat over medium heat until shimmering. Add chopped vegetables, season with salt, and cook, stirring occasionally, until vegetables have softened and are beginning to turn golden, 12 to 15 minutes.2. While the vegetables are cooking, make the roux: Place flour and butter in microwave-safe measuring cup. Heat on high power until butter is just melted, about 1 minute. Stir to combine and continue to microwave, stirring every minute, until roux is a uniform color of deep milk chocolate, 8 to 10 minutes (see note); set aside.3. When vegetables have cooked, stir in garlic, tomato paste, cajun seasoning, smoked paprika, 1/4 teaspoon cayenne, 1/2 teaspoon black pepper, and cook until fragrant, about 1 minute. Stir in roux.4. Slowly stir in chicken broth and beer until mixture has thickened. Stir in okra, chicken, 1/2 teaspoon salt, and bring to simmer. Cover and simmer (adjusting heat if necessary) until okra is softened and chicken is tender, about 20 minutes. Season to taste, serve with rice, season with hot sauce, and garnish with green onions.",
                "Pork Tonkatsu with Shiso and Savoy: For the sauce: In a small glass bowl, whisk up dry mustard and granulated garlic into the Worcestershire, soy sauce and honey. Stir in the ketchup.For the slaw: In a medium glass bowl, whisk up dry mustard, ginger, garlic, soy, honey, vinegar and oil. Quarter, core and mandoline cabbage. Add to dressing and toss. Stack and very thinly slice shiso. Mandoline radish, add and toss with cabbage.For the pork: Pound out pork with bumpy side of meat mallet to 1/8-inch thick, or pound out pork with flat mallet and prick both sides of cutlets with tines of fork. Season both sides of cutlets with salt and pepper.Set up breading and fry station: shallow dishes of flour; beaten eggs; panko mixed with sesame seeds; large frying pan with 1/4-inch oil; wire rack in rimmed baking sheet over paper towels or parchment paper for draining.Bread pork in flour, shake off, dip in egg, drain excess, press in panko. Cook chops until crisp and golden, 5 minutes, turning once. Drain.Serve chops garnished with sesame seeds and chives, sauce spooned across chops and slaw alongside.",
                "Safe Passage Seafood Chowder: In a large saucepan, heat 1 tablespoon of the olive oil over medium high heat, reserving the other 2 tablespoons. Sear each side of the halibut, leaving each side undisturbed for the first 2 minutes or so to allow the surface of the fish to begin to caramelize and to avoid tearing. Cook until done, about 6 to 8 more minutes, then remove to a utility platter. To the same pan add the shrimp and cook until just pink and remove to a bowl. To the same pan add the scallops and cook until opaque and remove to the bowl with the shrimp. Add the mussels to the pan along with 1/2 cup water. Cook until the mussels open. Remove them and the pan juices to a bowl until they are cool enough to handle. (Discard any mussels that do not open.)In the same saucepan, heat the other 2 tablespoons of olive oil and butter. Add the celery and onions, sauteing until translucent. Whisk in the flour gradually to make a roux. Add clam juice and fish stock and mix well to integrate flavors. Reduce heat to low and bring to a simmer. Add carrots and parsley and let cook until fork tender.While the soup is cooking, cut the halibut fillets into 1/2 inch chunks. Then, remove the mussels from their shells and discard shells, but reserving all the liquids in the bowl.When carrots are softened, remove soup from heat and gently fold in halibut, shrimp, scallops, mussels and liquid in the bowl. Season with salt, pepper and crab boil seasoning, to taste.",
                "Meatloaf: Preheat the oven to 120 degrees C (about 250 degrees F).Heat a frying pan over medium heat and add oil. Saute carrots, shallots, mushrooms and garlic until they become soft around the edges, about 2 minutes, then add paprika, nutmeg and 4 grams salt. Cook for 30 seconds, then add BBQ sauce and Worcestershire. Remove from heat and let cool.Meanwhile, mix cream, eggs and remaining 14 grams salt in a bowl until they are a uniform color. Add the bread and allow to soak for around 15 minutes, then blend in a blender (it can still be a bit chunky, but not large pieces). Mix in the meats, then the veg until it looks uniform and is slightly tacky when touched. Line a loaf pan with parchment paper and put mixture into the pan. Bang it on the counter a couple times to ensure that it makes it to the corners. Bake until its internal temperature registers 70 degrees C (about 160 degrees F) on an instant-read thermometer, about 1 hour 30 minutes. Can be served immediately, but for best results allow to cool overnight, then slice and reheat slices in a pan with a little oil.",
                "Spareribs with Coffee Barbecue Sauce: Place spareribs in a large pan, cover with salted water, and bring to a boil. Cook spareribs for 1 1/2 hours, drain, and allow spareribs to cool until they can be easily handled.Bone spareribs and trim all visible fat. Discard bones and fat, and cut remaining meat into 1/2-inch cubes and reserve.Heat butter in a large saute pan, preferably with a nonstick surface. Add potatoes and onions, and cook until tender.Add meat and coffee barbecue sauce and cook until all ingredients are heated through. Stir in corn, caraway seeds, chives, and cilantro. Season and reserve.Steam asparagus until fork tender but still vibrant green. Gently stuff asparagus in place of bones in spareribs.To plate dish, place spareribs on plate and drizzle with a little barbecue sauce mixture.Heat oil in a saucepan. Add vegetable oil, onion, garlic, cilantro, chile, cumin, chile powder, red pepper flakes, lemon zest, and coffee beans and cook for 2 minutes.Add the dark brown sugar, red wine vinegar, lemon juice, and ketchup to pan. Cook mixture stirring occasionally, until liquid is reduced by half. Add the salt, pepper, and tomato paste to the mixture. Cover and simmer for 2 to 3 hours, occasionally stirring. Strain and adjust seasonings.",
                "4-Cheese Mac and Cheese with Spicy Chili Crust: In a medium saucepan over high heat, bring the cream to a boil and then reduce the heat to a simmer. Slowly whisk in the mixed cheeses until smooth. Add the pepper and truffle oil. Add the partially cooked pasta letting it finish cooking in the cheese mix, about 2 to 3 minutes. Spoon into ramekins or other serving dish and top with the bread crumbs.",
                "Mustard Greens Pesto on Pasta with Shiitake Mushrooms and Smoked Mozzarella: Blend 1/2 cup oil, pecans, and garlic in processor until finely chopped. Add vinegar, then Parmesan; process to blend. Add mustard greens alternately with remaining 1/3 cup oil in 2 additions each; puree until almost smooth. Season pesto with salt and pepper. Transfer to small bowl. DO AHEAD Can be made 6 hours ahead. Cover; chill. Let stand at room temperature 1 hour before using.",
                "Pan Roasted Chicken Thighs with Grapes and Olives: Sprinkle the chicken liberally with salt and pepper. Heat the canola oil in a large, ovenproof high-sided skillet over medium-high heat until it shimmers. Sear the chicken, skin-side down, until golden brown, 3 to 4 minutes. Then flip and brown the other side, 3 to 4 minutes. You may need to do this in two batches to avoid crowding the skillet. Transfer the browned chicken and any juices to a baking sheet or large plate.Lower the heat to medium and add the garlic, 1 cup of the grapes, the olives, capers, oregano, wine and 1/2 cup water. Stir to combine and cook until the liquid has reduced by half, 6 to 8 minutes. Stir in the butter. Add the chicken and any juices back to the skillet, skin-side-up. Sprinkle the remaining grapes around the chicken. Continue cooking over medium heat until the internal temperature reaches 160 degrees F, 6 to 8 minutes.Set the oven to broil with a rack set about 4 inches from the broiler.Place the skillet underneath the broiler to crisp the chicken skin, about 2 minutes. Watch carefully to avoid burning.To serve, divide the warm couscous among 4 plates and top each plate with 2 of the chicken thighs and a large spoonful of the sauce.",
                "Anchovies in Tomato Sauce with Pasta : Heat a pan, add 6 tablespoons of olive oil, then add your garlic and fry slowly. As it begins to color, add the pine nuts, raisins, and anchovies and continue frying for 2 minutes, until the anchovies have melted. Add the tomato purée and the wine and stir in well. Leave to simmer on a medium heat for 3 minutes. The sauce should be quite thick, like tomato sauce, but if you think it needs thinning down, add a little water. Heat a little olive oil in a separate pan, add the bread crumbs and fry until toasted, crunchy, and golden. Leave to cool on paper towels. Meanwhile, cook your pasta in boiling salted water according to the package instructions. Drain and mix with the sauce. Check the seasoning and divide onto 4 plates, twizzling the pasta with tongs as you go. Serve sprinkled with the bread crumbs.",
                "\"Fat Darrell\" Sandwich: For the Lady and Sons chicken fingers:Sprinkle chicken tenders with House Seasoning. Dredge chicken in flour; dip into buttermilk and back into flour.Preheat oil to 350 degrees F. Fry fingers in deep hot oil 5 to 7 minutes or until golden brown. Serve with honey mustard for dipping.For the french fries:Using a large pot, boil potatoes with skins on until almost done. Allow to cool, and cut potatoes into long strips, approximately 1/4 to 1/2-inch wide and thick. In a large pot or fryer, heat oil to 350 degrees F. Par-fry the potatoes for 8 to 10 minutes or until brown. Remove potatoes and place onto paper towels and allow to drain on paper towel, and while still hot, season with salt and pepper.For Paula's Mozzarella Sticks:Stir the breadcrumbs, 1/2 cup of Parmesan, thyme, basil, oregano and 1/2 teaspoon of salt in a medium bowl to blend. Dip the cheese in the eggs to coat completely and allow the excess egg to drip back into the bowl. Coat the cheese in the bread crumb mixture, patting to adhere and coat completely. Place the cheese sticks on a baking sheet. Repeat dipping the cheese sticks in the egg and bread crumb mixture to coat a second time. Cover and freeze until frozen, about 2 hours and up to 2 days.Heat the oil in a large frying pan over medium heat. Working in batches, fry the cheese until golden brown, about 1 minute per side. Transfer the fried cheese to platesFor \"Fat Darrell\" Sandwich Assembly:On the bottom half of the rolls add chicken fingers and mozzarella sticks. Load on french fries and top with marinara sauce, lettuce and tomato. Cover with the tops of rolls and serve.Mix ingredients together and place in a shaker near the stove. Use in place of salt and pepper for all your cooking needs.",
                "Sweet-Tart Duck Breasts With Fresh Cherry Sauce: 1. Take the duck out of the fridge 15 minutes before you want to use it. Preheat the oven to 400°F. Score the fat on top of the duck in a crosshatch fashion, carefully to score only the fat and not the flesh beneath it. Season the duck on all sides with salt.2. Preheat a small nonstick skillet on medium heat. Place the duck, skin-side-down, in the hot pan and leave it alone for 10 to 12 minutes, until the skin is golden brown and the fat has rendered.3. Take the pan off the heat, and turn the duck breasts over so the bottom of the breasts are coated in the rendered duck fat. Pour the excess fat into a heat-proof container, and keep for frying potatoes.4. Put the duck, skin-side-up in its original sauté pan, in the oven and cook for 10 minutes. The internal temperature will be about 135°F. Let the duck breasts rest on a cutting board for 10 minutes before slicing.5. To make the cherry sauce, heat a small nonstick skillet over medium-low heat. Add the olive oil and the shallots. Sauté for 1 minute, just to soften the shallots. Add the wine, stock, and cherries. Bring the mixture to a boil. Add the balsamic vinegar, salt to taste, and pepper. Reduce the heat to medium-low, and simmer for 20 minutes.6. Remove a 1/4 cup combination of liquid and cherries and purée in a mini food processor. Return the puréed mixture to the pan with the rest of the sauce, and stir in the honey and the cold butter.7. Slice the duck. Pour the sauce onto a serving plate, and arrange the slices of duck on top. Season with a bit of salt and pepper for garnish.",
                "Maple Dijon Salmon: Preheat oven to 400°. Toss potatoes and Brussels sprouts with olive oil and season with salt and pepper. Spread in an even layer on a baking sheet and bake for 15 to 20 minutes, until mostly tender.Meanwhile, prepare salmon: In a large bowl, whisk together mustard, maple syrup, lemon juice, garlic, and red pepper flakes. Season with salt and add salmon fillets to mixture. Toss until fully coated.Remove vegetables from oven and push to one side of baking sheet, then add salmon fillets skin side down to the empty side of the skillet. Return to oven and bake 12 minutes more, until vegetables are tender and salmon is cooked through.",
                "Sticky Grilled Chicken : Cook garlic, ginger, spices, and 1 tsp. kosher salt in oil in a small saucepan over medium heat, stirring, until fragrant, about 1 minute. Add pomegranate juice and boil until reduced to 1 cup, 12 to 19 minutes. Remove from heat, and then add jam and molasses and stir until jam has melted. Cool (it will thicken slightly). Transfer 3/4 cup sauce to a bowl and reserve for serving.Prepare grill for indirect heat cooking over medium hot charcoal (medium heat for gas).Pat chicken dry and season all over with 4 tsp. kosher salt. Oil grill rack, then grill chicken (in batches if necessary) skin side down first, directly over coals (covered only if using gas grill), turning once, until browned, 4 to 5 minutes. Move to area with no coals underneath (or over turned off burner for gas) and brush with some of sauce. Continue to grill, partially covered for charcoal (covered for gas), turning and brushing with sauce occasionally, until cooked through and well-glazed, 7 to 8 minutes for breasts, 15 to 20 minutes for dark meat.",
                "Swiss Steak: Preheat the oven to 325 degrees F.Cut the meat with the grain into 1/2-inch thick slices and season on both sides with the salt and pepper. Place the flour into a pie pan. Dredge the pieces of meat on both sides in the flour mixture. Tenderize the meat using a needling device, until each slice is 1/4-inch thick. Dredge the slices on both sides once more and set aside.Add enough of the bacon drippings or vegetable oil to just cover the bottom of a 4 to 5-quart Dutch oven set over medium-high heat. Once the oil begins to shimmer, add the steaks to the pan, being careful not to overcrowd. Cook until golden brown on both sides, approximately 2 minutes per side. Remove the steaks to a plate and repeat until all of the steaks have been browned.Remove the last steaks from the pot and add the onions, garlic, and celery. Saute for 1 to 2 minutes. Add the tomato paste and stir to combine. Next add the tomatoes, paprika, oregano, Worcestershire sauce and beef broth and stir to combine. Return the meat to the pot, submerging it in the liquid. Cover the pot and place it in the oven on the middle rack. Cook for 1 1/2 to 2 hours or until the meat is tender and falling apart.",
                "Peruvian-Style Grilled Chicken With Green Sauce: 1. For the Sauce: Combine jalapeños, ají amarillo (if using), cilantro, garlic, mayonnaise, sour cream, lime juice, and vinegar in the jar of a blender. Blend on high speed, scraping down as necessary, until smooth. With blender running, slowly drizzle in olive oil. Season to taste with salt and pepper. Sauce will be quite loose at this point, but will thicken as it sits. Transfer to a sealed container and refrigerate until ready to use.2. For the Chicken: Pat chicken dry with paper towels and place on a large cutting board, breast side down. Using sharp kitchen shears, remove backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten chicken. For added stability, run a metal or wooden skewer horizontally through chicken, entering through one thigh, going through both breast halves, and exiting through other thigh. Tuck wing tips behind back.3. Combine salt, cumin, paprika, pepper, garlic, vinegar, and oil in a small bowl and massage with fingertips until homogeneous. Spread mixture evenly over all surfaces of chicken.4. Light 1 chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil grilling grate.5. Place chicken, skin side up, on cooler side of grill, with legs facing toward hotter side. Cover grill, with vents on lid open and aligned over chicken. Open bottom vents of grill. Cook until an instant-read thermometer inserted into thickest part of breast registers 110°F (43°C). Carefully flip chicken and place, skin side down, on hotter side of grill, with breasts pointed toward cooler side. Press down firmly with a wide, stiff spatula to ensure good contact between bird and grill grates. Cover and cook until skin is crisp and an instant-read thermometer inserted into thickest part of breast registers 145 to 150°F (63 to 66°C), about 10 minutes longer. If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature, or chicken will burn.6. Transfer chicken to a cutting board and allow to rest for 5 to 10 minutes. Carve and serve with sauce.",
                "Pan-Fried Hawaiian Pizza : Preheat the broiler.Add a little oil to a medium cast-iron pan and fry the ham over medium-low heat until it's a little brown and crispy, about 3 minutes. Set aside.Roll each pizza dough half into circles the size of your cast-iron pan. The dough will probably be slightly thicker than what you're used to.Heat the pan to medium and add about 1 tablespoon of olive oil. Add 1 piece of the rolled-out dough. Cook for 2 to 3 minutes, until the dough is bubbly on top and browned underneath. Flip, add half of the sauce, half of the mozzarella, half of the ham, and half of the pineapple. Cook another 2 minutes, until the bottom is cooked, then slip under the broiler for 2 to 3 minutes, until the cheese looks bubbly and the pineapple is slightly caramelized. Top with basil. Remove the pizza from the pan, and repeat with the other piece of dough.",
                "Andy Ricker's Kaeng Khiaw Waan Luuk Chin Plaa (Green Curry With Fish Balls and Eggplant) From 'Pok Pok': 1. Make the paste: Combine the coriander, cumin, and mustard seeds in a small pan and set the pan over medium-low heat. Cook, stirring and tossing often, until the spices are very fragrant and the coriander seeds turn a shade or two darker, about 8 minutes. Let the spices cool slightly and pound them, along them with the pepper, in a granite mortar (or grind them in a spice grinder) to a fine powder. Scoop the powder into a bowl and set aside.2. Pound the cilantro roots and salt in a granite mortar to a fibrous paste, about 30 seconds. Add the lemongrass and pound to a fibrous paste, about 1 minute. Do the same with the galangal (1 minute), then the lime zest (1 minute), then the chiles (4 minutes), then the garlic (4 minutes), then the shallots (4 minutes), and finally, the shrimp paste (1 minute), fully pounding each ingredient before moving on to the next and stirring occasionally with a spoon. You’ll have a smooth, slightly fibrous paste. Finally, pound the spice powder into the paste until it’s well incorporated, about 30 seconds.3. You’ll have about 9 tablespoons of paste. You can use it right away, or store the paste in the fridge for up to 1 week or in the freezer for up to 6 months. You’ll need about 6 tablespoons of paste for 6 portions of curry.4. Cook the curry: Pour 1/2 cup of the coconut cream into a medium pot or a wok and set it over high heat. Bring the cream to a boil, stirring often, then immediately decrease the heat to maintain a steady simmer. Cook, stirring occasionally, until the cream has reduced by about half and “breaks”—it’ll look like curdled milk—anywhere from 3 to 10 minutes, depending on the brand of coconut cream. What you’re doing as you simmer is cooking off the water in the cream so you’re left with some white-ish solids but primarily the translucent fat, which you’ll use to fry the curry paste. Patience is essential here. (If for some reason it doesn’t crack after 10 minutes, add a tablespoon of vegetable oil, but know that the curry will be oilier than it should be.)5. Decrease the heat to medium-low, add 6 tablespoons of the curry paste, and stir well. Take a careful sniff. You’ll smell the raw shallots and garlic. Cook, stirring frequently, until garlic and shallots in the paste no longer smell raw and the paste has turned a shade or two darker, 6 to 8 minutes. Knowing when it’s done takes experience, but as long as you’re cooking it at a low sizzle, the curry will taste great.6. Add the palm sugar and cook, stirring often and breaking up the sugar once it softens, until the sugar has more or less fully melted, about 2 minutes. Add the remaining coconut cream, the coconut milk, and the fish balls. You’ll notice that the curry is not even close to emerald green but rather a khaki color. That’s what it’s supposed to look like. Have a taste and consider adding, gradually, more of the curry paste.7. Increase the heat to high, bring the mixture to a simmer (don’t let it boil), then decrease the heat to maintain a gentle simmer. Stem and quarter the eggplants, add them to the curry, and cook until they’re tender but still crunchy, about 3 minutes.8. Twist the lime leaves to bruise and break them slightly and add them to the curry with the Thai basil sprigs, fish sauce, and enough of the chiles to make the curry quite spicy. Stir well and turn off the heat.9. Cover the pot and let the curry sit for at least 10 minutes or up to an hour (either way, remove the basil sprigs after 10 minutes). It tastes best served slightly warmer than room temperature. The oil that rises to the surface is a good sign, not a bad one.",
                "Shrimp Un-Fried Rice : 1. Heat 1 teaspoon of the oil in a skillet over medium heat. Add the whisked eggs and cook for 1 minute stirring to make scrambled eggs, then remove to a plate.2. Heat the remaining 2 teaspoons oil, add the red bell peppers and cook 3–4 minutes, until soft. Add the edamame and garlic and cook 1 more minute.3. Add the shrimp and salt and cook 3 minutes, until they are bright pink.4. Add the cooked eggs, rice, soy sauce and sesame seeds and cook 2 minutes, just until heated through.5. Top with the scallions and serve.",
                "Bobby's Baked Tilapia: Preheat oven to 375 degrees F. Coat a large cast iron pan with a nonstick butter spray.Rinse fish and pat dry; place on the cast iron pan. Season each fillet with salt, cracked pepper, lime zest and lime juice. Add fish to the pan. Place a pat of butter on each fillet and cook in the oven for 8 to 12 minutes.",
                "Serious Heat: Trigonas with Confit Beef and Mole Sauce: 1. For the Beef Confit: In a large bowl, add cinnamon, allspice, cloves, nutmeg, pepper, garlic, oregano, mustard, paprika and salt. Mix to combine. Add the beef pieces, and toss in the spice mixture so all pieces are well-covered. In a slow cooker, add beef and lard. Warm over the high heat setting until lard melts. Turn down heat to low and cook overnight. Let the beef and fat cool. Use a spoon to transfer mixture to a heat-safe container. Reserve beef in the fridge for up to three days in advance.2. For the Mole Sauce: In a large pot, warm oil over medium heat. Add onion and sauté until translucent, about 4 minutes. Add garlic and spices to pot, and sauté until fragrant, about 1 minute. Add the diced tomatoes, coconut milk, bell pepper, chipotles, broth, peanut butter, and chocolate, letting it all melt together and become thick. Reduce heat to low, and let mixture simmer 10 minutes. Remove from heat, and transfer mole sauce to a blender. Purée until smooth.3. For the Trigona Filling: In a large shallow saucepan, cook beef and fat over medium-high heat, stirring constantly, until the beef is fall-apart tender and shreds while stirring, about 15 minutes. Set up a metal colander over a large bowl. Transfer meat to colander, letting excess fat drip into the bowl. Reserve fat if desired for another use. In a large bowl, mix the shredded beef with enough mole sauce to make the mixture moist, reserving any remaining mole sauce for a different use.4. For the Trigona: Unroll the phyllo dough on a flat surface, keeping it in a stack. With a sharp knife, cut the stack of sheets into six strips, the long way to yield six strips that measure 2 inches by 17 inches. Keep phyllo covered with plastic or a damp dish towel when not using. With a pastry brush, brush melted butter over the layer of phyllo you'll be working with. Put one teaspoon of filling at the bottom of 1 phyllo strip. Fold the lower right-hand corner up and to the left, so that the former bottom of the strip is now even with the left-hand side, making a little triangular pouch at the bottom of the strip. Fold that pouch up. Now fold that pocket back over to the right again, and continue that manner of back-and-forth folding all the way up the strip to form a triangular pouch Repeat until you’ve made desired amount of trigona. Store trigona in fridge until ready to bake or freeze indefinitely.5. Preheat oven to 350°. Place trigona pieces onto a sheet pan, and bake until golden in color, about 30 minutes, turning halfway through cooking process. Serve each trigona with a tiny dollop of sour cream.",
                "Ratatouille: Method Preheat the grill to high. Cut the aubergines into 1cm slices, then place on a baking tray and brush with 1 tablespoon of oil. Grill for 10 to 12 minutes, till golden brown. Turn the slices over, brush with another tablespoon of oil and grill for 5 to 8 minutes, until golden. Peel and finely slice the onions widthways, peel and finely slice the garlic, then deseed and slice the peppers and fennel. Cut the courgettes into 1cm rounds.In a large frying pan, heat the remaining oil over a medium heat. Add the onions and cook for 5 minutes, until they begin to soften and turn golden. Add the garlic and cook for a few minutes, then add the peppers, fennel and courgettes, and cook for 5 to 8 minutes until they begin to soften.Use a knife to score a cross into the base of each tomato. Put them in a bowl, cover with boiling water and leave for a minute. Remove with a slotted spoon and peel the skin. Cut the tomatoes in half and remove the seeds with a spoon. Roughly chop the tomatoes and add to the pan, along with the aubergine and herbes de Provence.Lower the heat, cover the pan with a tight lid and simmer gently for 20 minutes or so, until the vegetables are cooked through. Season to taste.To make the salsa verde, remove any tough herb stalks and peel the garlic, then use a pestle and mortar to grind the herbs and garlic to a paste, adding a little sea salt to help the process (or blitz in a food processor).Crush in the capers. Stir in the oil, finely grate in the lemon zest and squeeze in the juice, adding more oil or juice if necessary, to create a flavour and texture you like. Season to taste. Serve the ratatouille in bowls with a spoonful of salsa verde.",
                "Herb Crusted Salmon: Preheat the oven to 400 degrees F.Blend the tarragon with bread crumbs, salt and pepper, to taste, in a food processor, pulsing in the dill last. Remove and stir in just enough melted butter to create the consistency of wet sand.Pat the salmon dry and season on all sides with salt and pepper, to taste. Heat 1 tablespoon of butter in a large saute pan and sear the salmon, flesh side down, over medium- high heat, about 2 minutes. Do not crowd pan. Flip and top each fillet with the herb/crumb mixture. Put the pan in the oven and bake until the fish flakes with a fork. About 8 to 12 minutes. Transfer the fish to a platter and serve immediately.",
                "Strawberry Sufganiyot: Combine yeast, 1 Tbsp. flour, 1 Tbsp. sugar, and 2 Tbsp. warm water in the bowl of a stand mixer*; let stand until yeast starts to foam, about 5 minutes.Whisk in egg yolks, whole egg, milk, orange zest, orange juice, brandy, if using, salt, vanilla, 2 cups flour, and remaining 1/4 cup sugar. Mix on low speed with dough hook until combined, about 2 minutes.Add 6 Tbsp. butter 1 piece at a time, mixing well between additions. (Any small lumps of butter will get worked into dough when more flour is added.) Gradually add remaining 2 cups flour (you may not need all of it), mixing until mostly combined between additions, until dough is soft, smooth, and shiny—the dough will begin to pull away from the sides of bowl and climb up dough hook.*Don’t have a stand mixer? You can get the same results by mixing the dough with a sturdy wooden spoon and kneading on a lightly floured surface.",
                "Joanne Chang's Lemon-Ginger Mousse Coupe: 1. Make Lemon Curd:In a medium, non-reactive saucepan, combine the lemon juice and butter, place over medium-high heat, and heat to just under a boil. Meanwhile, in a medium, heatproof bowl, whisk together the eggs and egg yolks until blended, then slowly whisk in the sugar until well combined. Remove the lemon juice mixture from the heat and gradually whisk a little of it into the sugar-egg mixture. Continue whisking the hot liquid into the sugar-egg mixture, a little at a time, until all of it has been incorporated.2. Return the contents of the bowl to the saucepan and cook over medium heat, stirring continuously with a wooden spoon and making sure to scrape the bottom of the pan frequently to prevent the eggs from scrambling, for 5 to 8 minutes, or until the mixture thickens and coats the spoon thickly. To test, draw your finger along the back of the spoon; the curd should hold the trail for a second or two before it fills.3. Remove the curd from the heat and strain through the sieve into a medium, heatproof bowl. Whisk in the vanilla and salt. Place a piece of plastic wrap directly on top of the curd to prevent a skin from forming. Cover tightly and refrigerate for 1 to 2 hours, or until cold before using. The curd can be stored for up to 5 days in an airtight container in the refrigerator.4. Make Mousse: In a medium saucepan, combine the cream and fresh and ground ginger and bring to just under a boil over high heat. Remove from the heat and let the cream sit for about 1 hour to infuse with the ginger. Transfer to an airtight container and refrigerate for at least overnight or up to 4 days.5. When you are ready to serve the mousse, strain the chilled cream into the bowl of the stand mixer or into a large bowl if using a handheld mixer. Whip the cream on medium speed until it holds a stiff peak. Then, using a rubber spatula, fold the lemon curd into the whipped cream just until fully incorporated.6. Divide the mousse equally among serving bowls and top with the candied ginger. Serve immediately."
            ]
        }
    ]
}
