{
    "intents": [
        {
            "tag": "american",
            "patterns": [
                "Broiled Chicken Tenders with Pineapple Relish: Combine first 8 ingredients in a large bowl. Stir in 2 Tbsp. oil and chicken. Cover and chill at least 4 hours and up to 6 hours.Stir pineapple, cucumber, jalapeño, cilantro, and 2 Tbsp. lime juice in a small bowl to blend; season relish to taste with salt and more lime juice, if desired. Set aside.Arrange a rack 4\" from heat; preheat broiler. Line a large rimmed baking sheet with foil and brush with 1 Tbsp. oil. Remove chicken from marinade and arrange in a single layer, spacing apart, on prepared baking sheet. Drizzle with remaining 1 Tbsp. oil and season with salt. Broil until browned and cooked through, about 10 minutes. Transfer chicken to a platter and serve with reserved relish.",
                "Bread Baking: More Sourdough Bread: 1. Combine starter, water, and 4 ounces bread flour in bowl of stand mixer or in large bowl. Mix well and and cover until mixture is bubbling and rising up in container, at least one hour (or more, depending on activity of starter).2. Add remaining ingredients and knead the dough hook or by hand, adding flour or water as necessary until dough ball barely sticks to bottom of bowl when kneading. Form into ball, drizzle with olive oil, and put back into bowl. Cover bowl with plastic wrap and set aside to rise until doubled in volume, about 3 hours.3. Remove dough from bowl and form into a ball, being careful not to deflate. Set dough on a prepared baking sheet or peel and cover with plastic wrap. Set aside until doubled, about 90 minutes. Meanwhile, adjust oven rack to lower middle position and preheat the oven to 350°F. When loaf has risen, slash as desired and bake until bread is nicely browned, about 35 minutes.",
                "Richard Blais's Barely Smoked Salmon with Pumpernickel-Avocado-Egg Salsa and 'Everything Bagel' Vinaigrette: 1. Spray the rack of a stovetop smoker with cooking spray and set the salmon on it. Pour the hickory chips into the chamber of the smoker, close the lid three-quarters of the way, and heat over medium heat. After about 5 minutes, when the chips begin to smolder, open the lid and place the salmon on the rack over the chips. Close the lid and remove from the heat. Let stand for 5 to 6 minutes.2. Meanwhile, in a large bowl, combine the bagel, onion, and capers. With a small melon baller, cut balls from the avocado and add to the bowl along with the tomatoes. Finely chop the hard-boiled egg white and add it, along with the parsley and tarragon. Season with salt and pepper and gently toss with a rubber spatula. Drizzle enough vinaigrette over the pumpernickel mixture to moisten. Toss very gently.3. To serve, transfer the salmon to four plates. Divide the pumpernickel salsa among the plates. Drizzle the remaining vinaigrette over the salmon and crumble the egg yolk over the salmon. Serve immediately.4. Note: that rests on top of the chips, simply roll pieces of aluminum foil into tight sturdy rods and lay them close together in the pan; spray them with cooking spray before you heat the hickory chips. Place the salmon on the rack or foil rods and smoke as directed.",
                "Biscuits 'N Gravy Pie: Make gravy: Preheat oven to 375°. In a large skillet over medium heat, add sausage and cook, breaking up meat with a wooden spoon, until no longer pink, about 6 minutes. Add flour and cook 1 minute more. Pour in milk and whisk to combine. Season with salt, pepper, and cayenne pepper. Bring to a boil, then reduce heat and simmer until thickened, 5 minutes. Let cool.Assemble pie: On a lightly floured surface, roll out one disc of dough into a large round about ¼” thick. Place in a shallow pie dish then add gravy. Roll out second disc of dough into a large round about ¼” thick and place on top of filling. Trim and crimp edges, then use a paring knife to create slits on top. Brush with butter and bake until golden, 1 hour 15 minutes. Let cool 15 minutes before slicing and serving.",
                "Vanilla-Roasted Rhubarb and Strawberries: Combine rhubarb, strawberries, bourbon, and sugar in a medium bowl. Scrape in seeds from vanilla bean. Cut bean into 4 pieces and add to bowl; stir mixture until sugar begins to dissolve.Place four 16x12\" sheets of parchment paper, or heavy-duty foil if grilling, on a work surface. Divide mixture evenly among sheets, arranging on one side of each sheet. Fold parchment over mixture and crimp edges tightly to form a sealed packet. DO AHEAD: Foil packets can be made 4 hours ahead; parchment packets should not be made ahead. Chill. Let stand at room temperature for 15 minutes before continuing.Preheat oven to 425°. Place packets on a small rimmed baking sheet. Alternatively, build a medium fire in a charcoal grill, or heat a gas grill to medium-high. Bake or grill packets until rhubarb is tender but not mushy (carefully open 1 packet to check; steam will escape), 10–12 minutes for thinner rhubarb, 14–16 minutes for thicker. Carefully cut open packets. Transfer mixture to bowls. Top with yogurt, honey, and pistachios.",
                "Frozen Cookies n' Cream Pie: 1. In the bowl of a food processor, pulverize 15 1/2 ounces of the Oreos until they make uniform crumbs, about 30 seconds. Add the butter and salt. Process until the crumbs have the consistency of wet sand, loose but can be pressed into a shapes, about 15 seconds.2. Pour the pulverized mixture into the springform pan and use your fingertips to press it into the bottom and sides to form a crust that rises two inches from the floor of the crust. Chill for at least 20 minutes. While the crust chills, twist to separate the remaining cookies and set aside.3. Using an offset spatula, spread a 1/2 inch layer of the softened ice cream on the bottom of the crust. Cover with cookies, then a thin layer of ice cream, and repeat. Place the remaining cookies over the top. Freeze for 3 hours to solidify. 10 minutes before serving, release from the springform pan and allow the pie to sit out. Serve immediately.",
                "Butter-Basted Bison Ribeye Steak with Crispy Potatoes: 1. Season steak liberally on all sides with salt and pepper. Set on wire rack set in rimmed baking sheet and place in refrigerator uncovered overnight.2. Meanwhile, place potatoes in a medium pot, cover with water, season with salt, and bring to a boil over high heat. Reduce to a simmer and cook until tender, about 10 minutes total. Meanwhile, remove leaves from 1 sprig of rosemary and 1 sprig of thyme and finely chop. Set aside. Drain potatoes and set aside to cool. Cut each potato in half lengthwise. Potatoes can be cooked through this stage up to a day in advance and stored in a sealed container in the refrigerator.3. Heat oil in a 12-inch heavy-bottomed cast-iron skillet over high heat until just beginning to smoke. Carefully add steak and cook, flipping frequently, until a pale golden brown crust starts to develop, about 4 minutes total.4. Reduce heat to medium. Add 3 tablespoons butter, garlic, whole rosemary sprigs, and whole thyme sprigs to the skillet and continue to cook, flipping steak occasionally, and basting any light spots with foaming butter. To baste, tilt pan slightly so that butter collects by handle. Use a spoon to pick up butter and pour it over steak, aiming at light spots. Continue flipping and basting until an instant read thermometer inserted into thickest part of tenderloin side registers 115 to 120°F for medium rare, or 125°F for medium, 6 to 8 minutes total. Immediately transfer steak to a wire rack set in a rimmed baking sheet and place herb sprigs and garlic on top. Allow steak to rest uncovered while you cook the potatoes.5. Return skillet to medium-high heat and add remaining tablespoon butter. When foaming subsides, add potatoes, cut-side down. Cook, shaking pan occasionally, until potatoes are deep golden brown and crisp, about 8 minutes. Add chopped rosemary and thyme, season with salt and pepper, and toss to coat potatoes. Cook, tossing and stirring, until fragrant, about 1 minute. Transfer potatoes to a serving platter with a slotted spoon, leaving excess fat behind. Increase heat to high until leftover fat is smoking. Pour over resting steak. Discard garlic, rosemary, and thyme sprigs. Place steak on serving platter and serve immediately.",
                "Spice-Rubbed Grilled Flap Meat (Sirloin Tip): 1. Combine pepper, coriander, fennel, cumin, red pepper flakes, and oregano in a mortar and pestle and grind until coarsely crushed. Alternatively pulse in a spice grinder or food processor until coarsely crushed (not powdered). Transfer to a small bowl. Add garlic and oil and mix with a fork to combine. Rub spice paste over all surfaces of meat, massaging it to work mixture into crevices.2. Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate.3. Season steak liberally with salt. Place over hot side of grill and cook, turning frequently, until an instant read thermometer inserted into the thickest part registers 125°F and a charred crust has formed on the surface (if threatening to burn, cook over middle of grill or over cool side of grill as necessary), about 8 to 10 minutes total. Transfer to a cutting board and tent with foil. Let rest for 5 minutes.4. Cut steak into quarters cross-wise (with the grain), then rotate each quarter by 90°F and slice thinly against the grain. Serve immediately.",
                "WINNER Mint Chocolate Chip and Fresh Mint Buttercream Cupcakes: For the cupcakes: Preheat the oven to 325 degrees F. Line a cupcake or muffin pan with 12 regular-size cupcake liners.Place the light cream and mint sprigs into a small saucepan and cook gently for 5 minutes. Remove from the heat and leave to cool.Sift the flour, salt, and baking powder into a small bowl and set aside. Cream the butter and sugar in the bowl of an electric stand mixer until pale and fluffy, about 5 minutes. Scrape down the sides of the bowl and add the eggs while mixing on medium speed. Scrape down the sides of the bowl again and switch to low speed. Alternate adding the flour mixture and 1 cup of the mint-infused cream, beginning and ending with the flour. Reserve the remaining cream.Finely chop the chocolate and mix into the batter by hand.Fill the cupcake liners two-thirds full with batter and bake until lightly golden, about 26 minutes. Cool the cupcakes in their pan for 5 minutes before transferring to a cooling rack.For the buttercream: Beat the butter in the bowl of an electric stand mixer until pale. Add the mint-infused cream and continue beating. Reduce the speed to low and slowly add the confectioners' sugar until a creamy, medium-stiff consistency is achieved.To assemble: Using a large, plain pastry tip, pipe the buttercream onto the cooled mint cupcakes. Garnish with a fresh mint leaf, if desired.",
                "Crispy Cabbage With Poppy Seeds From 'The New Midwestern Table': 1. First, make the ghee: Put the butter in a small pan, bring it to a simmer, and cook until it turns brown at the edges, 3 to 4 minutes. Let the butter sit for a minute. Then tilt the pan and carefully skim off the solidified top crust with a spoon, taking care to remove as much of this stiff white froth as possible. Put it in a small dish. Pour the clear golden butter into another small dish, and pour the darker brown dregs at the bottom of the pan into the dish containing the froth. This can be done well ahead of time, even a day or two before; ghee keeps well in the refrigerator.2. Ready your seasonings, because once the cooking starts, it will go fast.3. Heat your very widest skillet over high heat. Seriously, it should be almost comically oversize for this amount of cabbage. If you have nothing larger than a regulation 10-incher, you should probably cook this in two batches to avoid steaming—instead of lightly charring—the cabbage.4. When the skillet is hot, add the ghee and the ginger. The ginger should fry immediately. Dump in the cabbage and stir.5. Add the garlic, thyme, poppy seeds, sesame seeds, salt, and pepper. Spread the cabbage out evenly and continue to fry over very high heat, stirring every 45 seconds or so, giving the cabbage time to caramelize on the bottom. Watch that it doesn’t actually burn, but let it get a little dark on the edges. Cook until the cabbage has lost its raw taste but before it goes completely limp, about 5 minutes. Add the reserved butter froth, stir to combine, turn out into a serving dish, and serve immediately.",
                "Shrimp Po' Boys: 1. For the Rémoulade: In a small bowl, stir together mayonnaise, minced pickles, horseradish, hot sauce, mustard, Worcestershire sauce, lemon juice, and garlic until thoroughly combined. Season to taste with salt and pepper. Set aside.2. For the Shrimp: In a medium bowl or shallow baking dish, whisk together flour, cornmeal, and Creole seasoning. In a second medium bowl or shallow baking dish, whisk together eggs and 1/3 cup flour mixture. The mixture should have the consistency of thick pancake batter. Adjust consistency with additional flour mixture if necessary. Set a wire rack inside a rimmed baking sheet.3. Working in batches, place shrimp in flour mixture and toss to evenly coat. Shake off excess flour, transfer shrimp to egg mixture, and turn to thoroughly coat. Allow excess batter to drip back into bowl and return shrimp to flour mixture. Press gently in flour mixture to help coating adhere. Transfer to prepared wire rack. Repeat dredging process with remaining shrimp. Refrigerate shrimp for 15 minutes.4. In a large Dutch oven, heat oil over medium-high heat to 375°F (190°C). Carefully add half the shrimp to the oil and cook, stirring occasionally with a spider skimmer, until golden brown, 4 to 5 minutes. Transfer cooked shrimp to second wire rack set inside a rimmed baking sheet. Season with salt to taste. Repeat with remaining shrimp.5. For Serving: Open rolls, and spread cut sides with rémoulade. Divide lettuce, tomatoes, pickle chips, and shrimp evenly among rolls. Serve immediately.",
                "Grilled Butterflied Chicken: 1. Pat chicken dry with paper towels and place on a large cutting board, breast side down. Using sharp kitchen shears, remove backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten chicken. For added stability, run a metal or wooden skewer through chicken horizontally, entering through one thigh, going through both breast halves, and exiting through other thigh. Tuck wing tips behind back. Season generously with salt and pepper.2. Light 1 chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil grilling grate.3. Place chicken, skin side up, on cooler side of grill, with legs facing toward hotter side. Cover grill with vents on lid open and aligned over chicken. Open bottom vents of grill if using a charcoal grill. Cook until an instant-read thermometer inserted into thickest part of breast registers 110°F (43°C). Carefully flip chicken and place on hotter side of grill, skin side down, with breasts pointed toward cooler side. If using a gas grill, reduce heat to medium-low. Press down firmly with a wide, stiff spatula to ensure good contact between bird and grill grates. Cover and cook until skin is crisp and an instant-read thermometer inserted into thickest part of breast registers 145 to 150°F (63 to 66°C), about 10 minutes longer. If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature.4. Transfer chicken to a cutting board and allow to rest for 5 to 10 minutes. Carve and serve.",
                "Kale and Brussels Sprout Salad: In a food processor fitted with a slicing blade, shred the Brussels sprouts. Next, shred the kale. Add the garlic and shallot and shred. (Alternatively, shred and mince the vegetables with a knife.) Set aside.In a large bowl, whisk together the pecorino, olive oil, pine nuts, mustard, lemon zest and juice and salt and pepper to taste. Add in the shredded vegetables and toss well to combine. Let the salad sit for 10 minutes before serving to allow the dressing to permeate the greens.",
                "Brisket Melt with Steak Sauce: On a hot griddle, add the clarified butter, and then add the onions. Cook until just tender, and add the mushrooms. Season with salt, and cook until caramalized. Set aside to cool.To assemble the sandwich, top one slice of the bread with 2 slices of mozzarella, 5 ounces sliced brisket, 2 tablespoons of the Steak Sauce, half of the caramelized onions and mushrooms and 2 more slices of mozzarella, then top with another slice of bread. Repeat for the remaining sandwich. Ladle some clarified butter on the griddle and place the sandwiches in the butter. Cook the sandwiches on both sides until the bread is toasted, the meat is warm and the cheese melts.Heat the oil in a medium saucepan set over medium-high heat. Saute the garlic, shallots and portobello for 3 minutes. Add in the Worcestershire, vinegar, ketchup, sugar, mustard, salt, chili powder and allspice. Simmer for 15 minutes. Add 2 cups water, and then cook for 10 minutes. Add in the soy sauce and molasses, and cook for 5 minutes. Blend until smooth and cool.",
                "Pumpkin Bread: Preheat the oven to 325 degrees F.Sift the flour, cinnamon, baking soda, baking powder, and salt together.In a separate bowl, mix the sugar, vegetable oil, eggs, and vanilla. Combine both mixtures and fold in the shredded pumpkin and pumpkin seeds. Once the ingredients are all incorporated pour into a non- stick 9 by 5 by 3-inch loaf pan. If your pan is not non- stick coat it with butter and flour.Bake for 1 hour and 15 minutes. At this point a knife inserted into the middle of the loaf should come out clean. Cool for 15 minutes and turn out onto a cooling rack. Cool completely. For muffins temperature should also be 325 degrees F., but bake for 30 minutes.",
                "Slow-Roasted Glazed Pork Shoulder: Crush fennel seeds and peppercorns with the bottom of a heavy skillet, or use a mortar and pestle. Transfer spices to a small bowl; add 1/4 cup salt and sugar. Rub mixture all over shoulder. Place in a large glass baking dish, cover, and refrigerate for at least 6 hours or preferably overnight.Preheat oven to 325°. Brush off spice rub from meat and place pork in a deep roasting pan; discard excess spice rub and any liquid in dish. Add 1 cup boiling water to roasting pan; cover pan tightly with foil. (Create a tight seal to lock in the steam and juices.)Transfer pan to oven and roast until meat is very tender and falling off the bone (an instant-read thermometer inserted into the center without touching the bone will read 195°), about 5 1/2 hours.Remove pan from oven; discard foil. Increase heat to 500°. Stir 1/4 cup vinegar and brown sugar into juices in pan. Return to oven and roast, watching closely to prevent burning, until pork is browned and liquid begins to reduce, about 12 minutes.Transfer pork to a rimmed baking sheet; set aside. Pour liquid in pan into a small saucepan. Bring liquid to a boil and cook, occasionally spooning off fat from surface, until a thick, syrupy glaze forms, about 10 minutes (there will be about 1 1/2 cups glaze and up to 1 cup fat; discard fat). Season glaze with salt and pepper; set aside.Using a peeler, peel carrot into thin ribbons. Core, quarter, and thinly slice apple. Mix carrot, apple, greens, oil, and remaining 1 Tbsp. vinegar in a large bowl. Season with salt and pepper. Arrange on a platter. Top with pork; pour reserved glaze over pork. Serve with tongs.",
                "The Best F&$king Grilled Chicken Sandwich Ever: 1. Place one chicken breast in a resealable plastic bag or between two pieces of plastic wrap. Using a meat pounder, rolling pin, or small skillet, pound chicken breast into an even thickness about 3/4-inches in height. Repeat with remaining 3 breasts.2. In a medium bowl whisk together the the water, salt, and sugar until the solids are dissolved. Add chicken breasts and refrigerate for 30 minutes.3. Meanwhile, combine avocado, jalapeño, cilantro, 3 tablespoons of vegetable oil, water, and lime juice in blender and purée until a smooth, creamy sauce forms. Season green sauce with salt.4. Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Remove chicken breasts from brine, pat dry with paper towels, season to taste with salt and pepper, and brush lightly with remaining 2 tablespoons oil.5. Place bacon in between hot and cool sides of grill and cook, turning occasionally, until surface of bacon is bubbling but not yet crisp and browned, about 15 minutes total.6. While bacon cooks, place chicken over hot side of grill and cook until well browned, 3 to 5 minutes. Flip and, using a pastry brush or spoon, brush a coating of green sauce all over top side of chicken. Continue to cook until second side is browned. Flip chicken and cook until green sauce is just cooked, about 1 minute. Brush more green sauce on second side of chicken, flip once more, and cook until chicken registers 150°F (or 160°F if you really want to stick to FDA guidelines) on an instant read thermometer inserted into the center of breast. If chicken browns too much before it registers 150°F, move to cool side of grill, cover, and let cook until chicken reaches temperature. Remove chicken from grill, let rest for 5 to 10 minutes.7. Place bun halves on hot side of grill, cut-sides down, and cook until lightly toasted.8. Spread 1 1/2 tablespoons of mayonnaise on cut side of each bun half. Sprinkle 2 tablespoons of crushed potato chips on the mayonnaise. On each bottom bun, add 1/4 cup lettuce, followed by 1 chicken breast, 3 bacon pieces, 1 tomato slice, and 1 tablespoon green sauce. Close sandwiches and serve right away.",
                "Chocolate Biscoff Truffles: 1. In a medium, heavy-bottomed sauce pan, heat heavy cream over medium low heat until warm. Add chocolate and cook, stirring frequently, until melted. Stir in vanilla, take off heat, and immediately stir in Biscoff spread until mixture is smooth.2. Pour mixture into a bowl and freeze until firm but pliant, about 1 1/2 hours. Pour cinnamon into a shallow bowl. Scoop one tablespoon of mixture and roll between palms of your hand until round. Roll truffle in cinnamon to coat and place on a plate. Continue with remaining mixture. Place truffles back in freezer for 10 minutes to stiffen. Serve.",
                "Clahan's Jersey Beef: On cutting board, remove all the fat and gristle from sirloin. Marinate by spreading mustard and garlic over top. Add Worcestershire sauce, black pepper and salt. Let the meat marinate at room temperature for at least one hour (but not more that 2). When ready to cook, start barbecue and let it warm up for about ten minutes. Place the beef on the grill. Cook for 8 minutes per side, (medium rare) or until the beef is done to your taste. Transfer beef to carving board, using barbecue tongs. Carve the beef by slicing across the grain into strips 1/4-inch thick. At the same time that you transfer the beef, start toasting the white sandwich bread. Slice the bread into 3 strips and place on serving platter. Arrange beef on top of sliced bread.In a saucepan on the grill, heat unsalted butter. Add Worcestershire sauce, garlic, wine, pepper, salt and, whisking constantly, cook over medium heat for about 5 minutes. Remove saucepan from grill and spoon the sauce over the beef and bread. Serve immediately. Must eat while hot, and must be eaten using your fingers.",
                "White Chocolate Coconut Dream: Crust Preparation:Preheat oven to 450 degrees F.Combine shortening, flour and salt. Cut shortening into dry ingredients until pea-sized balls form. Add cold water and toss with fork until mixture holds together. Cover and chill. Roll out dough and place in 9-inch pie plate. Place parchment paper over crust and line with pie beads. Place in oven and bake for 15 minutes. Remove paper and pie beads and continue to bake until crust is golden brown. Remove pie from oven and place paper and beads back in crust to keep crust from shrinking as it cools.Filling Preparation:Mix sugar, cornstarch and salt in bowl. Set aside. In saucepan, place egg yolks, milk and vanilla bean (sliced lengthwise), mix well. Heat over medium heat, stirring occasionally. Remove vanilla bean and extract seeds, placing seeds and pod back into mixture. When mixture is hot (not boiling), sift in dry ingredients. Continue to cook, stirring constantly until mixture thickens and bubbles. Lower heat slightly and continue to cook and stir for 3 minutes. Remove from heat and remove vanilla bean pods. Add butter and chocolate. Stir until melted. Add 1 1/2 cups coconut. Cover with plastic wrap and chill.White Chocolate Mousse Preparation:Place 3/4 cup whipping cream in saucepan. Heat until steaming (approximately 165 degrees F). Pour over white chocolate. Whisk until all chocolate is melted. Cool to approximately 130 degrees F. Place whipping cream mixture in mixing bowl. Beat on medium-high speed until cream starts to thicken. Increase speed to high and continue to beat until stiff peaks form. Add a large spoonful of whipping cream to chocolate. Fold chocolate mixture into whipped cream.Assembly:Place chilled filling into baked pie shell and top with mousse. Decorate with toasted coconut. Serve.",
                "Made-Over Blackened Cajun Skillet Fries: Preheat the oven to 425 degrees F. Cut the potatoes into long wedges about 1-inch thick. Toss the potatoes with the olive oil and Cajun seasoning. Heat an ovenproof large nonstick skillet over medium-high heat and add the potatoes in a single layer. Cook, turning, until browned on all sides, about 15 minutes. Slowly add 1/4 cup water to the skillet and transfer the entire skillet to the oven.Continue to cook the potatoes, turning once, until the potatoes are tender and the outsides are crisped, about 20 more minutes. Meanwhile, mix the yogurt with the mustard and a pinch salt. Serve the potatoes warm with the mustard dipping sauce.",
                "The Ultimate Sticky Buns : Preheat oven to 350°F. Spread out nuts on a rimmed baking sheet. Toast until fragrant and slightly darkened, 10-12 minutes. Let cool completely. Set 1 1/4 cups nuts aside for buns.Melt butter in a small heavy saucepan over medium heat. Stir in brown sugar, cream, honey, salt, and orange zest, if using. Bring to a boil, reduce heat to medium, and simmer until glaze is golden brown and glossy, 3-4 minutes. Pour 1 cup of glaze into baking pan, tilting to coat bottom and sides. Set aside remaining glaze. Sprinkle 1/2 cup toasted pecans over bottom of baking pan and let cool.Using an electric mixer on medium speed, beat butter, sugar, cinnamon, nutmeg, and kosher salt in a medium bowl until light and fluffy, 2-3 minutes. Set filling aside.Punch down dough; transfer to a floured work surface. Lightly dust top with flour. Follow instructions in Cooks' Notes, for assembling buns with filling and 3/4 cup pecans. DO AHEAD: Can be made 1 day ahead. Cover and chill buns and remaining glaze separately. Store remaining pecans airtight at room temperature.Loosely cover pan with plastic wrap or a kitchen towel. Let buns rise in a warm, draft-free area until doubled in size, 45 minutes to 1 hour, or 1 1/2-2 hours if dough has been chilled overnight.Arrange a rack in middle of oven; preheat to 350°F. Whisk egg with 1/2 teaspoon water in a small bowl. Brush tops of buns with egg wash. Bake, rotating pan halfway through and tenting with foil if browning too quickly, until buns are golden brown, filling is bubbling, and an instant-read thermometer inserted into center of buns registers 185°F, about 50 minutes. Let cool for 5 minutes. Spoon remaining glaze over. Sprinkle 1/2 cup pecans over. Let cool in pan on a wire rack.Lightly sprinkle sea salt over. Serve buns warm or at room temperature.",
                "Rhode Island Clam Chowder With White Wine and Bacon: 1. Scrub clams well under running water and set in a large bowl. Cover with cold water and add enough salt to make water taste salty like the sea. Let clams stand for about 30 minutes, then lift from water and rinse. Inspect soaking water: if there is sand on the bottom of the bowl, discard water, rinse bowl well, and repeat soaking procedure until sand no longer accumulates on bottom of bowl.2. Meanwhile, place stock in a large liquid measuring cup and sprinkle gelatin over the top. (See note).3. Add bacon to Dutch oven and cook over medium-high heat, stirring occasionally, until bacon is crisp and fat has rendered, about 7 minutes. Add onion, carrot, celery, and garlic and cook, stirring, until softened but not browned, about 5 minutes.4. Add wine, bring to a simmer, and cook until alcohol smell has cooked off, about 4 minutes. Add stock, thyme sprigs, and bay leaf and bring to a simmer.5. Add clams. Cover and cook until clams begin to open, about 5 minutes. Using tongs, transfer clams to a large heatproof bowl as they open. If any clams don't open, transfer them to a separate bowl, and attempt to open them by sliding a knife between the shells: any clams that smell good can be added to the others (discard any that smell bad or are filled with mud). Allow clams to cool slightly.6. Add potatoes to soup and simmer until tender, about 10 minutes. Meanwhile, remove clam meat from shells. Discard shells and roughly chop clam meat, collecting all juices that accumulate. Skim most of the fat from the surface of the soup.7. Add clam meat back to soup along with any juices and season with salt. Transfer to bowls, garnish with parsley and serve.",
                "Watermelon Limeade: 1. In two batches, pulse the watermelon cubes in a blender just until it looks like a chunky sauce, about 10 to 12 short pulses. Transfer pulp to a colander lined with cheesecloth set over a large pot, stirring occasionally until most of the liquid has dripped through. Transfer 3 1/2 cups of liquid to a large pitcher and reserve remainder for another use.2. Add lime juice and agave nectar to pitcher and stir to combine. Refrigerate until completely cool. Serve in ice-filled glasses, garnished with lime zest or rings if desired.",
                "Homemade Mallomar Bars: 1. In large bowl, stir graham crumbs and butter until crumbs are evenly moistened. Press firmly into bottom of 9- by 13-inch pan; set aside. Place 1/4 cup water in small bowl and sprinkle gelatin over top. Let sit at least 5 minutes to soften.2. Place 1/4 cup corn syrup in standing mixer bowl. Stir remaining 1/4 cup corn syrup, remaining 1/4 cup water, and sugar in medium saucepan over medium-high heat until dissolved. Continue to cook, without stirring, until mixture registers 240&degF on an instant read thermometer.3. Immediately pour hot syrup into mixer bowl and add softened gelatin and vanilla. Turn mixer to medium speed and beat until combined, about 1 minute. Increase speed to medium high and beat until light and fluffy, about 8 minutes.4. Pour marshmallow over graham cracker base and smooth top with offset spatula. Chill until set, about 30 minutes.5. Place chocolate in medium bowl. In small saucepan, heat cream until simmering and pour over chocolate and whisk until melted and smooth. Pour over marshmallow and chill until chocolate is set, about 15 minutes. Cut 4 rows vertically and 6 horizontally, to create 24 squares.",
                "Iced Lemon Cookies: Preheat oven to 350 degrees F.In a food processor work bowl, add sugar and lemon zest. Process until sugar and zest are well mixed, about 20 seconds. Scrape into a large mixing bowl. Reserve about 1/2 cup of lemon sugar in a separate bowl for later use.Add flour, baking powder and salt into food processor and pulse briefly to mix. Add cold butter into food processor with flour mixture and process with short pulses until mixture resembles cornmeal and no large lumps of butter remain, about 10 pulses. Pour this mixture into the sugar and lemon mixture in the large mixing bowl and set aside.In a medium bowl, mix egg yolks, vanilla extract and lemon juice together.Using an electric mixer with a paddle attachment, pour in the lemon/sugar and flour/butter mixture and stir until combined, about 15 seconds. Then, while the mixer is still running, slowly add egg/lemon juice mixture and mix until well combined and dough pulls away from the sides of the bowl, about 15 to 30 seconds.Scrape the dough into a large bowl and refrigerate until cold, but not solid, about 30 minutes. Use an ice cream scoop to scoop the dough onto parchment-lined cookie sheets. Take the dough balls and roll the tops into the reserved lemon sugar. Use the bottom of a water glass to press the cookies flat, about 1/4-inch thick. Bake the cookies until slightly browned, about 15 minutes. Remove the parchment paper with the cookies from the tray to a cooling rack and cool completely, about 1 hour. Once the cookies have completely cooled, ice with Lemon Icing.1 pound (2 cups) confectioners' sugar6 tablespoons lemon juiceIn a medium bowl, whisk sugar and lemon juice together until smooth. Spoon onto cooled cookies, and spread evenly with the back of a spoon. Let stand on a cooling rack until the glaze is set, about 1 hour.Yield: enough for 3 dozen cookies",
                "\"Drunken Shrimp Style\" Quick Marinade: Soak skewers in water for 45 minutes. In a mixing bowl, combine vodka, citrus, ginger, garlic, sugar, and miso paste and whisk until mixed. Slowly whisk in oil until smooth. Pour marinade over unpeeled shrimp and scallops. Cover and let marinate in refrigerator for 45 to 60 minutes. Skewer shrimp and scallops (4 to a skewer is optimal) and place on grill over direct heat. Allow tails and legs of shrimp to slightly blacken before turning. Scallops should brown slightly before turning.",
                "Chocolate Decadence Cake: 1. Adjust oven rack to middle position and preheat to 325°F. Grease three 9-inch cake pans generously with butter and dust with flour. Set aside.2. In medium bowl, stir together flour, cocoa, espresso powder, baking soda, baking powder, and salt. Set aside. Use an electric mixer or stand mixer fitted with a paddle attachment to cream together white sugar, brown sugar, and butter, beating until light and airy (about 3 minutes). Add eggs one at a time, incorporating entirely before adding the next. Beat in sour cream and vanilla.3. Add one third of the dry ingredients to the wet, then half of the sour milk or buttermilk, beating well. Add the second third of the dry ingredients, followed by the rest of the sour milk, again beating well. Add the rest of the dry ingredients and mix just until there are no more white whisps of flour. Divide the batter evenly between the three cake pans and bake until a toothpick inserted in the middle of the cake comes out clean, about 30 minute.4. Allow cakes to sit in the pans for 10 minutes before turning them out onto a cooling rack to cool completely.5. To construct the cake: Level each cake with a cake leveler so they are perfectly flat. Set your first layer of cake on a cake board and apply half of the chocolate buttercream to the top, smoothing it around the surface with an offset spatula. Stack the second layer of cake on top and apply the rest of the chocolate buttercream to the top, again smoothing it perfectly with an offset spatula. Top with the third layer of cake and apply a small amount of pressure to the cake to gently compress the layer. Don't press too hard.6. Apply half of the vanilla buttercream to the sides of the cake only, creating a crumb coat. Set the cake in the refrigerator for 15 minutes. After the icing has chilled, apply the remaining vanilla buttercream to just the sides of the cake. Use an offset spatula heated under warm water and then wiped dry to smooth the vanilla buttercream to a fine finish.7. Set the cake onto a cooling rack that has been placed over a rimmed baking sheet. Carefully pour the warm ganache into the center of the cake, allowing it to run out and cover the top of the cake. Stop pouring once the ganache reaches the edges of the top, and allow some—but not a lot—of the ganache to dribble down the sides. Set the cake in the refrigerator to firm up for 1 hour. This cake will stay fresh for up to three days if well sealed and kept in the refrigerator.",
                "Porter Honey-Mustard Dipping Sauce: 1. Whisk all ingredients together in a medium bowl. Serve with fried chicken.",
                "Crock-Pot Cube Steak: Season steaks with salt and pepper. Add to slow cooker along with garlic powder, onion, onion soup mix, and beef broth.Set slow cooker to low for 8 hours.1 hour before you’re ready to serve, mix cold water and cornstarch in a small bowl and stir into slow cooker. Cook on high until gravy has thickened, stirring periodically.Serve over buttered egg noodles, and garnish with more pepper.",
                "Homemade Butterfingers: 1. Prepare the candy: Line a jelly roll pan (a 1/2 sheet pan) with a silicon mat and preheat oven to 200° F. In a medium pot, combine water, molasses, corn syrup, sugar and vanilla bean seeds. Set over medium heat and stir gently with a fork, taking care not to splash, until sugar dissolves and the mixture begins to simmer. Simmer, undisturbed, until the mixture reaches between 280 and 290°F on a candy thermometer. Due to the molasses, the mixture will have a sketchy burning smell, but remain within the recommended temperatures and rest assured that it’s not actually burning. Cooking molasses just smells funky. While the syrup is cooking, grind the peanuts and powdered sugar together in a food processor until the mixture forms a thick, damp mass with a texture like wet sand. Set aside. When the syrup comes to temperature, immediately pour the mixture onto the silicon mat in the sheet pan, taking care to keep the syrup within the center of the mat. Wearing a pair of oven mitts, tilt the pan left and right to help the syrup evenly coat the silicon mat into a roughly 14” by 10” rectangular shape. You can fold the candy back over on itself if any places flow out too far.2. Layer the candy: If you’ve ever laminated dough, this will be a familiar process; if not, imagine this next step as folding a business letter in thirds. Sprinkle the ground peanut mixture in an even a layer over 2/3 of the candy. Use the silicon mat to fold the unsprinkled section up and over the center of the candy, just like the first fold of a business letter. If the candy sticks to the silicon, it’s still too hot. Wait a few moments for it to cool, then peel the silicon away; no rush. Now fold this double-thick section up and over the remaining piece. You will now have a 3 layer candy packet roughly 11” x 5”. Place the sheet pan in the preheated oven for 5 minutes, or until the candy has become warm and pliable. Remove it from the oven and lift out the silicon mat, setting it on the counter. Use a rolling pin to gently roll it out to a 14” x 10” rectangle; it will take some elbow grease. If at any time the candy begins to make a cracking sound, or feels too stiff to roll, return the pan to the oven for a minute or two. Take your time! Once you’ve rolled it out, fold it into thirds again just as you did the first time. Return the candy to the oven for another 4 minutes, then roll back out to a 14” x 10” rectangle. Sprinkle this rectangle with corn flakes, as you did with the peanut mixture. Fold into thirds (if, while folding the candy makes a cracking noise, stop folding and return it to the oven for about a minute, then proceed with folding). Return folded packet to the oven for another 4 minutes.3. Cut the candy into bars: Now roll the candy to 1/2” thickness and then transfer to a cutting board. Use a sharp knife to trim the edges, leaving a tidy rectangle behind. You may be able to immediately cut the candy into 10 long, thin bars. But you may find you need to return it to the oven for a minute or two. This generally depends on the temperature of the kitchen.4. Crumb coat the bars: Due to the extreme flakiness of the candy, it’s important to “crumb coat” the candy bars before dipping in chocolate. Do this by tempering 12 ounces of chocolate. Drizzle or pipe a thin line of chocolate onto the bottom of each candy piece and then flip each over to form a foot on the bottom. Next, drizzle a little chocolate over each bar and use a small pastry brush to evenly coat the bar in a thin layer of chocolate.5. Dipping the bars: Once the chocolate has set, temper the remaining chocolate and dip each bar. Store the finished bars in an airtight container, indefinitely.",
                "Smoked Bacon Rub From 'Pitt Cue and Co.: The Cookbook': 1. Heat the oven to 350°F. Get two heavy metal baking pans and two sheets of waxed paper ready.2. Sandwich the bacon between the waxed paper sheets and the two pans and bake in the oven for 30 minutes, or until brown and crispy. Remove from the oven and lay the bacon on paper towels to cool and dry out.3. Use a mortar and pestle to grind the dry bacon to a fine powder with the remaining ingredients. Spread out on a clean baking pan to dry further. When completely dry, grind once more and put into airtight jars. Once a jar has been opened, use within 1 week.",
                "Birthday Cake Granola: Preheat oven to 325 degrees F. Grease a large baking sheet with cooking spray.In a medium bowl, stir together oats, melted butter, brown sugar, salt, egg white and vanilla. Fold in sprinkles, then transfer mixture to the baking sheet. For granola chunks, try to keep granola mixture close together on the pan.Bake for 40 minutes, until the oats are golden. Let cool for around 20 minutes. They will become crunchy as they cool.After cooling, break the up the oats and stir in the white chocolate chips. Drizzle with melted chocolate and let sit for 10 minutes more, until the white chocolate hardens. Transfer to a mason jars (or plastic bags) to enjoy throughout the week.",
                "Basic Vanilla Milkshake: In a blender, combine the milk and ice cream and blend until smooth. Serve immediately.",
                "QB Poppers: Cook the bacon in a skillet over medium heat until 75 percent done. Combine the cheeses in a small bowl. Stuff each pepper with some cheese, wrap the peppers with the bacon strips, and secure with toothpicks.Preheat a grill to 375 degrees F. Preheat the oven to 450 degrees F.Grill on a hot grill until grill marks appear, about 5 seconds. Remove them immediately to a small sheet pan and bake them in the oven until cooked through. Remove the peppers from the oven to a serving plate and serve.",
                "The Best Vegetarian Bean Chili: 1. Add dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to small bowl and set aside. Alternatively, place dried chilies on a microwave-safe plate and microwave on high power in 15-second increments until pliable and toasted-smelling, about 30 seconds total. Transfer to a 2-quart microwave-safe liquid measuring cup or bowl. Add water and chipotle chilies, cover with plastic wrap, and microwave on high power until gently simmering, about 5 minutes. Remove from microwave and set aside. Transfer chilies and liquid to blender and blend, starting on the lowest possible setting and gradually increasing speed to high (make sure to hold the lid down with a clean kitchen towel or a potholder to prevent it from blowing out). Blend until smooth, about 1 minute.2. Drain chickpeas, reserving liquid from can. Transfer chickpeas to a food processor and pulse until just roughly chopped, about three 1-second pulses. Set aside.3. Roughly squeeze tomatoes trough your fingers into approximate 1/4-inch pieces. Add to chickpea water along with any juices.4. Heat oil in a large saucepan or Dutch oven over medium-high heat until shimmering. Add onions and cook, stirring frequently, until softened but not browned, about 4 minutes. Add garlic, cumin, and dried oregano and cook, stirring constantly, until fragrant, about 30 seconds. Add pureed chilies, soy sauce, and marmite and cook, stirring constantly, until fragrant, about 30 seconds. Add reserved chickpea/tomato water mixture and stir to combine. Add chopped chickpeas and kidney beans. Stir to combine.5. If beans are sticking out of the top, add reserved kidney bean liquid until just barely submerged. Bring to a boil over high heat, reduce to a bare simmer, and cook, stirring occasionally, until thick and rich, about 1 1/2 hours, adding more reserved kidney bean liquid as necessary if chili becomes too thick or sticks to the bottom of the pan.6. When cooked, add vodka or bourbon and stir to combine. Season to taste with salt and whisk in masa in a slow steady stream until desired thickness is reached. For best results, allow chili to cool and refrigerate for at least one night and up to a week. Reheat to serve.7. Serve, garnished with cilantro, chopped onions, scallions, avocado, lime wedges, and warm tortillas as desired.",
                "Buttery Sugar Cookies : Beat together butter, sugar, and salt in a large bowl with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes in a stand mixer (preferably fitted with paddle attachment) or 6 with a handheld. Beat in egg and vanilla. Reduce speed to low, then mix in flour.Halve dough and form each half into a disk, then wrap in wax paper. Put each disk in a resealable plastic bag and chill until firm enough to roll into balls, about 1 hour.Heat oven to 350°F with rack in middle. Line baking sheets with parchment paper.While oven heats, work with 1 piece of dough (keep remaining dough chilled). Roll 1 level tablespoon of dough into a ball, then roll in coarse sugar in a shallow bowl to coat completely. (If dough becomes too soft to roll easily into balls, quick-chill in the freezer or chill in the refrigerator.)Place balls 2 inches apart on a lined baking sheet. With the flat bottom of a glass, flatten balls into 2-inch rounds.Bake cookies, one sheet at time, until bottoms are golden, 12 to 15 minutes total. Cool on sheets 2 minutes, then transfer with a metal spatula to racks to cool completely. Make more cookies with remaining dough on cooled baking sheets.",
                "Valerie's Pumpkin Pie: For mom's flaky pie dough: Combine the flour, granulated sugar and salt in a food processor and pulse until combined. Gradually add the butter chunks and pulse until the largest chunks are pea-size. Add the ice water 1 tablespoon at a time and pulse just until the dough begins to clump together against the walls of the processor. Dump the dough out onto a work surface and press together to make a cohesive ball, kneading once or twice if it is falling apart. Divide the dough in half, wrap each in plastic wrap and refrigerate 1 portion of the dough for 1 hour before using. (You'll be using only 1 portion of dough for the pie, so wrap the extra piece in a second layer of plastic wrap, put in a resealable plastic bag and freeze for another time.)On a well-floured surface with a well-floured rolling pin, roll the dough into a 9- to 10-inch round and transfer to an 8-inch pie plate. (If the rolling pin and work surface quickly become sticky, refrigerate the dough until firm, or, using a large spatula or bench scraper, transfer the dough to an 8-inch pie plate and press it into shape.) Crimp the edges and prick the bottom all over with a fork. Refrigerate the pie shell for 20 minutes.Meanwhile, preheat the oven to 325 degrees F.Place a sheet of parchment paper or foil in the pie shell and fill with pie weights, raw rice or dried beans. Bake until the edges are lightly golden, about 15 minutes. Remove the weights and paper and bake until golden and cooked on the bottom and sides, about 15 minutes more. Reduce the oven temperature to 300 degrees F.For the pumpkin pie filling: Combine the pumpkin, cream, brown sugar, cinnamon, nutmeg, ginger, cloves and salt in a large bowl and whisk until thoroughly blended. Stir in the bourbon, vanilla and eggs. Whisk again until thoroughly blended.Pour the pumpkin mixture into the pie shell and smooth the top with an offset spatula. Bake until the center wobbles slightly when shaken, 1 hour to 1 hour 10 minutes. Cool completely on a rack for about 2 hours. Serve with Cinnamon-Buttermilk Whipped Cream.Add the heavy cream and buttermilk to a large bowl and beat with an electric mixer until foamy. Gradually add the sugar and cinnamon while beating, then continue to beat until soft peaks form.",
                "Lazy Daisy Coconut Oatmeal Cake: 1. Combine oats, boiling water, and milk; let sit 20 minutes. Adjust oven rack to upper and lower middle position and preheat to 350°F. Grease 9- by 9-inch pan.2. Add salt, butter, sugar, and vanilla to oat mixture and stir to combine. Stir in eggs and coconut. Add flour, baking soda, and cinnamon to bowl, then stir until completely combined. Pour into prepared pan and bake on middle rack until just set, about 30 minutes.3. While cake is baking, mix topping in same unwashed bowl: toss butter, brown sugar, milk, coconut, and nuts to form moist crumbs.4. As soon as cake is baked, remove from oven and spread topping over the top. Return pan to oven and increase heat to broil. Briefly heat until topping melts and coconut is lightly toasted, about 1 minute. Transfer pan to wire rack to cool."
            ]
        }, {
            "tag": "latin",
            "patterns": [
                "Chimichurri Sauce: Combine shallot, chile, garlic, vinegar, and 1 tsp. salt in a medium bowl. Let sit 10 minutes. Stir in cilantro, parsley, and oregano. Using a fork, whisk in oil. Transfer ½ cup chimichurri to a small bowl; season with salt and reserve as sauce. Place meat in a glass, stainless-steel, or ceramic dish. Toss with remaining chimichurri. Cover and chill at least 3 hours or up to overnight.Remove meat from marinade, pat dry, and grill.Spoon reserved chimichurri over grilled meat.",
                "Salsa Golf (Argentinean Ketchup): 1. Whisk together mayonnaise, ketchup, and lemon juice (if using) in a small bowl. Use immediately or transfer to an airtight container and store in refrigerator for up to a month.",
                "Peruvian-Style Grilled Chicken With Green Sauce: 1. For the Sauce: Combine jalapeños, ají amarillo (if using), cilantro, garlic, mayonnaise, sour cream, lime juice, and vinegar in the jar of a blender. Blend on high speed, scraping down as necessary, until smooth. With blender running, slowly drizzle in olive oil. Season to taste with salt and pepper. Sauce will be quite loose at this point, but will thicken as it sits. Transfer to a sealed container and refrigerate until ready to use.2. For the Chicken: Pat chicken dry with paper towels and place on a large cutting board, breast side down. Using sharp kitchen shears, remove backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten chicken. For added stability, run a metal or wooden skewer horizontally through chicken, entering through one thigh, going through both breast halves, and exiting through other thigh. Tuck wing tips behind back.3. Combine salt, cumin, paprika, pepper, garlic, vinegar, and oil in a small bowl and massage with fingertips until homogeneous. Spread mixture evenly over all surfaces of chicken.4. Light 1 chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil grilling grate.5. Place chicken, skin side up, on cooler side of grill, with legs facing toward hotter side. Cover grill, with vents on lid open and aligned over chicken. Open bottom vents of grill. Cook until an instant-read thermometer inserted into thickest part of breast registers 110°F (43°C). Carefully flip chicken and place, skin side down, on hotter side of grill, with breasts pointed toward cooler side. Press down firmly with a wide, stiff spatula to ensure good contact between bird and grill grates. Cover and cook until skin is crisp and an instant-read thermometer inserted into thickest part of breast registers 145 to 150°F (63 to 66°C), about 10 minutes longer. If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature, or chicken will burn.6. Transfer chicken to a cutting board and allow to rest for 5 to 10 minutes. Carve and serve with sauce.",
                "Venezuelan-style Arepas (Arepas Rellenas): 1. Adjust oven rack to middle position and preheat oven to 325°F. Combine masarepa, cheese (if using), 1 cup water, and 1 teaspoon vegetable oil in a medium bowl and knead with hands until a dough is formed. Take a small amount and flatten it between your palms If the edges crack, knead in more water a tablespoon at a time until dough is supple and smooth but not sticky. Season dough to taste with salt, then cover and set aside for five minutes.2. Divide dough into four even pieces and roll into balls. Working on a wooden cutting board or a regular cutting board with a sheet of plastic wrap or parchment paper on top of it, flatten each ball down to a disk about 4-inches in diameter and 1/2-inch thick.3. Melt butter in a 12-inch cast iron or non-stick skillet over medium-low heat (see note #3 above). Add arepas and cook, moving them around the pan and rotating them occasionally, until first side is charred in spots and a dry crust has formed, about five minutes. Flip arepas and cook on second side until a dry crust has formed, about five minutes longer. Transfer to a baking sheet and bake until cooked through, about 10 minutes longer. Remove from oven, let rest 5 minutes, split, fill, and serve.",
                "No-Waste Tacos de Carnitas With Salsa Verde: 1. Adjust oven rack to middle position and preheat oven to 275 degrees. Cut one onion into fine dice and combine with cilantro. Refrigerate until needed. Split remaining onion into quarters. Set aside. Season pork chunks with 1 tablespoon salt and place in a 9 by 13 glass casserole dish. The pork should fill the dish with no spaces. Split orange into quarters and squeeze juice over pork. Nestle squeezed orange pieces into casserole. Add 2 onion quarters, 4 cloves garlic, bay leaves, and cinnamon stick to casserole. Nestle everything into an even layer. Pour vegetable oil over surface. Cover dish tightly with aluminum foil and place in oven. Cook until pork is fork tender, about 3 1/2 hours.2. Set large fine-meshed strainer 1 quart liquid measure or bowl. Using tongs, remove orange peel, onion, garlic, cinnamon stick, and bay leaves from pork. Transfer pork and liquid to strainer. Let drain for 10 minutes. Transfer pork back to casserole. You should end up with about 1/2 cup liquid and 1/2 cup fat. Using a flat spoon or de-fatter, skim fat from surface and add back to pork. Shred pork into large chunks with fingers or two forks. Season to taste with salt. Refrigerate until ready to serve. Transfer remaining liquid to medium saucepot.3. Add tomatillos, remaining 2 onion quarters, remaining 2 garlic cloves, and jalapeños to saucepot with strained pork liquid. Add water until it is about 1-inch below the top of the vegetables. Bring to a boil over high heat, reduce to a simmer, and cook until all vegetables are completely tender, about 10 minutes. Blend salsa with hand blender or in a stand-up blender until smooth. Season to taste with salt. Allow to cool and refrigerate until ready to use.4. To serve: Place casserole dish with pork 4-inches under a high broiler and broil until brown and crisp on surface, about 6 minutes. Remove pork, stir with a spoon to expose new bits to heat, and broil again for 6 more minutes until crisp. Tent with foil to keep warm.5. Meanwhile, heat tortillas. Preheat an 8-inch non-stick skillet over medium-high heat until hot. Working one tortilla at a time, dip tortilla in bowl filled with water. Transfer to hot skillet and cook until water evaporates from first side and tortilla is browned in spots, about 30 seconds. Flip and cook until dry, about 15 seconds longer. Transfer tortilla to a tortilla warmer, or wrap in a clean dish towel. Repeat with remaining tortillas.6. To eat, stack two tortillas on top of each other. Add two to three tablespoons carnitas mixture to center. Top with salsa verde, chopped onions and cilantro, and queso fresco. Serve with lime wedges.",
                "Grilled Salsa Roja: Prepare a grill for high heat. Grill tomatoes, onion, and chiles, turning occasionally, until lightly charred and fragrant, about 4 minutes for chiles and 6–8 minutes for tomatoes and onion. Transfer to a plate and let cool.Purée tomatoes, onion, chiles, garlic, and cilantro in a blender until mostly smooth and only small pieces remain; season with salt.Do Ahead: Salsa can be made 2 days ahead. Cover and chill.",
                "Cheesy Chicken Enchilada Skillet : Preheat oven to 500°F. Heat oil in a 10\" heatproof skillet over medium. Add onion, garlic, cumin, and salt and cook, stirring, until softened, about 5 minutes.Transfer onion mixture to a large bowl; reserve hot skillet. Add salsa, 1/2 cup sour cream, and 1/4 cup water to onion mixture and stir to combine. Fold in tortillas, chicken, and beans until thoroughly coated. Return mixture to reserved skillet and cook over medium heat until warmed through, about 3 minutes. Sprinkle cheese over.Transfer skillet to oven and bake until cheese is melted and bubbling, about 5 minutes. Top with sour cream, jalapeños, and cilantro, if desired.",
                "Fajitas with Marinated Flank Steak and Rajas: Marinate the flank steak in the pickled jalapenos, at room temperature, for 1 hour.Preheat a grill or grill pan to medium-high.Season the steak with salt and pepper, to taste, and grill until nicely charred, about 3 to 4 minutes on each side. Remove from the grill and allow the steak to rest on a cutting board while preparing the rajas.Secure each piece sliced onion horizontally with wooden skewers. Brush both sides with olive oil and season with salt and pepper, to taste. Grill the onions, turning occasionally, until soft and charred, about 10 to 15 minutes. Put the poblano and jalapeno chiles on the grill and char them on all sides. Once the chiles are blackened on all sides, set aside to cool. When cool enough to handle, remove the charred skin, stem and seeds. Cut the chiles into strips. Once the onions are cool enough to handle, remove the skewers and separate the onions into rings.Preheat a large cast iron pan or a large heavy-bottomed skillet over medium heat. Slice the flank steak, on the bias, into thin strips. When the pan is hot, coat the bottom of the pan with some olive oil. Add the sliced garlic and dried oregano, and saute until fragrant, about 1 minute. Add the sliced steak, onions and chile strips to the pan to heat through. Transfer to a serving platter and serve piping hot with flour tortillas, guacamole and pico de gallo.",
                "Chilean Sea Bass with Peanuts and Herbs : Preheat oven to 350°F. Whisk lime juice, fish sauce, sugar, and 2 tablespoons water in a small bowl until sugar is dissolved. Set lime juice mixture aside.Heat 2 tablespoons oil in a large ovenproof skillet over medium-high heat. Season fish with salt and cook, skin side down, until skin is golden brown and crisp, 5–8 minutes. Transfer skillet to oven and roast until fish is just opaque in the center, 5–10 minutes longer, depending on thickness. Transfer fish to a plate.While fish is roasting, heat remaining 2 tablespoons oil in another large skillet over medium-high heat. Add shallots, ginger, scallions, and chiles and cook, stirring often, until beginning to brown, about 3 minutes. Add garlic and cook, stirring, until golden brown, about 30 seconds. Add reserved lime juice mixture to skillet and cook, stirring, until slightly reduced, about 1 minute. Remove from heat and mix in herbs and peanuts. Serve fish topped with sauce and dill.",
                "Nicaraguan Arroz con Pollo: 1. For the chicken: Place chicken, onion, bell pepper, garlic, salt, peppercorns, and water (chicken should be submerged 2 inches; add more water if necessary). Squeeze lime juice into pot and add spent lime halves to pot.2. Bring to boil over medium heat, then immediately reduce heat to medium-low and simmer until chicken is cooked through (chicken’s temperature should read 160°FF), about 20 minutes.3. With tongs, transfer chicken to large bowl. When cool enough to handle, shred chicken into bite-sized pieces, removing and discarding bones. You should have 4 cups shredded chicken.4. Strain broth and discard solids. Reserve 4 cups and store the rest for different use.5. For the rice: Melt 2 tablespoons butter in large heavy-bottomed saucepan over medium heat. Add oil, onion, garlic, and salt and cook, stirring, until softened, about 5 minutes. Stir in tomato paste and cook until darkened, about 1 minute.6. Stir in rice and carrots and cook, stirring, until rice is completely coated with onion mixture, about 1 minute. Add broth and bring to a boil over medium-high heat.7. Continue to boil until most of the liquid has evaporated and you can see small bubbles on the surface of the rice. Reduce heat to the lowest setting, cover, and cook for 20 minutes until rice is done. Remove from heat and fluff rice with chopsticks or fork.8. For the arroz con pollo: Melt 2 tablespoons butter in a large skillet with high sides. Add sausage and ham and cook over medium heat until lightly browned, about 3 minutes. Transfer to plate.9. Melt remaining 1 tablespoon butter in now empty skillet. Add onion and piquillo peppers and cook until softened, about 5 minutes. Stir in tomato paste and cook until darkened, about 1 minute. Add ketchup and chicken and cook, stirring, until chicken is completely coated in mixture.10. Stir in rice, then reserved sausage mixture. Stir in olives, capers, and frozen peas. Cook, stirring occasionally to allow flavors to meld, 10 to 15 minutes. Season to taste with salt.11. Serve with grated Parmesan cheese and buttered white toast.",
                "Big Daddy Spicy Beef Salad: Add the chipotles, 1/2 cup olive oil and the lime juice to a food processor or blender and season with salt and black pepper, to taste. Pulse until it becomes a thick puree. Coat the flank steak with the chipotle mixture and let it marinate for 30 minutes.Preheat a grill to high heat.Add the jalapenos, cilantro, red peppers, red onion, peanuts, orange juice, soy sauce, sugar and remaining 2 tablespoons olive oil to a large bowl. Toss the ingredients well to combine. Season the mixture with salt and pepper, to taste, and set the bowl aside.When the flank steak has finished marinating, put it on the preheated grill and grill each side for 6 to 7 minutes. Transfer the steak to a cutting board and let it rest for about 8 to 10 minutes. Slice the steak thinly against the grain, and begin assembling your salad immediately.Put the meslun greens on each serving plate and spoon some of the jalapeno mixture over the greens. Top with the sliced flank steak, serve and enjoy.",
                "Hibiscus Agua Fresca: Peel and thinly slice fresh ginger. Combine ginger, hibiscus flowers, and 3 cups boiling water in a medium pot. Let steep at room temperature for 30 minutes. Strain into a large pitcher, discarding solids. Add sugar; stir until dissolved. Add 8 cups cold water. Fill glasses with ice; pour agua fresca over and serve. DO AHEAD Can be made 3 days ahead. Cover and chill.",
                "Ultimate Spicy Nachos: For the sauce: In medium saucepan over medium heat, add the butter, garlic and jalapeno. Saute for 3 minutes, and then sprinkle in the flour. Cook, stirring frequently, until you create a blond roux, about 5 minutes. Add the milk, cheese and mustard and use a whisk to stir all together. Season with salt and pepper and let cook for 5 minutes on low.For the nachos: Shred the chicken and place into a medium bowl. Pour in the barbecue sauce and mix well to combine. Arrange the tortilla chips on a platter and spread the chicken over the chips. Pour the warm cheese sauce over the top and sprinkle with the jalapenos and cilantro. Garnish with dollops of the sour cream."
                
            ]
        }, {
            "tag": "eastAsian",
            "patterns": [
                "Sesame Noodles with Chili Oil and Scallions: Cook scallion whites, vegetable oil, red pepper flakes, sesame seeds, and pepper in a small saucepan over low heat, stirring occasionally, until oil is sizzling and scallions are golden brown, 12–15 minutes; let chili oil cool in saucepan.Meanwhile, cook noodles in a large pot of salted boiling water until al dente; drain. Rinse under cold water and drain well.Whisk tahini, vinegar, soy sauce, sesame oil, sugar, and 2–3 tablespoons chili oil (depending on desired heat) in a large bowl; season with salt. Add noodles and toss to coat. Top with scallion greens and drizzle with more chili oil.",
                "Chicken Khao Soi : Place chiles in a small heatproof bowl, add boiling water to cover, and let soak until softened, 25-30 minutes.Drain chiles, reserving soaking liquid. Purée chiles, shallots, garlic, ginger, cilantro stems, coriander, turmeric, curry powder, and 2 tablespoons soaking liquid in a food processor, adding more soaking liquid by tablespoonfuls, if needed, until smooth.Heat oil in a large heavy pot over medium heat. Add khao soi paste; cook, stirring constantly, until slightly darkened, 4-6 minutes. Add coconut milk and broth. Bring to a boil; add chicken. Reduce heat and simmer until chicken is fork-tender, 20-25 minutes. Transfer chicken to a plate. Let cool slightly; shred meat.Meanwhile, cook noodles according to package directions.Add chicken, 3 tablespoons fish sauce, and sugar to soup. Season with salt or more fish sauce, if needed. Divide soup and noodles among bowls and serve with toppings.",
                "Grilled Lemongrass- and Coriander-Marinated Tofu Vietnamese Sandwiches (Vegan Banh Mi): 1. Combine garlic, cilantro, sugar, white pepper, coriander, soy sauce, lemongrass, and half of oil in the bowl of a food processor. Process until a paste is formed, about 1 minute, scraping down sides as necessary. Brush or rub half of mixture over tofu slabs, stacking them in a plastic container or on a plate as you go.2. To Cook on the Grill: Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate. Place tofu over cooler side of grill at 45-degree angle to the grill grates. Cover and cook for 5 minutes. Carefully rotate tofu 90 degrees and continue cooking until bottom side is crisp and has distinct hash marks, about 5 minutes longer. Carefully flip tofu and repeat cooking and rotating steps until crisp on both sides. Continue with step 4 and transfer tofu to a large plate to cool.3. To Cook Under the Broiler: Oil a wire cooling rack and set it in a foil-lined rimmed baking sheet. Arrange tofu slices on top in a single layer. Adjust rack to 6 to 8 inches below broiler element and preheat broiler to low (if your oven has two broiler settings, otherwise just preheat the broiler). Broil tofu, turning and rotating every few minutes until crisp and browned on both sides, about 20 minutes total. Continue with step 4 and transfer tofu to a large plate to cool.4. While tofu cooks, combine remaining marinade with remaining oil in a small bowl. When tofu is cooked, transfer to a large plate or cutting board and, using a brush or the back of a spoon, coat each piece with the remaining marinade. Cut each piece into slices slightly narrower than the baguettes.5. Place baguettes on the cooler side of the grill (or place in oven and immediately shut off broiler if cooking indoors). Cover and cook until heated through and crisp, about 5 minutes. Split baguettes, leaving them hinged on one side. Spread with mayonnaise. Sprinkle bottoms and tops with liquid aminos, then spoon on a thin layer of the ginger-scallion oil if using. Layer with sliced tofu. Add pickled carrot/daikon mixture, cucumber spears, jalapeño, and cilantro. Season to taste with salt, close sandwiches, split in half crosswise (or if using full-sized standard baguettes, cut each into 3 to 4 serving pieces), and serve immediately.",
                "Pad Thai Pizza: Place a pizza stone or an inverted rimmed baking sheet on the bottom rack of the oven and preheat to 450 degrees F.Combine the peanut butter, coconut milk, lime juice, ketchup, soy sauce, sugar, fish sauce, garlic powder and scallions in a large bowl. Set aside.Prepare the rice noodles according to the package instructions. Drain well, then rinse with cold water and drain well again. Add to the reserved sauce and toss to combine.Dust a piece of parchment paper lightly with flour. Stretch or roll out the pizza dough into a 12-inch round on the parchment, then transfer the dough on the parchment to a pizza peel or another inverted rimmed baking sheet. Top the dough with the noodle and sauce mixture.Sprinkle the shrimp lightly with salt and pepper in a medium bowl. Arrange in a single layer on top of the noodles.Slide the pizza on the parchment paper onto the stone or baking sheet and bake until the crust is golden and the shrimp are cooked through, 12 to 14 minutes.Drizzle the pizza with sriracha and sprinkle with the peanuts, bean sprouts, cilantro and more scallions. Serve with lime wedges.",
                "Asian Scotch Eggs: Bring a large pot of water to a boil. Carefully lower in 4 of the eggs and boil for 5 minutes (this is for a runny yolk; if you want it firmer, add a bit of time). While they're boiling, prepare a large ice bath. When 5 minutes is up, immediately place the eggs in the ice bath.In a large bowl, combine the chicken, rice vinegar, soy sauce, sugar, black pepper, scallions and 1 teaspoon of the ginger.In 3 smaller bowls, set up your breading station. In the first bowl, combine the flour, 1/4 teaspoon ginger, 1 teaspoon salt and black pepper to taste. In the second, whip up the remaining 2 eggs with a splash of water. In the third bowl, combine the panko, some black pepper and the remaining 1 teaspoon salt and 1/4 teaspoon ginger.Working with wet hands, divide the chicken mixture in 4 parts. Place them on separate squares of parchment paper and flatten out into circles, about 1/2-inch thick. Peel the eggs, coat them in the flour mix and then wrap each in the chicken mix. It helps if you fold up the parchment paper to help the chicken onto the egg.Once the egg is fully encased in the meat, coat it in the flour mix, then the egg mix and then the panko mix. Place back on the parchment and hold in the freezer until the rest of the eggs are ready to go.Fill a large pot with 3 to 4 inches of oil and heat it to 350 degrees F. Fry the Scotch eggs until golden brown and cooked through, 5 to 6 minutes. Enjoy!",
                "Thai Seafood Hot Pot : Bring a medium saucepan of water to a boil. Stir in noodles; remove from heat. Let stand until noodles soften, 7 to 10 minutes; drain. Heat oil in a large pot over medium heat. Cook shallots, garlic and onion until soft, 3 to 5 minutes. Add stock, juice from tomatoes, coconut milk, vinegar, fish sauce, lime zest, chiles, sugar and lemongrass. Bring to a boil over medium-high heat. Add cilantro and basil; reduce heat to medium-low; simmer 10 minutes. Remove garlic, cilantro and basil from pot; add tomatoes and mushrooms. Return to a simmer. Add shrimp and scallops; cook 2 minutes. Add calamari and lime juice. Season with salt and pepper. Divide noodles among 4 bowls; top with broth and seafood; garnish with remaining basil and cilantro.",
                "Mocha Toffee Bars: 1. In a bowl with an electric mixer, cream the butter, add the brown sugar, and beat the mixture until it is light and fluffy. Beat in the yolk, add the vanilla and the espresso mixture, a little at a time, beating, and beat the mixture until it is combined well. Add the salt and the flour, beating, and beat the mixture until is combined well. Spread the batter evenly in a jelly-roll pan, 15 1/2 by 10 1/2 by 1 inch, and bake it in the middle of a preheated 350°F oven for 15 to 20 minutes, or until it pulls away slightly from the edge of the pan.2. Spread the chocolate, melted, evenly over the baked layer and sprinkle the cashews over it. Let the mixture cool in the pan on a rack, cut it into 48 bars, and chill it for 15 to 20 minutes, or until the chocolate is firm.",
                "Sweet Potato–Turmeric Miso Soup: Preheat oven to 450°. Pierce potato several times with a fork or sharp knife. Roast potato on a rimmed baking sheet until tender, 35–45 minutes. Let cool, then scoop out flesh; discard skin.Meanwhile, combine kombu and 4 cups water in a large pot. Let sit until kombu softens, 25–30 minutes. Bring to a simmer over medium heat. Immediately remove from heat once water starts simmering; fish out kombu and discard. Add bonito flakes and stir once to submerge them. Return to a gentle boil, reduce heat, and simmer about 5 minutes. Remove from heat and let steep 15 minutes (this ensures you get the most flavorful broth, or dashi, possible). Strain dashi through a fine-mesh strainer into a medium bowl. Discard solids; wipe out pot.Transfer dashi to a blender. Add sweet potato, coconut milk, miso, and turmeric. Blend until smooth. Return to pot and bring to a very gentle simmer. Remove from heat and stir in lime juice.Divide soup among bowls. Top with coconut flakes and peanuts, then drizzle with chili oil.",
                "Cooking Light's Red Cooking Tofu: 1. Combine first 5 ingredients in a 2-cup glass measure, stirring with a whisk. Combine vinegar and cornstarch in a small bowl, stirring with a whisk. Press tofu cubes gently between several layers of paper towels to remove excess moisture. Remove stems from mushrooms; slice mushroom caps to measure 2 cups.2. Heat a wok over medium-high heat. Add oil. Add onions and next 3 ingredients (through ginger). Stir-fry 1 minute. Add broth mixture. Bring to a simmer; cover and reduce heat to medium. Cook 5 minutes. Add tofu and mushrooms; cover and simmer 5 minutes.3. Increase heat to high. Stir cornstarch mixture with a whisk; stir into tofu mixture. Cook, gently stirring constantly, 1 minute or until mixture thickens. Serve over rice.",
                "Har kau bunnies: Method Recipe by Harry Yeung of Yang Sing restaurant in ManchesterFirst make the dumpling filling. Place a large frying pan over a high heat. Add the pork, breaking it up with a wooden spoon, and fry for 5 minutes, until golden. Remove from the pan and set aside to cool.In a large bowl, combine the prawns with ¼ teaspoon of salt and mix until tacky and binding together. Add the rest of the filling ingredients and the pork, and mix to combine. Set aside while you make the dumpling skins.In a separate bowl, mix the flour with 25g of the potato starch and 200ml of boiling water. Add the remaining potato starch and knead into a dough. Pull off 1 teaspoon of the dough, flatten it and, using a pastry knife or rolling pin, roll it on a lightly floured surface to form a circle, about 8cm in diameter.Put 1 teaspoon of filling in the middle of the circle. Fold it into a half-moon shape, pushing one side into small pleats as you press the edges together to seal – this creates the classic ‘har kau’ shape. To fold your dumplings into rabbits, gently press and elongate the sealed edge by about 2cm, then snip in half with scissors. Fold each side of them back and pinch so that they resemble bunny ears. Make two dimples in the front of the dumpling and add a black sesame seed or dab of food colouring into each one to make the eyes. Set a steamer basket over a pan of boiling water. Put each dumpling on a square of baking paper, pop in the steamer, cover with the lid and cook for 8 minutes. Serve with soy and chilli sauces for dipping.",
                "Dinner Tonight: Sichuan-Style Chicken Noodle Soup: 1. Bring large pot of water to a boil. Meanwhile, Pour oil into medium-sized saucepan set over medium heat. Add leeks and mushrooms. Cook until leeks are soft, about four minutes.2. Add chicken stock, soy sauce, rice wine, cinnamon, star anise, Sichuan pepper, and black pepper. Turn heat to high and bring to boil. Reduce heat to medium-low, and simmer for five minutes.3. Meanwhile, add noodles to large pot of boiling cook for exactly one minute less than instructions on packaging say. When timer goes off, drain noodles and transfer to saucepan. Add shredded roast chicken and cook for one minute.4. Serve soup in large bowls with garnish of chopped jalapenos to taste.",
                "Slow-Cooker Chicken Congee : Place chicken, stock, rice, chiles, ginger, garlic, and salt in slow cooker. Cover and cook on low 8 hours.Remove chiles and ginger. Stir, breaking up chicken into bite-size pieces. Divide congee among bowls. Serve with an assortment of toppings alongside.Congee can be made 3 days ahead; transfer to an airtight container and chill. Reheat in a large pot over medium, stirring in water as needed to loosen.",
                "Jiaozi Dumplings : To make the filling, toss the cabbage and salt together in a large bowl and let sit for 15 minutes. Drain the cabbage in a colander over a sink and use your hands to squeeze out excess moisture.In a large mixing bowl, combine the cabbage, pork, soy sauce, rice wine, sesame oil, ginger, green onions, and pepper. Stir in one direction with a chopstick until just mixed.To form the dumplings, rest a wrapper in the palm of your hand and place a heaping teaspoon of filling in the center. Dip your finger in a bowl of water and run it around the edge to help make a good seal. Lightly fold the wrapper over on itself but don't touch the edges together. Starting at one end, use your fingers to make a small pleat on the side of the wrapper closed to you, then press the pleat into the other side and pinch together firmly. Keep making pleats down the dumpling opening in this way until completely sealed. Repeat this process with the remaining filling and wrappers.Bring a large pot of water to a boil. Drop half of the dumplings into the water and stir once so they don't stick together. When the water boils again, add 1 cup of cold water to the pot. Then when it boils again, add 3 cups of cold water. The third time the water boils, the dumplings are cooked. Remove them with a slotted spoon and repeat with the remaining dumplings. Serve immediately with small bowls of Chinese black rice vinegar for dipping.",
                "Hainanese Chicken Rice Set: 1. For the Chicken: Place chicken in large stock pot and add rice wine, 2 tablespoons soy sauce, 2 teaspoons salt, white pepper, ginger, green onions, and pandan leaves (if using). Cover chicken with water (10 to 12 cups).2. Heat over medium-high heat to simmer. Reduce heat to a bare simmer and poach the chicken until just cooked through (155°F) for breasts, (165°F for legs), 35 to 50 minutes. Transfer chicken to plate. Stir sesame oil and remaining tablespoon soy sauce in a small bowl. When chicken is cool enough to handle, rub sesame sauce onto chicken.3. Strain broth and continue to simmer over medium-low heat until reduced to approximately 9 cups (do not skim fat). Season to taste and let cool 15 minutes to allow the fat to rice to the surface.4. For the Rice: Place 2 cups rice and 3 1/2 cups broth (use as much of the fat as possible from the broth) into rice cooker and cook rice.5. For the bok choy: Heat oil and shallots in medium saucepan over medium heat, stirring, until deep golden brown, 3 to 5 minutes. Using slotted spoon, transfer shallots to small bowl.6. Heat 3/4 cup broth to simmer over medium-high heat in 10-inch straight sided skillet with lid. Add bok choy and cover. Cook until just tender but still green, 8 to 10 minutes. Transfer to serving dish and sprinkle with shallots.7. Reheat remaining broth and ladle into bowls. Slice chicken meat into bite size portions and arrange on plate, spooning a small amount of broth over the top. Serve with rice, bok choy, sliced cucumber, cilantro, chili sauce, and kecap manis.",
                "Sambal Shrimp Lettuce Wraps: Whisk hot chili paste, honey, vinegar, and 2 tsp. sesame oil in a small bowl to combine. Season shrimp lightly with kosher salt and place in a resealable plastic bag. Pour in half of marinade and seal bag. Transfer remaining marinade to a small bowl and set aside for serving. Let shrimp sit at room temperature, turning the bag occasionally to ensure even coating, 10–15 minutes.Remove shrimp from marinade, allowing excess to drip back into bag, and transfer to paper towels to drain. Heat 1 Tbsp. vegetable oil in a large cast-iron skillet over medium-high until shimmering. Working in batches and adding another 1 Tbsp. oil along the way if the skillet is looking dry, arrange shrimp in skillet in a single layer and cook undisturbed 2 minutes (the marinade will have darkened in color and some of the sugars in it will have started to caramelize). Turn shrimp over and cook 30 seconds. Transfer to a platter.Arrange cucumbers on platter next to shrimp; season with sea salt and drizzle with remaining 2 tsp. sesame oil. Arrange lettuce leaves and mint sprigs on platter so that each component is visible and easily accessible. Place crushed peanuts in a small bowl and set out next to platter along with reserved marinade (for spooning into wraps).",
                "Chinese-Style Deep-Fried Salty Shrimp: 1. Heat two tablespoons of oil in a wok over medium heat until shimmering. Add the garlic, scallions and let brown, stirring occasionally, 3 to 5 minutes. Add the chili pepper flakes if using and stir until aromatic, about 30 seconds. Transfer oil and aromatics to a large metal bowl. Wipe wok clean with paper towel.2. Add remaining oil to wok and heat to 375°F over medium heat. Meanwhile, combine egg and cornstarch in a medium bowl. Add shrimp and toss to coat. When the oil is ready, add half of the shrimp, dropping them into the oil one at a time. Cook, agitating and flipping shrimp frequently until crisp and just cooked through, 2 to 3 minutes total. Transfer shrimp to a paper towel-lined plate and repeat with remaining batch.3. Add drained fried shrimp to bowl with browned aromatics. Season to taste with salt, pepper, and optional additional seasonings. Serve immediately."
            ]
        }, {
            "tag": "mediterranean",
            "patterns": [
                "Italian Seafood-Salad Pasta Salad With Vietnamese Noodles: 1. In a large pot of salted boiling water, cook noodles until tender, according to package instructions. Drain in a colander and rinse under cold running water to chill. Set aside to drain thoroughly.2. In a medium pot of salted boiling water, cook shrimp until just cooked through and pink all over, about 2 minutes. Using a slotted spoon, transfer to an ice bath to chill. Next, cook squid in the same pot of boiling water until tender and cooked through, about 2 minutes; transfer to ice bath to chill. Drain shrimp and squid well and pat dry.3. In a large mixing bowl, combine shrimp, squid, crab meat, olive oil, lemon juice, lemon zest, minced chili, garlic, parsley, mint, and chives and toss well to combine. Season with salt and pepper. Add noodles and toss to combine. Season once more with salt and pepper, and drizzle more olive oil on top as desired. Serve lightly chilled or at room temperature.",
                "Italian Chicken Soup with \"Toasted\" Parmesan Gnocchi: Preheat the oven to 400 degrees. Bake the potatoes until soft, about 1 hour.Meanwhile, in a large soup pot, brown the bacon over medium heat. Add the carrots, celery and onions. Season with salt and pepper and cook until the vegetables are translucent, 3 to 5 minutes. Add the chicken, thyme and broth; bring to a simmer and skim any foam that rises to the top. Reduce the heat and barely simmer until the chicken is cooked through, about 40 minutes. Discard the thyme. Remove the chicken and let cool. Pull off the meat and shred into bite-sized pieces; cover and set aside. Season the broth with salt and pepper.Melt the butter in a skillet over medium heat. Add the breadcrumbs and cook, stirring, until toasted, about 3 minutes; set aside. Halve the baked potatoes and scoop the flesh into a bowl; mash with a fork and season with salt and pepper. Sift the flour over the potatoes and add the toasted crumbs, parmesan and nutmeg; lightly knead to make a firm dough. Roll into 1/2-inch-wide cylinders; cut into 1/2-inch pieces and round the edges to make oval-shaped gnocchi. Bring the soup to a boil and drop in the gnocchi. Cook until they float to the top, 1 to 2 minutes; transfer the gnocchi to warm bowls with a slotted spoon.Beat the eggs with a fork; use the fork to \"paint\" ribbons of egg across the soup. Let set, about 30 seconds. Stir in the chicken meat, parsley, basil and spinach; season with salt and pepper. Ladle the soup over the gnocchi. Serve with lemon wedges and more Parmesan.",
                "Branzino Al Cartoccio From 'Downtown Italian': 1. To cook the fregola, bring a large pot of water to a boil. Season generously with salt. Taste the water and make sure that it tastes salty. Boil the fregola, stirring occasionally, until al dente, 8 to 10 minutes, depending on the size of the fregola. Drain thoroughly.2. Place the cooked fregola in a medium bowl and toss with 1 1/2 tablespoons of the olive oil. Add the tomatoes, scallion, lemon juice, chili, olives, lemon zest, and the 1/2 teaspoon salt. Toss together and set aside.3. Preheat the oven to 400°F. Season the fish fillets generously on both sides with salt and pepper. Arrange 4 pieces of parchment paper, each 12 inches by 17 inches, on a work surface. Fold each piece of parchment paper in half so that the sheets are approximately 12 inches by 8 1/2 inches.4. Open the parchment paper like a book and spoon one-quarter of the fregola salad onto one-half of each piece of parchment paper.5. Lay the fish fillets on top of the fregola, skin side up. Drizzle 1 1/2 teaspoons of olive oil over each piece of fish. Place one thyme sprig atop each fillet. Fold the parchment paper over the fish fillets to close the book. Starting at the short side of each book, roll or crimp the edges of the parchment to create a tightly sealed packet (it will look like a half-moon when you’re done). Place 2 fish packets on each of 2 baking sheets, leaving a little space between the packets.6. Bake the fish packets for 15 minutes. Serve each packet, parchment paper and all, on a plate with a wedge of lemon. Let guests open their own packets by puncturing the top half of the parchment paper with a knife and fork, and drizzling the fish with freshly squeezed lemon juice.",
                "Scarpetta's Spaghetti With Tomato and Basil: 1. Place a large pot of water on the stove. Heavily season with salt, until it tastes as salty as a broth would. Bring to a boil.2. Roll basil leaves into a cylinder and thinly cut lengthwise into a chiffonade. Set aside.3. Cook the spaghetti in the water and remove when it is just shy of al dente—depending on the pasta, 3 minutes for fresh, 10 minutes for dried.4. While the pasta is cooking, place the sauce into a sauté pan and heat slowly. Allow the sauce to reduce slightly. Add the pasta to the sauté pan along with a bit of pasta water, to add starch and seasoning.5. Add the pasta to the sauce, and allow to finish cooking, over medium high heat. The sauce should coat the pasta and look cohesive. When you shake the pan, the sauce and pasta should move together.6. Remove from the heat and add the basil, cheese, butter, and extra virgin olive oil. Toss until well incorporated.7. Adjust the seasoning and serve immediately.8. Tomato Sauce9. yields 2 cups10. Place a pot of water on the stove and bring to a boil. Prepare an ice bath by placing ice in a bowl and filling with cold water. Core tomatoes with a paring knife, and discard cores. Score the bottom of each tomato with an \"X.\" When water has come to a boil, place tomatoes in water and leave for 15 seconds, until skin begins to split away. Transfer to ice bath. When cool, peel with paring knife.11. Cut tomatoes in half lengthwise. Remove seeds with your thumb, and set seeded tomatoes aside. Reserve seeds and excess juices. If using canned tomatoes, seed in the same way.12. In a new pot, place 2 tablespoons of extra virgin olive oil over medium heat. When the oil is hot, carefully transfer tomatoes to the pot. Add a pinch of salt and chili flakes.13. Allow the tomatoes to cook for a few minutes until they begin to soften, then smash them with a potato masher. If the consistency is particularly thick, strain excess tomato juices for seeds and add to pot. Allow tomatoes to cook 30 to 45 minutes over medium heat, smashing and stirring occasionally.14. While the tomatoes are cooking, prepare the basil-garlic oil. Take a small saucepan and place the remaining 1/4 cup of extra virgin olive oil in the pan. Add garlic cloves, basil, and chili flakes. Slowly heat to allow the flavors to transfer to the oil. When the garlic is lightly browned, remove from the heat. Allow to cool for 5 minutes. Strain the oil and combine with the tomato mixture.15. Remove the sauce from the heat and adjust the seasoning with additional salt, as needed.",
                "Spring Vegetable Risotto with Poached Eggs: If using fresh fava beans, cook in a large saucepan of boiling salted water 1 minute. Drain; transfer to a bowl of ice water and let cool. Peel favas and transfer to a small bowl.Bring a large skillet of salted water to a bare simmer over medium-low heat. Add vinegar. Crack 1 egg into a small bowl, then slide into simmering water. Repeat with 2 more eggs. Cook until whites are cooked but yolks are runny, about 3 minutes. Using a slotted spoon, carefully transfer eggs to a bowl of ice water. Repeat with remaining 3 eggs.Bring broth to a simmer in a large saucepan over medium heat. Reduce heat to low; cover and keep warm.Meanwhile, melt 1 tablespoon butter in a large, wide heavy pot over medium heat. Add mushrooms and cook, stirring often, until tender, about 5 minutes. Using a slotted spoon, transfer to bowl with favas.Heat oil and remaining 1 tablespoon butter in same pot over medium heat. Add leeks, fennel, and garlic. Cook, stirring often, until vegetables are softened, about 4 minutes. Add rice and stir to coat, about 2 minutes. Add wine and cook, stirring occasionally, until evaporated, about 4 minutes.Add 1 cup broth. Cook, stirring often (no need to stir constantly), until broth is almost absorbed. Add remaining broth by cupfuls, allowing broth to be absorbed before adding more, stirring often, until rice is tender but still firm to the bite and mixture is creamy, about 20 minutes total.Add spinach, crème fraîche, 1 1/2 cups grated Pecorino, 1/4 cup chives, and reserved fava beans and mushrooms to risotto. Cook, stirring occasionally, until spinach is wilted and cheese is melted, about 2 minutes. Season risotto with salt.A few minutes before risotto is done, reheat poached eggs in a large skillet of simmering water, about 1 minute.Divide risotto among bowls and top with eggs, shaved Pecorino, chives, and pepper.",
                "Strawberries with lemon and mint (Fragole con limone e menta): Method Place 4 dessert bowls in the freezer. When the bowls are nicely chilled remove from freezer and divide the prepared strawberries between them. Cut the lemon in half and squeeze a little juice over each bowl. Sprinkle over a pinch of lemon zest and ½ tbsp of sugar on each (or use less depending on how sweet your strawberries are). Finish with a few torn up mint leaves and a swig of Prosecco if you have some handy.",
                "Veggie Tortellini Soup: In a medium pot over medium heat, bring the broth to a simmer. Stir in the tomato paste. Add the frozen vegetables and return to a simmer. Add the tortellini and cook until just tender, 3 to 5 minutes. Add the heavy cream. Taste and adjust the seasoning with salt and pepper. Garnish with dried parsley and basil and serve.",
                "Halibut in Cartoccio: Fold 4 (9 by 13-inch) pieces of parchment paper in half and starting at the top of the fold, cut a large half circle from the paper. When the fold is opened it should be a full circle. It is okay if it is not a perfect circle-a heart shape is even better. Reserve.In a bowl combine the zucchini, butternut squash, Brussels sprouts and leeks. Toss generously with olive oil and season with the thyme leaves and salt. Oil and salt the halibut as well.Preheat the oven to 500 degrees F.Open the parchment paper circles (or hearts) and brush the paper with olive oil leaving a 1-inch border around the edge.Divide the seasoned vegetables between the 4 papers, placing them in the center just above the crease. Lay the fish fillets on top of the vegetables and place a lemon slice on top of each fish fillet. Fold the paper over the fish. Working from 1 end of the parchment to the other fold the bottom of the paper over the top to crease and seal the packets. The closure needs to be very secure so the steam will not escape during the cooking process. Before the package is completely sealed, carefully add 1/2 cup wine in each then seal. Bake in the preheated oven for 8 to 9 minutes.Remove the fish from the oven, place on serving dishes and serve immediately. Have each diner slice open their own parchment package so they can get the full effect of the burst of aromatic steam that will be released from the package.",
                "Iceberg Wedges with Pancetta Gorgonzola Dressing: Heat the oil in a heavy medium skillet over medium heat. Add the pancetta and saute until crisp and golden, about 5 minutes. Using a slotted spoon, transfer the pancetta to a paper towel-lined plate to drain the excess oil.Stir the buttermilk, sour cream, and garlic in a medium bowl to blend; mix 2/3 of the cheese. Season the dressing with salt and pepper, to taste.(The dressing can be made up to 2 days ahead. Cover and refrigerate. Stir to blend before using, adding more milk to thin the sauce, if necessary.)Arrange each of 6 lettuce wedges on 6 plates. Spoon the dressing over the lettuce. Sprinkle with the pancetta and remaining cheese and serve.",
                "Chocolate Peanut Biscotti: 1. Preheat oven to 350°F. In the bowl of a stand mixer, cream butter and sugar with the paddle attachment for 6-8 minutes on high speed or until very light and fluffy. Add eggs one at a time, mixing well after each addition and stop the mixer.2. Whisk together dry ingredients. Add dry ingredients to mixer bowl and set on low speed until incorporated. Make sure to avoid over-mixing. Add chopped chocolate and nuts and mix until incorporated.3. Line a sheet pan with parchment. Divide dough in half and shape into two logs that are slightly flat on top and tapered at the base. Brush with egg wash and sprinkle with sugar.4. Bake logs until you can feel a substantial crust has formed on top (they should still be somewhat soft in the center), 30 to 35 minutes. Turn oven down to 300°F.5. Allow logs to cool for several minutes, then transfer to a cutting board. Cut logs on the bias into slices of uniform thickness.6. Place slices, cut side up, on a metal cooling rack set over a sheet pan. Return cookies to the oven until they are firm to the touch, another 10 to 15 minutes. Remove cookies from the oven and allow to cool completely. Store in an airtight container.",
                "Pasta with Delicata Squash and Sage-Brown Butter : Melt butter in a large skillet over medium. Cook, swirling pan occasionally, until butter turns caramel-brown and smells nutty, 2–3 minutes. Add sage leaves and fry until crispy, 10–15 seconds. Remove from heat. Using a slotted spoon, transfer sage to paper towels to drain. Pour all but 2 Tbsp. brown butter into a small bowl.Cook panko and 4 sage leaves in same skillet, stirring to break up sage, until mixture is toasty, about 2 minutes. Transfer to a plate.Cook squash and 3 Tbsp. brown butter in same skillet over medium heat, stirring frequently, until squash begins to brown, about 5 minutes. Add 1/2 tsp. salt, 1/8 tsp. pepper, and 3/4 cup water; cover pan and cook until squash begins to soften, about 5 minutes. Remove lid and continue cooking, stirring occasionally, until liquid has evaporated and squash is tender and caramelized, about 5 minutes more.Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente, 8–10 minutes. Drain, reserving 3/4 cup pasta cooking liquid.Add remaining 3 Tbsp. brown butter to skillet and stir until squash is evenly coated. Add 1/2 cup pasta cooking liquid and simmer until a thin sauce forms, about 1 minute; season with 1 tsp. pepper. Add pasta, tossing to coat and adding pasta cooking water as needed to coat pasta. Remove from heat, top with half of the reserved sage, and stir to combine.Transfer pasta to a large serving bowl or individual pasta bowls. Top with panko mixture, remaining sage, and a generous shaving of Parmesan.",
                "Lasagna al Forno: Cook the lasagna noodles in plenty of boiling salted water until pliable and barely tender, about 10 minutes. Stir with a wooden spoon to prevent sticking. Drain the noodles thoroughly, coat with olive oil keep them moist and easy to work with.Coat a large skillet with olive oil. Saute over medium heat, onion, garlic and herbs. Cook 5 minutes. Brown beef and sausage until no longer pink, about 15 minutes. Drain fat into a small container and discard. Stir in the tomato paste completely. Set aside to cool.In a mixing bowl, combine ricotta, parsley and oregano. Stir in beaten eggs. Add Parmesan, season with salt and pepper.To assemble the lasagna: Coat the bottom of a 13 by 9-inch pan with a ladle full of tomato sauce. Arrange 4 noodles lengthwise in a slightly overlapping layer on the sauce. Then, line each end of the pan with a lasagna noodle. This forms a collar that holds in the corners. Spread 1/2 of the meat mixture over the pasta. Dollop 1/2 of the ricotta mixture over the meat, spread to the edges with a spatula. Sprinkle 1/2 of the mozzarella on top of the ricotta. Top with a ladle full of tomato sauce, spread evenly. Repeat with the next layer of noodles, meat, cheeses and sauce. Top last layer with noodles, sauce and shredded mozzarella and Parmesan. Tap the pan to force out air bubbles. Bake in a preheated 350 degree oven for 1 hour. Remove from oven. Let lasagna rest for 30 minutes so the noodles will settle and cut easily. Cut into 2-inch squares and serve.",
                "Pizza with Pesto, Ricotta, and Mozzarella: 1. At least 2 hours before baking, divide dough into three even parts, form into balls, place on a lightly floured surface, cover loosely with plastic wrap, place a towel on top of the plastic wrap to keep the edges pressed down, and allow balls to rise at room temperature.2. Meanwhile, bring a large pot of salted water to a boil and prepare an ice bath. Add spinach, basil, and garlic to boiling water and boil until leaves are just wilted, about 30 seconds. Transfer to ice bath and allow to chill completely. Transfer to the center of a clean kitchen towel. Gather up towel edges to form a bundle in the center. Squeeze until you've extracted as much liquid as possible.3. Transfer greens to work bowl of a food processor. Add 3 ounces of parmesan, pine nuts, garlic, olive oil, and lemon zest. Process until a smooth puree is formed. Season to taste with salt.4. At least 30 minutes before ready to bake, adjust oven rack to top position and place a baking stone or steel on top. Preheat oven to highest setting (500 to 550°F).5. Working one pizza at a time, stretch or roll dough out into a 12-inch circle on a lightly floured surface. Transfer to a lightly floured wooden pizza peel. Sprinkle surface evenly with 1 ounce of parmesan cheese. Dollop 4 ounces of mozzarella, 4 ounces of ricotta, and 1/3 of pesto over surface of pizza and sprinkle with salt. Transfer to pre-heated steel or stone and bake until blistered and bubbly, 4 to 8 minutes. Remove from oven, slice into 8 slices and serve. Repeat with remaining 2 pizzas.",
                "Sicilian Eggplant and Pine Nut Caponata: 1. Toss pine nuts with 1 teaspoon olive oil and transfer to a large plate. Toast by microwaving on high power for 2 minutes. Continue microwaving at 30 second intervals until golden brown and nutty, 3 to 8 minutes total. Alternatively, toast in a toaster oven set at 375°F until golden brown and nutty, about 15 minutes. Set aside.2. Heat 4 tablespoons oil in a large non-stick or cast iron skillet over high heat until shimmering. Add eggplant and cook, tossing occasionally, until completely softened and browned in spots (eggplant will initially absorb all of the oil then slowly release some of it), about 6 minutes.3. Push eggplant to the side of the skillet and add 2 more tablespoons oil to the center. Add scallions, celery, bell pepper, and garlic and toss to combine with the eggplant. Cook, stirring and tossing frequently, until vegetables are softened and aromatic, about 3 minutes longer.4. Add reserved pine nuts, mint, parsley, tomato paste, ground cinnamon, raisins, capers, sugar, red wine vinegar, and balsamic vinegar and toss to combine. Drizzle in remaining olive oil and bring to a simmer, adding water a tablespoon at a time as necessary until caponata has a sauce-like consistency that is loose, but doesn't run freely over a plate. Season to taste with salt and pepper.5. Let mixture cool to room temperature or refrigerate in a sealed container for up to a week. Serve at room temperature garnished with extra mint leaves and a drizzle of olive oil if desired. Serve with toasted bread or pasta.",
                "Richard Blais's Potato \"Linguine\" with Conch and White Wine: 1. Using a Japanese mandoline or a very sharp long knife, cut the potatoes lengthwise into long, thin sheets (as thin as possible—ideally, you should be able to see through them). Stack the slices a few at a time and cut them lengthwise into 1/4-inch-wide ribbons.2. Pour the chicken stock into a large skillet and bring to a simmer over medium-high heat. Add the potatoes and butter and cook until the potatoes begin to absorb the stock, about 4 minutes. Add the conch, oregano, and chiles and cook until the potatoes are al dente and most of the stock is absorbed, about 5 minutes. Season with salt and pepper.3. Pour in the wine and toss the potatoes gently until it evaporates. Stir in the parsley.4. Divide the “linguine” among four warmed shallow bowls. Squeeze some lemon juice over each bowl and top with a sprinkling of bread crumbs. Serve immediately.",
                "Sicilian-style tuna carpaccio: Method Place the capers into a small bowl, cover with the rosé, then leave to soak for 10 minutes or so. Meanwhile, hold the chilli over a direct flame on the hob (or place under the grill) for around 5 minutes, or until blackened and blistered all over, turning occasionally. Transfer to a bowl, cover with cling film and leave to cool for around 10 minutes. Meanwhile, using a long sharp knife, slice off and discard the veiny stub of meat from the tuna, then thinly slice against the grain. Place on a plate and squeeze over the juice from half the lemon – the acidity will start to cook the fish.Pick and finely chop the basil, finely chop the dill fronds, then peel and finely chop the garlic. Drain and finely chop the capers, then add the chopped ingredients to a bowl with 2 tablespoons of extra virgin olive oil. Scrape off and discard the blackened skin from the cooled chilli. Halve, deseed and finely chop most of it, then add the chopped chilli to the bowl, reserving the rest to one side. Stir well to combine.Arrange the tuna on a clean serving platter, drizzle with a little extra virgin olive oil, then spoon over the herb paste. Finely slice the reserved chilli lengthways and arrange on top, then serve with dressed rocket and lemon wedges for squeezing over.",
                "Tortellini Soup: In a large stockpot over medium heat, heat the oil until it shimmers, about 2 minutes, then add the onion, garlic, and carrots, and saute for 5 minutes or until the vegetables are slightly soft. Pour in the chicken stock, increase the heat to high, and bring to a boil. Add the peas, tortellini, and corn and cook for 12 minutes, or according to the package directions for the tortellini.Remove the stockpot from the heat and add the spinach, stirring until it wilts. To serve, spoon the soup into bowls and top with grated Parmesan cheese.",
                "Champagne Cake Roll With White Chocolate (White Chocolate Bûche de Noël): 1. For the Cake: Adjust oven rack to lower position and preheat oven to 350°F. Grease a rimmed jelly roll pan with a little butter and line with baking parchment on bottom and sides.2. In a large bowl, beat eggs with an electric mixer until tripled in volume and lightened in color, about 5 minutes. With the mixer running, add the sugar one tablespoon at a time, mixing well after each addition. This should take about 2 minutes. Drizzle in the oil, buttermilk and Marc de Champagne and mix until incorporated.3. In a small bowl, stir together the flour, baking powder, and salt. Add dry ingredients to the egg mixture, one tablespoon at a time, mixing continuously until combined. Pour batter into prepared pan and carefully tilt pan to distribute batter in an even layer. Bake for until a tester inserted into the center of the cake comes out clean and top of the cake springs back when pressed with fingers, 12 to 15 minutes.4. While the cake is in the oven, place a clean, cotton tea towel (preferably one without decorative textures) on counter and sprinkle with powdered sugar, using your hands to rub the sugar into the tea towel.5. Once the cake is done, remove from oven and allow to cool for one minute, then immediately turn cake out onto the tea towel, carefully peel off the parchment and roll cake in the tea towel, starting at a short side. Roll slowly and tightly. Place cake roll (wrapped in tea towel) on a wire rack seam-side down until it has cooled completely.6. For the Champagne syrup: Combine water and sugar in a small saucepan. Heat over low heat, stirring until the sugar has dissolved and the syrup is clear. Remove from heat, transfer to a mug and allow to cool. Once cool, combine 1/4 cup of syrup with the Marc de Champagne. (Remaining syrup can be stored in a sealed container in the refrigerator for another use.)7. For the Champagne Buttercream: In a medium-sized heatproof bowl, whisk together the egg whites and sugar. Place the bowl over a small pan with simmering water, making sure the water doesn't touch the bowl. Keep whisking the mixture until sugar has dissolved. You can easily check whether the sugar has dissolved by rubbing a bit of the mixture between your fingers; the mixture shouldn't feel grainy.8. If you're not worried about salmonella, you can take the mixture off the heat at this point. If you want to pasteurize the meringue, keep whisking until the mixture reaches a temperature of 71°C/160°F using a candy thermometer. Once the meringue reaches the desired temperature, take it off the heat. Using a hand held or a stand mixer, beat the warm mixture until the meringue holds stiff peaks and the bottom of the bowl feels cool to the touch.9. Add butter one cube at a time, beating well with the electric mixer after each addition. The mixture may start to look as if it’s separating during this process but don't panic: just keep beating and the buttercream will come together and become smooth. Once the buttercream is smooth and creamy, add Marc de Champagne and again mix until smooth.10. Once the cake has cooled to room temperature, carefully unroll the cake roll and place it on a clean work surface. Allow the tightest rolled end to curl back in to prevent the cake from cracking. Should it crack a little, that’s fine; you won’t see it after you roll it back up.11. Using a pastry brush, brush the inside of the cake roll with the champagne syrup. Frost with the Champagne buttercream, leaving a one-inch border uncovered at the uncurled end. Reroll cake starting from the curled end.12. For the White Chocolate Ganache: Combine cream and white chocolate in the bowl of a double boiler. Heat over low heat, stirring occasionally, until the chocolate has melted and the ganache is smooth. Remove from heat and allow to cool to body temperature.13. Once cool, beat ganache with a mixer until it lightens in color. It should be thick, but easily spreadable. Frost the cake roll with the white chocolate ganache, using the back of a spoon to create a bark-like pattern. Allow excess ganache to drip down onto the cookie sheet. Place cake (wire rack and all) in the fridge until ganache has set.14. For the White Chocolate Shards: place a cookie sheet in the freezer. Carefully melt the chocolate in the bowl of a double boiler, stirring occasionally. Once the chocolate has melted, remove the cookie sheet from the freezer and line it with baking parchment. Pour the melted white chocolate onto the sheet. Using the back of a spoon, spread the chocolate in an even layer. Allow chocolate to set completely in the refrigerator.15. Once set, use a sharp knife to cut the chocolate into shards. Using a clean, dry paintbrush, brush the chocolate shards with the gold luster dust.16. To Assemble: Once the ganache has set, remove the cake from the fridge. Heat a serrated knife by placing the knife in a tall container filled with hot water. Dry the knife and trim ½ inch off both ends of the cake, wiping the knife clean between cuts.17. Run a sharp knife along the perimeter of the cake to loosen the ganache from the wire rack. Carefully transfer the cake to a serving plate or cake stand using a large spatula. Decorate with the chocolate shards and sugar pearls as desired.18. Allow the cake to come to room temperate before serving. This should take 2-3 hours. Undecorated cake (finished cake roll without the chocolate shards and sugar pearls) can be stored in an airtight container in the fridge for up to two days. Decorate just before serving.",
                "Dinner Tonight: Salmon Niçoise Salad: 1. In a small bowl, combine chopped shallots with the vinegar until just covered. Set aside.2. Bring a small pot of water to boil, then cook the eggs, lowering them gently in, for 7-8 minutes. Remove and run under cold water until cool enough to peel.3. Steam the green beans over a couple inches of water until just tender, then remove them with tongs to a bowl of ice water to shock. Add the salmon fillet and steam it until just opaque in the center. Alternatively, you can boil the beans and poach the salmon.4. In the meantime, pour away 3 tablespoons of the vinegar from the shallots into a bowl to make the dressing. Add the Dijon, garlic, and a good pinch of salt. Add the oil in a very slow stream, whisking constantly. Taste occasionally for acidity, and stop adding the oil when the dressing is right. Add the parsley and stir well.5. Toss the beans and mesclun greens with the dressing, then transfer to serving bowls. Slice the eggs and lay them on the greens, along with the tomatoes. Scatter the salmon over everything. Shower it all with black pepper. Serve while the salmon and eggs are still just warm.",
                "Our Favorite French Onion Soup : In a large Dutch oven or other large pot, melt 3 tablespoons butter over medium heat. Add the oil and onions; cook onions are until softened, stirring occasionally, about 15 minutes. Add the salt, pepper, and sugar; continue to cook, stirring occasionally, until onions are deep golden brown and caramelized, reducing heat slightly if onions seem to be browning too quickly, 35 to 45 minutes more.Add wine and raise heat to high. Cook until almost all liquid has evaporated, 8 to 10 minutes.Tie thyme and bay leaves into a bundle with twine. Add broth and herb bundle to pot with onions. Bring to a boil, reduce to a simmer, and cook, uncovered, until broth is thickened and flavorful, 20 to 30 minutes. Remove from heat and whisk in remaining 2 tablespoons butter. Taste and adjust seasoning.Heat the broiler. Cut two 1/2-inch baguette slices for every serving of soup. Place baguette slices on a rimmed baking sheet and toast in oven until crisp and dry but not browned, about 1 minute per side. Rub one side of each toast with the garlic clove and set aside.Place ramekins or ovensafe bowls on a rimmed baking sheet, add 1/2 teaspoon of sherry to the bottom of each, and ladle soup on top. Top each serving of soup with two garlic-rubbed toasts. Divide cheese among the servings, covering the bread and some of the soup. Carefully transfer baking sheet to oven and broil until cheese is melted and bubbling, 4 to 8 minutes. (Alternatively, if using regular soup bowls: Top each garlic-rubbed toast with some cheese and return to broiler to melt, about 2 minutes more. Divide sherry and soup among bowls, sprinkle with remaining cheese, and top each serving with two cheese toasts.)",
                "Herbes de Provence Rotisserie Chickens : Place butter, herbes de Provence, and salt in small bowl; mash with fork until blended to thick granular paste. Starting at neck end of each chicken, carefully run fingers under skin of breasts to loosen. Starting at each side of main cavity, carefully run fingers under skin of thighs to loosen. Rub herb-seasoned butter on chicken under loosened skin and on outside of each chicken. Truss chickens by tying legs together and tying wings flush to sides. Enclose chickens in extralarge resealable plastic bags. Chill at least 6 hours. DO AHEAD Chickens can be prepared 1 day ahead. Keep refrigerated. Let chickens stand at room temperature about 30 minutes before cooking.Remove spit from rotisserie attachment and prepare barbecue (medium-high heat). Thread chickens on spit, pushing close to center. Reattach spit to motor. Place shallow disposable foil pan(s) under chickens for drips. Close grill, inserting stem of instant-read thermometer through hole in hood of grill to monitor temperature. Maintain temperature at around 400°F by opening vents to increase heat and closing vents to reduce heat. Cook chickens until thermometer inserted into thickest part of thigh registers 170°F, about 50 minutes. Turn off grill, but do not open. Let chickens rest in covered grill 10 minutes.Slide chickens off spit and onto platter. Cut each chicken into 6 or 8 pieces and arrange on platter.If using a charcoal grill,arrange coals on either side of a disposable aluminum baking pan, dividing coals equally. If using a three-burner gas grill, light burners on left and right, leaving center burner off. If using a two-burner gas grill, light burner on side opposite disposable pan. Insert an instant-read thermometer into top vent of grill or place oven thermometer inside grill on grate over pan. Bring temperature to 350°F to 375°F. Place chicken on grate above pan. Close grill. Adjust grill vents or heat setting as needed to maintain temperature.",
                "TD PB Crisp A-la Mode: Mix all of the dry ingredients, for the crust, together in a bowl. Add the beaten egg and the butter, and mix well until thoroughly combined.Combine all of the filling ingredients in a medium bowl.Mix all of the dry ingredients for the crisp in a bowl, then add the butter and mix until \"crumbly.\"Preheat the oven to 350 degrees F.Put the crust into the bottom of a warmed cast iron pan, forming a crust that comes up the sides of the pan. Add the filling and spread evenly. Trim any remaining crust that rises above the peanut butter mixture. Top with the crisp mixture and bake for 25 to 30 minutes.Mix the ice cream, preserves, and syrup until combined. Put the mixture in the freezer to harden and serve with the PB crisp.",
                "Pan-Seared Foie Gras With Spiced Citrus Purée: 1. Make the Orange Puree: Use the tip of a sharp knife to cut several slits in the skin of the orange.2. Combine cinnamon, clove, sugar, and water in a small saucepan and bring to a boil over medium-high heat, stirring until sugar is dissolved. Reduce heat to the lowest setting. Add orange to pot. Place a clean kitchen towel or a paper towel over the top of the pot, pushing it down until it is in contact with the liquid to keep the orange moist on all sides. Cook until orange is completely tender, about 1 hour. Discard cinnamon and star anise.3. Transfer orange to the jar of a blender and add a cup of cooking syrup. Blend on high speed until completely smooth, adding more syrup as necessary to reach a nice gel-like consistency. Season with a pinch of salt and press through a fine mesh strainer. Set aside. Reserve orange syrup for another use (see note)4. For the Foie Gras: Lay a double layer of paper towels on top of a plate or cutting board and set aside. Season foie gras liberally on all sides with salt and pepper. Heat a small skillet over high heat for at least 3 minutes. Place foie gras in skillet scored-side-down. It should immediately start smoking, sizzling, and rendering fat. If it doesn't, remove and allow the pan to preheat for another 1 to 2 minutes. Once all four pieces of foie are in skillet, cook, swirling pan gently every few seconds, until deeply browned and crisp on first side, about 30 seconds. Use a thin metal spatula to flip foie gras onto second side and cook for 30 second longer. Transfer to paper towel-lined plate and let rest for 1 minute.5. Spoon some orange puree onto four individual serving plates and place 1 slice of foie gras on each. Top with chives, coarse sea salt, and candied orange peel. Serve immediately with lightly dressed greens.",
                "Moorish crunch salad: Method First of all, finely slice your carrots into matchstick-sized batons. Finely slice your radishes – you can leave a little of the tops on if you like. Quarter your apples, remove the cores and finely slice. Add all these to a bowl with the rest of the ingredients, apart from the sesame seeds. Toss together, carefully checking the seasoning, and serve with the sesame seeds sprinkled over the top. Eat straight away.Try this: Turn it into a warm salad by adding some pan-seared chicken, prawns or scallops which have been dusted with a little paprika.And this: Make it more of a snack by frying some halloumi cheese until golden with some chopped fresh chilli and crumbling this over the top.Or this: Grill some pitta bread and serve stuffed with the Crunch Salad. Crumble in some feta cheese too. Lovely.",
                "Grilled Lamb Chops with Mint: In a small bowl, stir together mint, rosemary, oil, garlic, salt, and pepper. Rub on chops. Cover chops with plastic wrap, and refrigerate at least 30 minutes or overnight.Prepare grill either by igniting coals and allowing them to die down to medium-hot, or by preheating a gas grill to medium-high. For medium chops, cook 6 to 7 minutes per side (or until firm and resilient to touch); for rare, cook about 5 minutes per side (or until meat is barely firm — but not springy — to touch). Alternatively, preheat oven to 400 degrees; and roast chops 10 to 15 minutes, depending upon how well done you like them, turning once.Slice into one chop to test doneness; remove from grill while slightly pinker than desired (chops will continue to cook as they rest). Transfer to a platter. Serve with Minty Gremolata Sauce on side.",
                "Cabbage and Carrot Slaw with Walnut-Za'atar Pesto : Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool. Process walnuts, garlic, cheese, and za'atar in a food processor until nuts are coarsely chopped. With motor running, stream in oil; process until coarsely ground. Season with salt.Pesto can be made 1 day ahead. Cover and chill.Place currants in a small bowl and cover with very hot water. Let sit until soft and plump, 5–10 minutes.Meanwhile, whisk yogurt, lemon juice, and oil in a large bowl; season with salt and pepper. Thin with water until dressing is consistency of heavy cream.Drain currants and add to dressing along with cabbage, carrots, and parsley; toss to coat. Season with salt.Swipe walnut pesto on a platter and arrange slaw over; sprinkle with za'atar.",
                "Man'oushe with Za'atar Oil, Tomatoes, and Cucumber: Whisk sugar, yeast, and ½ cup warm water (105°–110°) in a medium bowl until yeast is dissolved. Let sit until foamy, 5–10 minutes.Meanwhile, whisk salt and 3¼ cups flour in a large bowl. Make a well in the center and pour in yeast mixture, 2 Tbsp. oil, and ¾ cup warm water. Stir with a wooden spoon from the center out to gradually incorporate dry ingredients until you have a rough, shaggy dough.Turn out onto a work surface and knead lightly to bring together into a single mass. Continue kneading, adding flour as needed if sticky, until dough is smooth, supple, firm, and elastic, about 5 minutes. Place in an oiled bowl; turn to coat. Cover with plastic wrap and let sit in a warm spot until doubled in size, 1¼–1¾ hours.",
                "Striped Bass with Saffron Vegetables and Spiced Broccoli Rabe : Finely grind first 5 ingredients in spice grinder. Transfer to small bowl. Add butter and tomato paste; stir to blend. Season with salt and pepper. Do ahead Can be made 2 days ahead. Cover and chill.Preheat oven to 350°F. Place garlic in small ovenproof dish. Drizzle with 1 teaspoon oil, cover tightly with foil, and roast until tender, about 30 minutes. Cool; peel.Place roasted garlic, remaining 2 tablespoons oil, olives, capers, raisins, anchovies, and crushed red pepper in mortar. Mash with pestle until coarse puree forms. (Alternatively, process in mini processor until coarse puree forms.) Do ahead Spiced puree can be made 1 day ahead. Transfer to small bowl and chill.Cook broccoli rabe in large saucepan of boiling salted water until stems are crisp-tender, about 5 minutes. Drain, pressing on broccoli rabe to release excess water. Transfer to medium bowl. Add spiced puree and toss to coat. Do ahead Can be made 2 hours ahead. Let stand at room temperature.Bring broth to boil in heavy large saucepan. Add cauliflower, squash, and radishes. Sprinkle with salt and pepper. Cover and simmer 3 minutes. Uncover, add 6 tablespoons saffron butter, and simmer until vegetables are tender and broth thickens slightly, stirring frequently, about 4 minutes.Meanwhile, sprinkle fish with salt and pepper, then dredge in flour. Heat 1 tablespoon oil in each of 2 large skillets over medium-high heat. Place 3 fillets, skin side down, in each skillet and cook until brown, about 3 minutes per side.Divide vegetables and broth among 6 shallow soup bowls. Top each with fish fillet, skin side up. Top with spiced broccoli rabe and serve.",
                "Dakos (Greek Bread Salad): Preheat the grill. Brush the bread with oil on both sides and season with salt and pepper. Grill bread on both sides until lightly golden brown. Remove the bread to a platter and let sit at room temperature to get slightly hard.Meanwhile, whisk together 1 cup olive oil, lemon juice, and dill in a medium bowl. Season, to taste, with salt and pepper. Fold the cucumber, tomatoes, onion, and feta into the oil mixture and let stand at room temperature for 30 minutes. Spoon the mixture over the bread. Garnish with additional dill and drizzle with chili oil, if desired. Serve immediately.",
                "Greek Yogurt Panna Cotta with Granola Streusel: 1. Sprinkle gelatin over warm water and let sit until gelatin is fully absorbed, about 10 minutes. In a large bowl whisk together Greek yogurt, cream, and vanilla.2. Heat milk and sugar in a small saucepan over medium high heat, stirring occasionally to prevent scorching. When bubbles begin to form around the edges remove from heat and pour in the gelatin, whisking constantly until the gelatin has dissolved into the milk. Slowly pour the hot milk into the cream/yogurt mixture and divide between 4 large wine glasses. Let chill for 2 hours until set, or ideally cover with plastic wrap and refrigerate overnight.3. When ready to serve, melt butter in a medium saucepan over medium heat, then add granola and 2 tablespoons brown sugar. Cook stirring constantly until granola is toasted and coated with sugar. Let cool completely before serving the granola crumbled on top of the panna cotta."

            ]
        }, {
            "tag": "southAsian",
            "patterns": [
                "Southern Indian crab curry: Method Heat 2 tablespoons of olive oil in a large pan and add the fennel seeds, mustard seeds, cardamom pods, cumin seeds, ginger, garlic, onion and chilli. Fry on a medium heat for 4 to 5 minutes until lightly golden, then add the turmeric, a splash of olive oil and the brown crabmeat. After a minute or so, pour in the coconut milk and a tinful of water. Let it simmer away for 5 minutes so all the flavours develop. Then add the lemon juice and simmer for another 10 minutes, or until the sauce resembles double cream in consistency.Just before you stir in the white crabmeat, check that all the shell has been picked out, then add half the coriander, simmer for 4 more minutes and taste. Season carefully with salt and pepper and a little more lemon juice if you think it needs it. Serve with some fluffy white rice, sprinkled with the rest of the coriander leaves.",
                "Vadouvan Yogurt Dip: Heat vadouvan and 3 Tbsp. oil in a small skillet over medium until oil is sizzling around spice and spice is very fragrant, about 2 minutes. Let cool.Mix yogurt, sour cream, lemon juice, garlic, and 3 Tbsp. dill in a medium bowl; season with salt and pepper. Mix in vadouvan oil. Drizzle with more oil and top with more dill.",
                "Lamb Curry: Cut meat, as uniformly as possible, into 2 by 3 inch cubes. Generously sprinkle with salt and pepper.Heat oil in a large Dutch oven over high heat. Cook meat until golden brown on all sides, then reserve on a platter. In same pot, cook onions, stirring occasionally, until golden. Reduce heat to medium, add garlic and all dry spices, and cook about 3 minutes, stirring occasionally. Return meat to pan and pour in lamb stock. Bring to a boil, reduce to a simmer, and cook, uncovered, 1 hour 15 minutes. Occasionally skim and discard fat that rises to the top.Ladle warm stew over a bed of basmati rice and serve with Orange Dal with Ginger and Garlic. Garnish with yogurt and Fried Onions. Serve immediately.",
                "Paneer Curry with Peas: Place flour in medium bowl. Add paneer to bowl; toss to coat with flour. Heat 2 tablespoons ghee in heavy large nonstick skillet over medium-high heat. Shake excess flour from paneer; add to skillet and cook until browned in spots, turning occasionally, about 4 minutes. Transfer paneer to plate; set aside. Reserve skillet.Place onion pieces in processor. Using on/off turns, process until finely chopped but not watery. Heat remaining 3 tablespoons ghee in reserved skillet over medium heat. Add cumin seeds and stir until aromatic, about 1 minute. Add chopped onion and cook until beginning to brown, stirring often, about 10 minutes. Add minced ginger, minced garlic, ground coriander, and minced serrano chile with seeds; stir 1 minute. Add crushed tomatoes with puree, 1/2 cup water, and turmeric; bring to simmer. Reduce heat to medium low; cover and simmer until mixture thickens slightly and flavors blend, stirring occasionally, about 15 minutes.Add shelled fresh peas and cooked paneer; gently fold to incorporate evenly. Cook mixture over medium-low heat until peas are tender and paneer is heated through, folding occasionally, about 5 minutes. Fold in garam masala and cilantro. Season curry to taste with salt and pepper. Serve with steamed basmati rice.",
                "Prawn Patia (Indian Sweet and Spicy Shrimp): 1. Heat oil in a large skillet over medium-high heat until shimmering. Gently put in the curry leaves and step aside as they pop. Stir for 20 seconds. Add the chopped onions and stir until lightly browned, about 5 minutes. Add the green chillies and stir for another minute. Add the tomato puree and keep stirring until oil separates from the onion tomato mix, about 5 minutes. Add the ginger-garlic past, red chilli, turmeric, and cumin, and keep stirring until mixture is fragrant, about 5 minutes, taking care to ensure the mixture doesn't stick to the bottom.2. Add the sugar/grated jaggery, vinegar, and water and cook till the rawness of the tomato is gone, about 5 minutes. Season to taste with salt. Add the shrmp, stir and let cook for one minute. Remove from heat. Allow to continue cooking off heat, stirring occasionally, until shrimp are cooked through, about 4 minutes longer. Garnish with coriander and serve with white rice and daal."
            ]
        }, {
            "tag": "celtic/icelandic",
            "patterns": [
                "Mulled Wine Ice Cream: 1. In a dry skillet over high heat, toast spices, stirring frequently, until they are fragrant, about 30 seconds.2. In a medium non-reactive saucepan bring wine and spices to a simmer over medium heat. Squeeze in juice of one orange through a strainer to remove seeds, then add spent orange to the pan. Cook, stirring frequently, until wine reduces to a thick, bubbly syrup that measures to 1/4 cup. Strain out spices and orange and set aside to cool.3. In another clean medium saucepan whisk together egg yolks and sugar until well combined and slightly thickened. Whisk in cream and milk until fully incorporated, add wine reduction, then cook over medium heat until a custard forms on a spoon and a finger swiped across the back leaves a clean line. Pour through a strainer into an airtight container, stir in brandy and salt to taste, and chill overnight in refrigerator.4. The next day, churn according to manufacturer's instructions. Transfer ice cream to freezer and harden for at least 4 hours before serving.",
                "Oil-Poached Halibut with Tomatoes and Fennel : Simmer garlic, fennel bulbs, tomatoes, fennel seeds, sugar, bay leaf, zest, and 1 teaspoon salt in oil, stirring occasionally, until vegetables are tender but still intact, 30 to 40 minutes.While vegetables simmer, rub fish with 1 1/2 teaspoon salt and 1/2 teaspoon pepper and let stand 10 to 20 minutes.Transfer vegetables to a bowl with a slotted spoon, then submerge fish in oil (if necessary, to lift level of oil, return vegetables to pot) and cover surface of oil with parchment paper. Cook fish over medium heat (without simmering) 5 minutes and remove from heat. Let fish cook from residual heat (still covered with parchment) until just cooked through, 10 to 15 minutes.Carefully transfer fish to a platter using 2 metal spatulas. Discard bay leaf. Surround with vegetables. Drizzle with some of oil and sprinkle with chopped fronds. Serve warm or at room temperature.",
                "Herb Jam: Place garlic in a large pot. Layer greens and herbs over. Pour 1 cup water over. Bring to a simmer over medium heat. Cover pot, reduce heat to medium-low, and steam until greens and herbs are wilted and garlic is very soft, 20–30 minutes.Using tongs, transfer greens and herbs to a medium bowl. Let sit until cool enough to handle. Pick out garlic and transfer to a small bowl; using a fork, smash to a paste.Squeeze any excess water out of greens and herbs. Transfer to a cutting board, finely chop, and set aside.Wipe out skillet. Heat ½ cup oil over medium-low. Add chile and ginger and cook, stirring frequently, until fragrant and chile has softened, about 1 minute. Add chopped greens and herbs and cook, stirring often, until most of the moisture is cooked out of the greens, 10–15 minutes. Add garlic and coriander. Using a wooden spoon, mash garlic into greens mixture and stir to combine. Continue to cook, stirring occasionally, until well combined and flavors have melded, about 5 minutes more. Remove from heat. Season with salt and stir in lemon juice and remaining ¼ cup oil.Spoon ricotta on toast and top with herb jam. Finely zest lemon over.Do Ahead: Herb jam can be made 5 days ahead. Wrap in plastic, pressing directly onto surface, and chill. Let jam come to room temperature before using.",
                "Scallion Powder From Scallion Greens: 1. Spread 1/4 of scallion greens on a microwave-safe plate lined with a double layer of paper towels. Top with a second paper towel (do not press down). Microwave on high for 4 minutes, then continue in 20 second intervals until greens are papery, dry, and crumble when pinched. Repeat with remaining greens.2. Add greens to spice grinder or mortar and pestle. Grind until powdered. Store in an air-tight container.",
                "Smoked Salmon Smørrebrød : Whisk potatoes, if using, sour cream, horseradish, dill, parsley, and lemon juice in a small bowl; season with salt and pepper.Spread horseradish sour cream on bread and top with smoked salmon, radishes, roe, if using, dill, and parsley. Season with pepper.",
                "Rock/Stone Scones: Preheat the oven to 350 degrees F. Line two sheet pans with parchment.In a large mixing bowl, whisk together the flour, sugar, baking powder, salt and cayenne. Add the butter and toss gently to coat. Work the butter into the flour with the tips of your fingers until the mixture resembles rough cornmeal with pea-size bits of butter scattered throughout. Stir in the ham and cheese to evenly distribute.Whisk together the buttermilk and egg and add it to the butter-flour mixture; stir with a wooden spoon to distribute the moisture. Use your hands to gently bring the dough together, being careful not to overwork the dough.Drop 1/4-cup mounds of dough, spaced a few inches apart, onto the prepared pans. Bake until golden brown and the scones spring back when gently poked, 15 to 20 minutes.",
                "Trotter Tom Yum Soup: 1. Rinse trotters under running water. Place trotters in large saucepot pot and cover with water. Simmer until trotters are tender, about 2 1/2 hours, skimming off whatever meat scum rises to the top.2. Add lemongrass, galangal, kaffir lime leaves, and chilies and simmer for 30 minutes longer. Remove the aromatics from the pot and discard. Add sliced vegetables and simmer 5 minutes longer.3. Add chili paste (if desired), fish sauce, and lime juice, adding more or less according to taste. Serve with rice noodles and additional segments of lime.",
                "Yorkshire Pudding: Make the batter before removing the prime rib from the oven: Combine the eggs and half-and-half in a bowl and whisk until they're totally combined. Throw the flour and 2 teaspoons salt into a sifter and sift them straight into the bowl. Whisk until it's nice and smooth, then refrigerate until the prime rib is ready.After the beef is removed from the pan, increase the oven temperature to 450 degrees F. Use a slotted spoon to remove the peppercorns, herbs and excess salt from the drippings. Pour the remaining drippings into a separate container. They should be speckled and lovely!Pour a small amount (about 1/2 teaspoon or so) of the drippings into each cup of a standard muffin pan and place the pan in the hot oven for a couple of minutes, or until just before the drippings begin to smoke.Carefully remove the pan from the oven and immediately fill the muffin cups about 1/2 to 2/3 full. Bake 13 to 14 minutes, or until they've \"popped\" about as much as they can pop. Serve them in a basket with a pretty napkin right next to the prime rib.Move the oven rack to the bottom and preheat the oven to 500 degrees F, then start with the seasoning: Grab the peppercorns and throw them in a big plastic bag and pound them with a rolling pin to break them open. Pull the leaves off the rosemary and thyme sprigs. Throw the crushed peppercorns into a bowl with the salt and herb leaves and add the minced garlic. Use your fingers to toss it all together, then set it aside.Place the beef, fat-side up, on a rack in a roasting pan. Drizzle the olive oil all over the surface and rub it in with your hands. Sprinkle the peppercorn-herb-salt mixture all over the surface of the beef, pressing it lightly with your hands.Roast the beef 45 minutes for the first stage. Reduce the oven temperature to 300 degrees F and insert a meat thermometer sideways into the roast. Roast the beef an additional 1 hour 15 minutes to 1 hour 30 minutes, or until the thermometer registers 120 degrees F to 135 degrees F in the center for medium rare. (The meat will continue to cook for a bit after you remove it from the oven.)Remove the beef from the rack and let it rest about 15 minutes to allow the juices to redistribute throughout the meat. When you're ready to serve, carve it into slices of your preferred width.",
                "Danish Leaf Cake: Preheat the oven to 400 degrees F. Grease a 9-inch round cake pan with butter. Set aside.Using a stand mixer with a paddle attachment, cream the butter and sugar on high speed until fluffy, about 2 minutes. Then add the eggs one a time and mix just until fully combined. In a small bowl, whisk together the flour and baking powder. Add the flour mixture to the butter mixture and beat on low speed just until incorporated. Add the milk and almond extract and beat until smooth, 2 minutes more.Pour the batter into the prepared cake pan and bake until a toothpick inserted in the center comes out clean, about 30 minutes. Transfer the pan to a cooling rack and cool completely.For the ganache, place the chocolate in a heatproof bowl. Heat the heavy cream in a saucepan over medium-high heat just to scalding, about 3 minutes. Pour the heavy cream over the chocolate and stir until smooth and all the chocolate has melted. Let the ganache cool slightly so it is spreadable.Frost the top of the cake with the ganache evenly. Sprinkle the outer edges of the cake with sliced almonds and decorate with raspberries. Serve at room temperature.",
                "Rachel Allen's Potato, Leek, and Smoked Bacon Soup: 1. Heat the oil in a large saucepan over high heat, add the bacon, and sauté for about 1 minute, or until crisp and golden. Remove from the pan and drain on paper towels.2. Decrease the heat a little and add the butter to the oil in the pan. When it has melted, add the onion, leek, and potatoes. Season with salt and pepper and cook gently for 8 to 10 minutes without browning. Pour in the stock and simmer gently for 5 minutes, or until the potatoes are completely cooked through.3. Meanwhile, make the parsley pesto. Discard the stems from the parsley and put the leaves in a bowl with the garlic, pine nuts, Parmesan, and olive oil. Using a handheld blender, purée to a fairly smooth paste, adding a little more oil, if necessary, so that it is a thick but drizzling consistency. Alternatively, crush the parsley, garlic, and pine nuts using a mortar and pestle and stir in the Parmesan and olive oil. Season to taste with salt and pepper and set aside.4. Purée the soup until smooth in a blender or using a handheld blender. Return to the pan and stir in all but 1 tablespoon of the reserved bacon pieces. Check the seasoning, adjusting if necessary, and heat for a minute more before serving.5. Ladle the soup into warm bowls. Drizzle over the parsley pesto and scatter the remaining bacon pieces on top.",
                "Danish Meatball Burgers with Pickled Red Cabbage: Make the pickled cabbage: Combine the vinegar, sugar and 1 teaspoon salt in a medium saucepan. Add the cabbage and bring to a boil. Reduce the heat; simmer until the cabbage is brightly colored and tender, about 30 minutes. Remove from the heat; stir in the jam.Meanwhile, make the remoulade: Mix the mayonnaise, mustard, relish, capers, curry powder, turmeric and 1 teaspoon minced onion in a small bowl (reserve the remaining onion). Refrigerate until ready to use.Make the patties: Combine the beef, half-and-half, breadcrumbs, nutmeg, remaining minced onion, 1 teaspoon salt and 1/4 teaspoon pepper in a large bowl and combine with your hands. Form the mixture into six 3/4-inch-thick patties.Heat 1 tablespoon olive oil in a cast-iron skillet over high heat. Add 3 patties to the skillet; cook until browned, 4 minutes. Flip and cook until cooked through, about 5 more minutes. Top each burger with a slice of cheese; cover and cook until melted, 1 minute. Transfer to a plate and repeat with the remaining 1 tablespoon olive oil, burger patties and cheese. Spread the remoulade on the top buns. Sandwich with the burgers and pickled cabbage.",
                "Swiss Chard Lasagna with Ricotta and Mushroom : Bring milk and bay leaf to simmer in medium saucepan; remove from heat. Melt butter in heavy large saucepan over medium-low heat. Add flour and whisk to blend. Cook 2 minutes, whisking almost constantly (do not let roux brown). Gradually whisk milk with bay leaf into roux. Add 1/2 teaspoon coarse salt, nutmeg, and cloves and bring to simmer. Cook until sauce thickens enough to coat spoon, whisking often, about 3 minutes. Remove bay leaf. DO AHEAD: Béchamel sauce can be made 1 day ahead. Press plastic wrap directly onto surface and chill. Remove plastic and rewarm sauce before using, whisking to smooth.Blanch chard in large pot of boiling salted water 1 minute. Drain, pressing out all water, then chop coarsely. Heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add onion, half of garlic, and crushed red pepper. Sauté until onion is tender, 3 to 4 minutes. Mix in chard and season to taste with coarse salt and freshly ground black pepper.Heat remaining 2 tablespoons oil in heavy large nonstick skillet over medium- high heat. Add mushrooms and remaining garlic. Sauté until mushrooms are brown and tender, 7 to 8 minutes. Mix in nutmeg and season with coarse salt and pepper.Cook noodles in medium pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain; arrange noodles in single layer on sheet of plastic wrap.Brush 13 x 9 x 2-inch glass baking dish with oil to coat. Spread 3 tablespoons béchamel sauce thinly over bottom of dish. Arrange 3 noodles in dish to cover bottom (2 side by side lengthwise, then 1 crosswise). Spread half of chard mixture over pasta, then half of mushrooms. Drop half of ricotta over in dollops and spread in even layer. Sprinkle with half of Fontina, then 4 tablespoons Parmesan; spread 3/4 cup béchamel over. Repeat layering with 3 noodles, remaining chard, mushrooms, ricotta, Fontina, Parmesan, and 3/4 cup béchamel. Cover with 3 noodles and remaining béchamel. DO AHEAD: Can be made 2 hours ahead. Cover with foil. Let stand at room temperature.Preheat oven to 400°F. Bake lasagna covered 30 minutes. Uncover and bake until heated through and top is golden brown, 20 to 30 minutes longer. Let stand 15 minutes before serving.",
                "Cherry Custard Jalousie Pie: 1. For the custard filling: Place the cream and milk in a saucepan over medium heat and bring to a simmer. Place the egg yolks, sugar, vanilla extract and custard powder in a large bowl and whisk together until smooth.2. Pour the hot milk and cream over the egg mixture whisking continuously. Leave to cool.3. Preheat the oven to 200C/400f/gas 6. Place a baking sheet in the oven to preheat. Cut the puff pastry in half and roll one piece out on a lightly floured work surface until you have a rectangular sheet measuring 12 x 8 inches. Carefully place into a rectangular pan measuring 11 x 7 in and about 2 inches deep. Prick the base all over with a fork. Spread the cooled custard into the tin and then arrange the cherries on top.4. Roll out the remaining piece of pastry to a 12x6-inch rectangle. Brush the edges of the pastry with a little milk and then lay the other sheet of pastry over the top of the filling and press down gently to seal.5. Brush the top with more milk and sprinkle with the granulated sugar. Place the tin in the fridge to chill for 15 minutes.6. Before placing in the oven make incisions in the pastry with a sharp knife to reveal the filling. Place the pie on the preheated baking tray and bake for 10 minutes then reduce the temperature to 325°F/160°C and continue to bake for a further 45 minutes until the pastry is golden and cooked through.7. Leave to cool for 10 minutes before removing from the pan then serve warm or cold cut into squares.",
                "Goulash Soup : Pat beef dry. Heat oil in a large heavy pot over medium-high heat until it shimmers, then cook beef, stirring occasionally, until browned and beginning to exude liquid, 3 to 4 minutes. Add onions, garlic, caraway seeds, and marjoram and cook, stirring occasionally, until onions are translucent, about 5 minutes. Add flour and cook, stirring frequently, until mixture sticks to bottom of pot and is deep golden, about 10 minutes. Add tomato paste and cook, stirring, 1 minute, then stir in hot water and 1/2 teaspoon paprika. Bring to a boil, stirring occasionally, then simmer, partially covered, stirring occasionally, until meat breaks apart when pressed with a spoon, 1 1/2 to 2 hours. Chill, uncovered, until cool, then covered overnight (at least 8 hours).Remove solidified fat if desired, then bring soup to a simmer and remove from heat. Transfer meat with a slotted spoon to a bowl and coarsely shred with 2 forks. Return meat to soup and stir in ketchup, Worcestershire sauce, hot sauce, cayenne, sea salt, and remaining 1/2 teaspoon paprika and reheat over medium heat, stirring occasionally. Thin soup with water to desired consistency and season with salt and pepper.",
                "Twenty-Minute Chicken Liver Mousse From 'The Meat Hook Meat Book': 1. In a large sauté pan or cast-iron skillet, cook the onion slices in the olive oil (or chicken fat, if you have some lying around) over medium heat, stirring occasionally, until lightly golden, 5 to 7 minutes. Season with salt and pepper and cook until the onions are caramelized and brown, 3 to 5 minutes longer.2. Add 1 sprig each of the thyme, oregano, and rosemary and smash them in with the onions. Deglaze your pan with the port, using a wooden spoon to scrape up the good bits from the bottom of the pan. Cook until all the liquid has evaporated, about 5 minutes. Transfer the onions to a bowl, pulling out the herbs and discarding them, and let cool.3. Wipe out your pan with a paper towel and place over medium-high heat. Add your livers and sauté until browned on both sides but still medium-rare, about 2 minutes on each side. Add the remaining herb sprigs and deglaze the pan with the red wine, scraping up the bits on the bottom of the pan. Cook just until all the liquid has evaporated, about 5 minutes; don’t let the livers start to stick to the bottom of the pan. Transfer the livers to a plate or bowl to cool, discarding the herbs.4. Toss the cooled livers and onion into a blender (a food processor will also work, but a blender will yield a smoother texture) and turn it on. After the livers have been spinning for about a minute, slowly add the cream and cream cheese and blend to a puree. Taste for seasoning. The mousse should be slightly salty; if it’s not, add more salt 1/2 teaspoon at a time. You can add more black pepper too, if you wish.5. Pass the blended livers through a fine sieve and pour the mousse into the mold(s) of your choice and chill in the refrigerator for at least 30 minutes before serving. The mousse will keep, covered, in the refrigerator for 1 week."
            ]
        }
    ]
}
