{
    "intents": [
        {
            "tag": "hot",
            "patterns": [
                "Add Thyme for Whipped Potatoes: In a medium saucepan over medium-low heat, add the half-and-half, garlic, thyme, and butter and heat until the butter is melted. Allow to sit over very low heat to infuse the flavors and keep hot.In a large pot, add the potatoes, cover with water and generously season with salt. Bring to a boil over medium heat, and then reduce the heat and simmer until the potatoes are fork tender, about 15 to 20 minutes. Immediately drain the potatoes and put them through a food mill over a serving bowl. If you don't have a food mill, you can hand mash or use a hand mixer, but be sure to not over-whip if using an electric hand mixer or the potatoes will get gummy.Pour the hot infused half-and-half mixture through a fine mesh sieve into the potatoes. Stir with a wooden spoon to combine and season with a little salt and pepper. Taste and adjust seasoning, if needed. Eat and enjoy!TIPS:Serve the potatoes in a warm serving vessel to help keep them hot.Keep the butter wrapper to cover the top of the whipped potatoes, butter side down, to keep them moist if they are not being served immediately.",
                "Buffalo Wings: Place a 6-quart saucepan with a steamer basket and 1-inch of water in the bottom, over high heat, cover and bring to a boil.Remove the tips of the wings and discard or save for making stock. Using kitchen shears, or a knife, separate the wings at the joint. Place the wings into the steamer basket, cover, reduce the heat to medium and steam for 10 minutes. Remove the wings from the basket and carefully pat dry. Lay the wings out on a cooling rack set in a half sheet pan lined with paper towels and place in the refrigerator for 1 hour.Preheat the oven to 425 degrees F.Replace the paper towels with parchment paper. Roast on the middle rack of the oven for 20 minutes. Turn the wings over and cook another 20 minutes or until meat is cooked through and the skin is golden brown.While the chicken is roasting, melt the butter in a small bowl along with the garlic. Pour this along with hot sauce and salt into a bowl large enough to hold all of the chicken and stir to combine.Remove the wings from the oven and transfer to the bowl and toss with the sauce. Serve warm.",
                "15-Minute Chicken, Rice and Grape Salad: Put the frozen rice in a medium glass mixing bowl, and break it up using a fork. Drape a damp paper towel directly over the rice, and microwave until the rice is warmed through and softened, 2 to 3 minutes.Meanwhile, puree the yogurt, oil, lemon zest and juice, mayonnaise, shallots, garlic, 1 1/2 teaspoons salt and a few grinds of pepper in a small food processor or a blender until smooth. Toast the walnuts in a small skillet over medium heat until fragrant and just starting to brown, about 2 minutes.Combine the chicken, grapes, parsley and spinach in a large bowl, and toss with half the dressing. Add the warmed rice and toasted walnuts, toss again and serve with the remaining dressing.",
                "Root Vegetable Fries : Preheat the oven to 400°F. Cut the vegetables into 1⁄2\"-wide spears and toss in a roasting pan with olive oil and herbs to coat. Keep the peels on; that's where the vitamins are.Roast for approximately 40 minutes, turning regularly until all sides have turned a golden brown and the fries are cooked straight through.",
                "Pimento Cheese Twice Baked Potatoes: 1. Roast pepper over gas stove, grill, or broiler until skin is completely charred. Place in a bowl, cover with plastic wrap, and let sit until cool enough to handle, about 10 to 15 minutes. Remove the charred outer skin, cut in half and remove the seeds and core. Finely chop pepper.2. To bake potatoes in oven or grill: Preheat oven or grill to 400°F. Place potatoes directly on cooking rack and bake until a paring knife can be inserted into middle of potato with little to no resistance, about 60 minutes. Transfer to plate and let rest until cool enough to handle, about 10 minutes.3. To bake potatoes in microwave: Place potatoes on a microwave safe plate and microwave on high for 9 to 12 minutes, rotating potatoes every 3 minutes, until a paring knife can be inserted into middle of potato with little to no resistance. Remove from microwave let and rest until cool enough to handle, about 10 minutes.4. Slice tops off potatoes lengthwise. Using a spoon or mellonballer, scoop out flesh into a medium bowl, leaving about 1/4-inch of flesh remaining in potato.5. Add all but 1/2 cup of cheese into bowl with potato flesh along with roasted pepper, sour cream, 3 tablespoons melted butter, paprika, and cayenne. Mash ingredients together until mixture is cohesive.6. Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Brush potatoes all over with remaining butter and season with salt and pepper to taste. Place on cool side of grill, cover, and cook until potato skins start to brown around the edges and slightly crisp, about 10 minutes.7. Remove potatoes from grill. Spoon filling into potatoes and top with remaining cheese. Place potatoes back on the cool side of the grill, cover, and cook until cheese has melted, about 10 minutes. Remove from grill, let cool for 5 minutes, garnish with chives, then serve immediately.",
                "Garlic Fried Rice: 1. In a small saucepan, heat oil over medium heat until shimmering. Add garlic and cook, stirring constantly, until garlic softens, becomes very aromatic, and turns lightly golden, 30 seconds to 1 minute. Strain oil through a fine-mesh strainer directly into a wok; reserve cooked garlic and set aside.2. Heat wok over high heat until oil is shimmering. Add rice, breaking up larger clumps with a spatula and tossing to coat with garlic-flavored oil. Cook, stirring and tossing frequently, until no clumps of rice remain and rice is warmed through, about 4 minutes. Add reserved garlic to rice and toss to combine. Serve immediately.",
                "Over-the-Top Creamed Brussels Sprout Gratin: 1. Heat butter and bacon over medium-high heat in a large straight-sided sauté pan or Dutch oven. Cook, stirring frequently, until well browned, about 8 minutes. Add Brussels sprouts and cook, stirring, until lightly browned, about 4 minutes. Add shallots and cook, stirring, until softened and fragrant, about 1 minute. Add heavy cream and scrape up any browned bits from the bottom of the pan.2. Adjust heat to maintain a bare simmer. Cook, stirring frequently, until cream has reduced by about half and has a consistency that coats each sprout, about 20 minutes. Season to taste with salt and pepper. Transfer mixture to a casserole pan and cover with shredded cheese (for make-ahead instructions, see note).3. Adjust oven rack to center position and preheat oven to 425°F. Transfer casserole to oven and bake uncovered until bubbly around the edges and cheese is melted and spotted brown, about 20 minutes. Serve immediately.",
                "Jerk Tofu Wrapped in Collard Leaves : Combine all the ingredients except the salt in a food processor, add ¼ cup water, and puree until well combined. Season with salt to taste. Store in an airtight container in the refrigerator until ready to use, up to 1 week.In a medium skillet, warm the olive oil over low heat. Add the garlic and cook, stirring occasionally, until crispy and golden brown, 8 to 10 minutes. Strain the oil through fine-mesh sieve into a bowl, reserving the garlic chips. Use immediately or store in separate airtight containers in the refrigerator for up to 1 week.In a small skillet, combine the garlic, olive oil, coriander, and salt. Bring to a simmer over medium heat and cook just until the garlic is fragrant, about 1 ½ minutes. Remove from the heat and let cool.Transfer the oil mixture to a blender. Add the cilantro, lemon juice, jalapeño, and ¼ cup water and blend until smooth. If necessary, season with additional salt to taste. Use immediately or store in an airtight container in the refrigerator for up to 1 week.First, press your tofu. This procedure extracts excess water, makes the block more uniformly firm, and allows the tofu to absorb the marinade more easily. Just wrap the block of tofu in a clean kitchen towel (or paper towels), place it in a large bowl or a clean kitchen sink, and sit something heavy on top of it (like a 28-ounce can of tomatoes) for 20 minutes, turning the block over after 15 minutes.Place one block of the tofu on a cutting board. Cut it in half horizontally, then cut vertically down the center to yield four pieces. Repeat with the second block of tofu.Pour the marinade into a large baking dish, adding just enough water to ensure that it is runny, if necessary. Place the tofu in the marinade in one even layer. Cover and refrigerate for 8 hours or overnight, flipping the tofu every 30 minutes for the first 2 hours. Remove the tofu from the marinade, scrape off any excess, and transfer to a large plate. Strain the marinade through a fine-mesh sieve and set aside.In a large pot, bring 2 quarts water to a boil over high heat. Add 1 tablespoon of the salt. Blanch the collard leaves, one at a time, for 30 seconds each, then lay them flat on clean kitchen towels to dry.Combine the arrowroot and the remaining 2 tea¬spoons salt in a pie plate. Mix well. Coat each side of the tofu pieces with the arrowroot, shake off any excess arrowroot, and transfer them to a second large plate.Lightly coat the bottom of a large cast-iron skillet with peanut oil and heat over medium-high heat until shimmering. Add half the tofu and fry until golden brown, 2 to 3 minutes. Gently flip each piece with a spatula and fry until golden brown on the second side. Lightly sprinkle both sides of the tofu with salt and transfer to a rack. Repeat to fry the remaining tofu. Wipe the skillet clean.On a clean work surface, arrange two collard leaves lengthwise, overlapping each other by an inch or so, and place one piece of tofu in the center of the leaves. Smear 2 heaping tablespoons of the reserved marinade on top of the tofu, sprinkle a heaping teaspoon of garlic chips on top of the tofu, then fold the leaves around the tofu to create a packet. Repeat with the remaining collard leaves and tofu.In the same skillet, warm 2 tablespoons peanut oil over medium-high heat, tilting the pan to coat it evenly with the oil. Place the packets in the skillet, folded-side up, and cook for about 1 minute. Gently flip each packet with a spatula, cover the skillet with a lid or some aluminum foil, and cook for about 5 minutes to warm through.To serve, spread some cilantro sauce over four plates and place two of the tofu packets on each plate. Garnish with cilantro leaves and peanuts and serve.",
                "Eggplant Rollatini: Preheat the grill pan and preheat the oven to 375 degrees F.Place a rack over a large baking sheet. Cut the 2 ends off the eggplant. Cut the eggplants lengthwise, into 1/2-inch thick slices. Arrange eggplant slices onto rack. Sprinkle with sea salt to help remove excess moisture and any bitterness from the eggplants. Set aside for about 10 to 15 minutes. Rinse off the salt from the eggplants and pat dry with a towel. Spray hot grill pan liberally with vegetable spray and then place eggplant slices on the grill until lightly browned on each side and tender, about 4 minutes per side. Remove slices from the grill pan and allow to cool.In a large bowl, beat eggs until lightly scrambled. Mix the ricotta in with the egg. Add mozzarella, 3 tablespoons of Parmesan cheese and toasted pine nuts and gently combine. Fold in basil just to combine. Do not overmix.Place a tablespoon of the cheese mixture on 1 end of the eggplant and roll up tightly. Place the eggplant rollatini into a greased (with olive oil) 13 by 9-inch baking dish, seam side down. Continue with remaining eggplant. Evenly distribute the tomato sauce on top of the eggplant rollatini. Season with salt and pepper. Sprinkle with remaining 5 tablespoons of Parmesan cheese and bake for 15 minutes. When cooked, drizzle the top with extra-virgin olive oil.In a large casserole pot, heat oil over medium high heat. Add onion and garlic and saute until soft and translucent, about 5 to 10 minutes. Add celery and carrots and season with salt and pepper. Saute until all the vegetables are soft, about 5 to 10 minutes. Add tomatoes and bay leaves and simmer uncovered on low heat for 1 hour or until thick. Remove bay leaves and check for seasoning. If sauce still tastes acidic, add unsalted butter, 1 tablespoon at a time to round out the flavors.Add 1/2 the tomato sauce into the bowl of a food processor. Process until smooth. Continue with remaining tomato sauce.If not using all the sauce, allow it to cool completely and pour 1 to 2 cup portions into freezer plastic bags. This will freeze up to 6 months.",
                "Salmon Cannelloni with Lemon Cream Sauce : Blend together eggs, water, flour, and salt in a blender until smooth. Transfer to a bowl and stir in tarragon.Lightly brush a 10-inch nonstick skillet with melted butter and heat over moderate heat until hot but not smoking. Ladle about 1/4 cup batter into skillet, tilting and rotating skillet to coat bottom, then pour excess batter back into bowl. (If batter sets before skillet is coated, reduce heat slightly for next crespella.) Cook until just set and underside is lightly browned, about 30 seconds, then invert crespella onto a clean kitchen towel in one layer to cool. (It will be cooked on one side only.) Make 5 more crespelle with remaining batter in same manner, brushing skillet with butter as needed and transferring to towel as cooked, arranging them in one layer.Heat butter in a 1- to 2-quart heavy saucepan over moderately low heat until foam subsides. Add flour and cook, whisking, 2 minutes. Add clam juice and water in a slow stream, whisking, then bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, 5 minutes. Stir in cream, zest, and pepper, then remove from heat.Put oven rack in middle position and preheat oven to 425°F. Butter a 13- by 9-inch or other 3-quart glass or ceramic baking dish and spread half of sauce in dish.Stir together butter (2 tablespoons), shallot, salt, and pepper and spread 1 teaspoon on top of each fillet.Put 1 crespella, pale side down, on a work surface, then place 1 salmon fillet, buttered side down, in center of crespella and fold crespella around salmon, leaving ends open. Transfer to baking dish, arranging, seam side down, in sauce. Make 5 more cannelloni with remaining salmon and crespelle in same manner, arranging in baking dish. Spoon remaining sauce over cannelloni.Bake until salmon is just cooked through and sauce is bubbling, 15 to 20 minutes.",
                "Easy Peach Turnovers: 1. Adjust oven racks to upper and lower middle positions. Preheat oven to 375°F. Line two baking sheets with parchment paper. In a medium bowl, combine diced peaches, brown sugar, 2 teaspoons sugar, tapioca, salt, cinnamon, and lemon juice. Let stand 10 minutes.2. Unfold puff pastry sheets onto a clean work surface. Cut each sheet of pastry into four rectangles.3. Top one half of each rectangle with peach filling. Fold the pastry over the filling to form a triangle, pressing out excess air. Use your fingers or a fork to press and seal the pastry together. Repeat with remaining squares. Brush each turnover with egg wash and then sprinkle with remaining sugar. Use a knife to make three 1 inch slits on the top of each pastry. Bake turnovers until golden, about 15 minutes. Serve warm.",
                "Dinner Tonight: Pea Shoots with Shrimp, Bacon, and Chives: 1. Fill heavy-bottomed saucepan halfway with water, and bring to a boil. Add shrimp and cook until shrimp turn pink, one to two minutes. Drain in colander, and transfer to medium-sized bowl filled with ice water. Let sit until cold, about five minutes. Drain shrimp, peel, and then set aside.2. Clean out saucepan and return to stove. Add bacon and turn heat to medium-high. Cook, stirring often, until bacon is crisp, 8 to 10 minutes. Remove bacon with slotted spoon, and drain on paper towels.3. Add shallots to saucepan with bacon fat. Cook, stirring often, until shallots are soft, 1 to 2 minutes. Whisk in vinegar, mustard, sugar, salt, and black pepper. Cook until hot, about 30 seconds. Turn off heat, add pea shoots, and toss until wilted.4. Divide pea shoots between four plates, and top with shrimp. Sprinkle with bacon, chives, and tarragon.",
                "Citrus-Pomegranate Relish : Cook sugar undisturbed in a dry medium saucepan over medium-high until a ring around the edges is melted, about 5 minutes. Using a heatproof spatula, pull melted sugar in toward the center of saucepan. Continue to cook, pulling melted sugar into the center and reducing heat if sugar begins to smoke, until all sugar is melted and a deep caramel color, 6–8 minutes. Remove from heat and carefully add vinegar (it will spatter and caramel will seize). Cook sauce over medium heat, stirring, until caramel dissolves; season generously with salt and pepper. If sauce tastes too tart, add more salt a pinch at a time to balance out. Let cool.Slice off ends from oranges; set on ends and remove skins and white pith. Slice oranges crosswise into 1/4\"-thick rounds. Place in a large bowl; add pomegranate seeds and sauce and toss to coat.Relish can be made 1 week ahead. Cover and chill. Let sit at room temperature 2 hours before serving.",
                "Butter-Roasted Halibut with Asparagus and Olives: Preheat oven to 325°. Thinly slice one-quarter of asparagus into coins and place in a medium bowl; set aside.Heat butter and 2 Tbsp. oil in a small saucepan over medium. As soon as butter is melted, add Aleppo-style pepper and remove from heat.Season fish with salt and black pepper on both sides and place on a rimmed baking sheet. Scatter ramps and remaining asparagus around fish; season with salt and black pepper. Pour butter mixture over fish and vegetables. Give vegetables a toss to evenly coat. Roast, undisturbed, until fish is just opaque in the center and asparagus is bright green and tender, 15–25 minutes, depending on the thickness of your fillets.Toss olives, chives, lemon juice, 2 Tbsp. tarragon, and remaining 5 Tbsp. oil with reserved asparagus; season with salt and black pepper.Transfer fish to a platter; top with ramps and asparagus. Spoon some olive mixture over, then scatter tarragon leaves over. Serve with potatoes, lemon wedges, and remaining olive mixture alongside.",
                "Cheeseburger with Garlic Mayo: Add the garlic cloves and oil to a small saucepot and place over medium-high heat. Cook until the garlic is golden brown and soft, 10 to 15 minutes. Remove the garlic from the oil, reserving the oil.Place the garlic cloves into a mini food processor with the mayo and 1 teaspoon salt. Puree until smooth. Transfer to a small bowl.Use a wide-mouth Mason jar lid to form the ground beef into six patties, about 5.5 ounces each.Heat a large cast-iron skillet over high heat.Brush the patties on one side with garlic oil, and season with salt and 1/4 teaspoon black pepper.Place the patties, brushed-side down, in the hot skillet and cook until well browned, 5 minutes. Brush the other side of the patties with garlic oil and season with more salt and pepper. Flip the patties, and cook until well browned and firm to the touch, another 3 to 5 minutes; place a slice of Cheddar on each burger during the last minute to melt.Spread the brioche buns with softened butter and brown them in a large saute pan.Spread the toasted buns with some garlic mayo, add a burger patty and top with a tomato slice, lettuce and pickles. Serve immediately.",
                "Loaded Potato Skin Dip: Cook the bacon in a medium skillet set over medium heat until crispy, about 8 minutes. Transfer the bacon to paper towels to drain. Add 2/3 cup of the oil and the garlic to the skillet with the bacon drippings. Reduce the heat to medium-low and cook, stirring occasionally, until the garlic is golden, about 7 minutes. Remove from the heat and set aside to cool.Meanwhile, preheat the oven to 375 degrees F. Peel the potatoes and slice the potato skins into very thin strips (the thinner your cut the strips the crispier they will be). Toss the strips with 1/4 teaspoon salt, some pepper and the remaining 1 tablespoon oil. Spread in an even layer and bake on an ungreased rimmed baking sheet, stirring once, until golden and crispy, about 15 minutes.Cut the peeled potatoes into 1-inch chunks and put in a saucepan. Cover with cold water by about 2 inches and add a generous pinch of salt. Bring to a boil over high heat; reduce the heat and simmer until the potatoes are tender, 15 to 20 minutes. Drain and allow to cool slightly. Pass the potatoes through a ricer into a medium bowl or mash with a potato masher until smooth.Pour the oil and garlic mixture into the bowl of a food processor and puree. Add the potatoes, vinegar, 1/3 cup water, 1/2 teaspoon salt and pepper to taste and pulse until just creamy and combined; do not over process or the potatoes will become gluey. Add up to 3 tablespoons more water if necessary so that the dip is soft and spreadable. Season with additional salt and pepper.Transfer the dip to a shallow serving bowl. Crumble the bacon and sprinkle it over the dip along with the crispy potato skins and scallions. Top with sour cream and serve warm or at room temperature with potato chips and cut up vegetables for dipping.",
                "Grilled Butternut Squash With Fresh Ricotta, Pine Nuts, and Sage: 1. Place pine nuts in a cast iron skillet over medium-high heat. Toast until fragrant and lightly browned. Transfer pine nuts to a small bowl and set aside.2. Place squash in a medium bowl and toss with olive oil. Season with salt and pepper to taste.3. Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil the grilling grate. Place squash on cool side of grill, close to, but not directly over, the coals. Cover and cook until tender all the way through, about 30 minutes, flipping squash after 15 minutes for even cooking. Move squash to hot side of grill and cook until lightly charred on all sides, about 1 minutes per side. Transfer to a serving platter.4. Top squash with dollops of fresh ricotta, pine nuts, and sage. Season with additional salt and pepper to taste; serve immediately.",
                "Silken Tofu with Soy Sauce and Chili Oil: 1. Bring a pot of water to boil. Gently add the block of silken tofu to the water and simmer until the tofu is warmed through, 3 to 5 minutes. Drain the tofu.2. Scooping up rough slabs of the block with a spoon, divide the tofu evenly between 2 bowls, or among 4 if you are serving as an appetizer. Drizzle each portion of tofu with 1 teaspoon soy sauce, 1/2 teaspoon chili oil, and 1/4 teaspoon sesame oil. Top with minced zha cai, scallions, and cilantro. Serve immediately.",
                "Squash and Red Pepper Pilaf : Cook squash, bell pepper, onion, and bay leaf in oil with 1 teaspoon salt and 1/4 teaspoon pepper in a 12-inch heavy skillet over medium heat, stirring occasionally, until vegetables begin to brown, 8 to 10 minutes.Add rice and stir until well coated, then add water and bring to a vigorous boil. Reduce heat to low and cook, tightly covered with lid, until vegetables and rice are tender and liquid is absorbed, about 20 minutes. Remove from heat and let stand, covered, 10 minutes. Season with salt and pepper and sprinkle with seeds.",
                "Best-Ever Grilled Cheese: Place bread on a cutting board and spread mayonnaise over top side of each; this is key to a golden, delectable crunch. Heat a small skillet (nonstick, ideally) over medium. Slide in half of butter. When it melts, place 1 slice of bread, mayonnaise side down, in skillet; top with cheese; season with pepper. Top with second slice of bread, mayonnaise side up. When underside is golden brown, about 4 minutes, turn sandwich and add remaining butter to skillet. Press down on sandwich to encourage even browning and to help melt cheese—be gentle, don’t smash it. Cook until second side is golden brown and cheese is melted. Eat immediately, preferably with soup.",
                "Quick Chopped Barbecue: Combine barbecue sauce, beef broth, brown sugar, mustard, cinnamon and tomato puree and add shredded pork or ham. Slowly, over very low heat simmer for 10 to 15 minutes, uncovered until meat is warmed through and sauce has thickened but is still of spoonable consistency. Season to taste with salt and Tabasco sauce and spoon over buns. Serve with salad.",
                "Light Baked Spaghetti: Bring a large pot of salted water to a boil. Add the pasta and cook according to the package directions; drain. Meanwhile, heat the olive oil in a large nonstick skillet over medium-high heat. Add the onion and cook, stirring frequently, until soft, about 5 minutes. Stir in the garlic and cook 2 minutes. Add the sausage and cook, breaking up the meat with a wooden spoon, until browned, about 5 minutes. Stir in the bell peppers, mushrooms, seasoned salt and Italian seasoning and cook, stirring frequently, until the vegetables are soft, about 4 minutes. Stir in the tomatoes, 3/4 cup water and the basil and bring to a boil. Reduce the heat to medium low and simmer until the sauce thickens slightly and the flavors are blended, about 15 minutes. Preheat the oven to 375 degrees F. Spray a 2-quart casserole dish with cooking spray. Add the pasta to the skillet and toss to combine with the sauce. Spoon half of the pasta mixture into the casserole dish. Sprinkle with half of each cheese. Spoon the remaining pasta mixture on top. Sprinkle with the remaining cheese and cover loosely with foil sprayed with cooking spray (do not let the foil touch the cheese). Bake until the cheese is melted and bubbly, 20 to 25 minutes. Let stand 5 minutes before serving.",
                "Branzino Al Cartoccio From 'Downtown Italian': 1. To cook the fregola, bring a large pot of water to a boil. Season generously with salt. Taste the water and make sure that it tastes salty. Boil the fregola, stirring occasionally, until al dente, 8 to 10 minutes, depending on the size of the fregola. Drain thoroughly.2. Place the cooked fregola in a medium bowl and toss with 1 1/2 tablespoons of the olive oil. Add the tomatoes, scallion, lemon juice, chili, olives, lemon zest, and the 1/2 teaspoon salt. Toss together and set aside.3. Preheat the oven to 400°F. Season the fish fillets generously on both sides with salt and pepper. Arrange 4 pieces of parchment paper, each 12 inches by 17 inches, on a work surface. Fold each piece of parchment paper in half so that the sheets are approximately 12 inches by 8 1/2 inches.4. Open the parchment paper like a book and spoon one-quarter of the fregola salad onto one-half of each piece of parchment paper.5. Lay the fish fillets on top of the fregola, skin side up. Drizzle 1 1/2 teaspoons of olive oil over each piece of fish. Place one thyme sprig atop each fillet. Fold the parchment paper over the fish fillets to close the book. Starting at the short side of each book, roll or crimp the edges of the parchment to create a tightly sealed packet (it will look like a half-moon when you’re done). Place 2 fish packets on each of 2 baking sheets, leaving a little space between the packets.6. Bake the fish packets for 15 minutes. Serve each packet, parchment paper and all, on a plate with a wedge of lemon. Let guests open their own packets by puncturing the top half of the parchment paper with a knife and fork, and drizzling the fish with freshly squeezed lemon juice.",
                "Rolled cassata: Method Preheat the oven to 180°C/350ºF/gas 4. For the sponge, whisk the eggs and sugar with an electric mixer, or by hand, until pale, fluffy and at least doubled in size. Sift in the flour, add the vanilla paste, then slowly fold through. Grease a baking tray (26cm x 36cm) with butter, then line it with greaseproof paper and grease that, too. Spoon the batter into the tray and bake for 12 to 15 minutes, or until cooked through. Meanwhile, blitz the pistachios in a food processor until fine. Break in the marzipan and blitz until it forms a dough, adding a splash of water to combine, if needed. Take the sponge out of the oven and confidently flip it out on to a clean tea towel. Peel off the greaseproof, place it back on top, then roll up while the sponge is still warm and flexible. Leave to cool for around 20 minutes. For the filling, whiz the ricotta with the sugar in a food processor until smooth. Toast the hazelnuts in a frying pan until golden, then finely chop with the glacé fruit, pistachios and chocolate. Mix into the ricotta. Roll out most of the marzipan on a large sheet of greaseproof paper to 26cm x 46cm, and 2mm thick. Spread over the jam, unroll the sponge on top, drizzle over the Vin Santo and spread over the ricotta. Line up the cherries along the side nearest you, then, using the paper to help you, roll it up, pressing lightly to seal. Trim the ends, then roll out the remaining marzipan and stamp out shapes to decorate the top. Serve it after 30 minutes’ chilling in the fridge, or freeze for another day. If frozen, defrost in the fridge for 3 hours before serving. Dust with icing sugar to finish.",
                "Tom Colicchio's Herb-Butter Turkey from 'The Epicurious Cookbook': 1. Make Gravy Base: Melt the butter in a heavy large deep skillet over high heat. Add the turkey necks and/or wings and sauté until deep brown, about 15 minutes. Add the onions, carrots, and celery and sauté until vegetables are deep brown, about 15 minutes. Add the 6 cups chicken broth and bring to boil. Reduce the heat to medium-low and simmer uncovered 45 minutes, stirring occasionally.2. Pour the gravy base through a strainer set over a 4-cup measuring cup, pressing on the solids to extract liquid. If necessary, add enough more chicken broth to gravy base to measure 4 cups.3. Make Turkey: Mix 1/2 cup butter and all the minced herbs in a small bowl; season the herb butter with salt and pepper. Transfer 2 generous tablespoons to another small bowl and reserve for gravy; let stand at room temperature.4. Set a rack at lowest position in the oven and preheat the oven to 425°F. Rinse the turkey inside and out; pat dry. Starting at the neck end, slide your hand between the skin and the breast meat to loosen the skin. Rub 4 tablespoons of herb butter over the breast meat under the skin. Place the turkey on a rack set into a large roasting pan. Sprinkle the main cavity generously with salt and pepper. Place 4 tablespoons of plain butter and all the herb sprigs in the main cavity. Tuck the wing tips under. Tie the legs together loosely. Rub the 2 tablespoons remaining herb butter over the outside of the turkey. Sprinkle the turkey generously with salt and pepper.5. Place the turkey in the oven and roast 20 minutes. Reduce the oven temperature to 350°F. Roast 30 minutes more, then pour 1 cup broth over and add 1 tablespoon plain butter to the roasting pan. Roast 30 minutes more; baste with pan juices, then pour another 1 cup broth over and add another 1 tablespoon butter to pan. Cover the turkey loosely with foil. Roast until a thermometer inserted into thickest part of the thigh registers 175°F, basting with pan juices and adding 1 cup broth and 1 tablespoon butter to pan every 45 minutes, about 1 hour 45 minutes longer. Transfer the turkey to a platter; let stand 30 minutes (internal temperature will rise 5 to 10 degrees).6. Strain the pan juices into a bowl; whisk in the gravy base. Melt the reserved 2 tablespoons herb butter in a heavy large saucepan over medium heat; add the flour and whisk constantly until the roux is golden brown, about 6 minutes. Gradually add the pan juice-gravy base mixture; increase the heat and whisk constantly until gravy thickens, boils, and is smooth. Reduce the heat to medium; boil gently until gravy is reduced to 4 1/2 cups, whisking often, about 10 minutes. Season the gravy with salt and pepper and serve with the turkey.7. Do Ahead: Gravy base can be prepared 2 days ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled. Rewarm before using.",
                "Cheeseburger Fried Rice: For the awesome sauce: Add egg yolks and pickle relish to a food processor and pulse until incorporated. Add your garlic and mushroom seasoning and pulse again.Now, go for it: Slowly drizzle your oil into the mix while all the flavors are spinning around and mingling (like you did at last year's holiday party). Don't go too fast though! The sauce may break, and there's no return from that. Be gentle. But make it thick. Thick is good. Transfer to a mixing bowl and fold together all of that mayo goodness with your ketchup.You're done! Make the fried rice now, and everything will be okay. (See Cook's Note.)For the cheeseburger fried rice: Add oil and onions to a hot wok and cook until golden brown and delicious. Add cooked bacon and browned ground beef. Bring some of the reserved bacon fat into the wok and add the jasmine rice.With an aggressive approach, mix, stir, rake, swirl, toss... whatever it takes to bring that rice back to life. Make sure every grain has been given some bacon-fat lovin' and nothing is sticking to the wok, until the rice has been fried and is completely alive again. Show it some respect by seasoning with mushroom seasoning and sugar. Not too much? but not too little. Taste this beautiful creation. It is delicious. If desired, add more mushroom seasoning. Toss in lettuce and tomatoes and mix just until incorporated; not wilted but not raw.For the garnish: Build this beauty like you would any other cheeseburger. Smother with nacho cheese, 3 ounces awesome sauce and mustard. Sprinkle some sesame seeds over the top (what's a burger bun without sesame seeds?) and last, but very certainly not least, the pickle chips. ENJOY.",
                "Middle Eastern Turkey Patties: Preheat the broiler. Process 2 pita quarters in a food processor to make coarse crumbs. Add the red onion and pulse until finely chopped. Add the turkey, spinach, ras el hanout, 1 teaspoon salt and a few grinds of pepper; pulse until combined. Form the mixture into twelve 4-inch-long, 1/2-inch-thick oval patties on a baking sheet. Brush the patties with 1 tablespoon olive oil; season with salt and pepper. Broil until lightly golden and cooked through, about 6 minutes.Meanwhile, crush the coriander seeds with the flat side of a knife. Heat a large nonstick skillet over medium-high heat; add the remaining 2 tablespoons olive oil. Add the carrots and coriander and cook, stirring occasionally, until the carrots are tender, 7 to 9 minutes. Remove from the heat and stir in the cilantro and orange juice; season with salt and pepper.Divide the turkey patties, carrots and the remaining pita quarters among plates. Top the patties with the yogurt and sprinkle the dish with more cilantro.",
                "Crispy Pork and Cabbage Egg Rolls: 1. Heat oil in a wok or large skillet over high heat until smoking. Add carrot, cabbage, and mushrooms and cook, tossing and stirring frequently, until vegetables are softened but not browned, about 3 minutes. Add Shaoxing wine, soy sauce, and sugar, and toss to coat. Continue cooking until most of the liquid has evaporated and the vegetables begin to sizzle, about 2 minutes longer. Season to taste, then transfer to paper towel-lined rimmed baking sheet to cool. Once cool, transfer to large bowl and toss with pork.2. Lay one wrapper down with a corner pointed towards you. Add about 3 tablespoons of filling to the lower third of the wrapper, keeping it in a nice, tight row. Roll from the bottom corner towards the top, keeping everything nice and tight. Roll until nearly half way up, then stop.3. The next step is to fold the left and right corners towards the center. Start by first pressing in on the edges of the filling with your fingertips to make sure it's packed nice and tight. Fold the corners towards the center, again keeping everything tight. Moistening the edges of the wrapper with a bit of water will help it stick to itself and keep its shape.You want the bottom edge to form a 90° angle with the new edge you've just created by folding over the corner.4. After both corners have been folded in, continue rolling towards the top of the paper. Moisten the top corner of the wrapper with a bit of water and continue rolling until the entire package is sealed. Repeat with remaining rolls until all the filling is used up. Finished rolls can be frozen for up to 3 months in a sealed container. If freezing, fry directly from the freezer, adding 1 minute to cook time.5. Heat oil in a large wok or Dutch oven to 350°F as registered on an instant read thermometer. Add 4 to 6 rolls and cook, agitating occasionally with a wire mesh spider, until golden brown and crisp, about 5 minutes. Drain on paper towels and serve immediately with plum sauce or duck sauce. Repeat with remaining egg rolls.",
                "\"On a Shoestring\" Shoestring Potatoes with Honey Mustard Dressing: Heat the oil in a large deep heavy bottomed pan over medium heat to 375 degrees F.Peel potatoes and, using a mandoline, carefully cut into 1/8-inch thick julienne-style potatoes. Fry potatoes in small batches making sure to return the oil to correct temperature between each batch.Remove the potatoes from the oil and drain on paper towels. When all the potatoes have been fried, place in a serving bowl and season with salt, pepper and paprika.Mix together the mustard, honey and mayonnaise in a small bowl and drizzle over the potatoes.",
                "Abalone Victoria: Mix together parsley and bread crumbs. In a separate bowl, combine egg yolk, clarified butter and lemon juice. Place flour on a dish for dredging.Season 1 side of abalone steaks with salt and pepper. Lightly flour and paint with egg mixture. Coat with parsley/bread crumb mixture.Melt butter in frying pan. When butter begins to foam, add steaks and cook 1 minute each side. Add sherry and flame. Transfer to a serving dish and nap with browned butter from pan.",
                "Bubble & squeak hamburgers: Method Peel and slice the onion, then place in a small bowl. Cover with the vinegar and set aside.Mash all the veg well with a potato masher, then shred add the ham and season generously. Mix together well, then shape into 4 burgers and chill in the fridge to firm up, until ready to use.Heat the butter and oil in a large frying pan over a medium heat and cook the burgers, in batches if needed, for 3 to 5 minutes each side or until crisping up and turning golden brown.To serve, slice the muffins or burger rolls in half and fill with the bubble and squeak hamburgers, pickled red onion, lettuce and ketchup, if desired.",
                "Baked Ziti With Two Mozzarellas and Parmesan Cream Sauce: 1. Preheat oven to 400°F and position rack in center. Boil pasta in a medium pot of salted boiling water until about halfway cooked (about 6 1/2 minutes for pasta that will be al dente in 9 minutes). Reserve 1/2 cup pasta-cooking water, then drain pasta.2. In a large mixing bowl, combine pasta with 2 1/2 cups tomato sauce, reserved 1/2 cup pasta-cooking water, low-moisture mozzarella, and 1 cup fresh mozzarella. Season with salt and pepper and stir to combine.3. Scrape into baking dish and press into an even layer.4. Drizzle remaining 1 1/2 cups tomato sauce all over top of pasta.5. Scatter remaining 1 cup mozzarella all over, cover with aluminum foil, and bake for 30 minutes.6. Meanwhile, in a medium saucepan, gently simmer cream over medium-low heat, stirring frequently, until reduced to 1 1/2 cups, about 20 minutes. Sprinkle in Parmigiano-Reggiano into cream and whisk until completely melted and sauce is smooth. Season with salt. Keep warm.7. Increase oven to 450°F, uncover baked ziti, and cook until just starting to brown on top, about 10 minutes. Let stand for 10 minutes. Top with basil leaves, spoon onto plates, and drizzle with Parmesan cream. Serve immediately.",
                "Prawn Patia (Indian Sweet and Spicy Shrimp): 1. Heat oil in a large skillet over medium-high heat until shimmering. Gently put in the curry leaves and step aside as they pop. Stir for 20 seconds. Add the chopped onions and stir until lightly browned, about 5 minutes. Add the green chillies and stir for another minute. Add the tomato puree and keep stirring until oil separates from the onion tomato mix, about 5 minutes. Add the ginger-garlic past, red chilli, turmeric, and cumin, and keep stirring until mixture is fragrant, about 5 minutes, taking care to ensure the mixture doesn't stick to the bottom.2. Add the sugar/grated jaggery, vinegar, and water and cook till the rawness of the tomato is gone, about 5 minutes. Season to taste with salt. Add the shrmp, stir and let cook for one minute. Remove from heat. Allow to continue cooking off heat, stirring occasionally, until shrimp are cooked through, about 4 minutes longer. Garnish with coriander and serve with white rice and daal.",
                "Lamb Curry: Cut meat, as uniformly as possible, into 2 by 3 inch cubes. Generously sprinkle with salt and pepper.Heat oil in a large Dutch oven over high heat. Cook meat until golden brown on all sides, then reserve on a platter. In same pot, cook onions, stirring occasionally, until golden. Reduce heat to medium, add garlic and all dry spices, and cook about 3 minutes, stirring occasionally. Return meat to pan and pour in lamb stock. Bring to a boil, reduce to a simmer, and cook, uncovered, 1 hour 15 minutes. Occasionally skim and discard fat that rises to the top.Ladle warm stew over a bed of basmati rice and serve with Orange Dal with Ginger and Garlic. Garnish with yogurt and Fried Onions. Serve immediately.",
                "Sierra Madre Sunrise: 1. Fill cocktail shaker with ice. Add mezcal, Aperol, lemon juice, and bitters. Shake until well chilled, about 15 seconds. Fill a rocks glass with fresh ice. Add club soda to glass and strain cocktail on top. Garnish with lemon peel.",
                "Waffle Iron \"Fried\" Cheese (Queso Frito): 1. Preheat waffle iron. (Set it to medium if it has temperature controls.)2. On a plate, mix flour with paprika or cayenne. Place eggs in a second plate or bowl and bread crumbs in a third. Working one slice at a time, coat cheese in flour, then egg, then breadcrumbs.3. Spray both sides of waffle iron with nonstick spray, place as many cheese slices as will fit in waffle iron, and close lid. Cook until bread crumbs turn golden brown, about 1 minute. Repeat with any remaining cheese.4. Serve hot on its own or with salsa for dipping.",
                "Sicilian Eggplant and Pine Nut Caponata: 1. Toss pine nuts with 1 teaspoon olive oil and transfer to a large plate. Toast by microwaving on high power for 2 minutes. Continue microwaving at 30 second intervals until golden brown and nutty, 3 to 8 minutes total. Alternatively, toast in a toaster oven set at 375°F until golden brown and nutty, about 15 minutes. Set aside.2. Heat 4 tablespoons oil in a large non-stick or cast iron skillet over high heat until shimmering. Add eggplant and cook, tossing occasionally, until completely softened and browned in spots (eggplant will initially absorb all of the oil then slowly release some of it), about 6 minutes.3. Push eggplant to the side of the skillet and add 2 more tablespoons oil to the center. Add scallions, celery, bell pepper, and garlic and toss to combine with the eggplant. Cook, stirring and tossing frequently, until vegetables are softened and aromatic, about 3 minutes longer.4. Add reserved pine nuts, mint, parsley, tomato paste, ground cinnamon, raisins, capers, sugar, red wine vinegar, and balsamic vinegar and toss to combine. Drizzle in remaining olive oil and bring to a simmer, adding water a tablespoon at a time as necessary until caponata has a sauce-like consistency that is loose, but doesn't run freely over a plate. Season to taste with salt and pepper.5. Let mixture cool to room temperature or refrigerate in a sealed container for up to a week. Serve at room temperature garnished with extra mint leaves and a drizzle of olive oil if desired. Serve with toasted bread or pasta.",
                "Grilled Hanger Steak with Fennel Salad: Blend garlic, vegetable oil, cilantro, 1 cup parsley, and ½ cup mint in a blender until smooth. Transfer to a resealable plastic bag and add steak. Seal bag, turn to coat, and chill steak 3–12 hours.Whisk vinegar, lemon juice, and honey in a small bowl. Gradually drizzle in 2 Tbsp. olive oil, whisking until emulsified. Season vinaigrette with salt and pepper.Prepare a grill for medium-high heat. Remove steak from marinade and pat dry; season with salt and pepper. Grill until nicely browned and an instant-read thermometer registers 125° for medium-rare, about 5 minutes per side. Transfer to a cutting board; let rest at least 10 minutes before slicing against the grain.Meanwhile, toss fennel and remaining 2 Tbsp. olive oil in a large bowl; season with salt. Grill fennel on cut sides until charred and beginning to soften, about 2 minutes per side. Return to bowl, drizzle with vinaigrette, and toss to coat. Let cool slightly, then gently toss in tomatoes, feta, and remaining ¼ cup parsley and ¼ cup mint. Serve salad alongside steak.",
                "Swiss Chard Lasagna with Ricotta and Mushroom : Bring milk and bay leaf to simmer in medium saucepan; remove from heat. Melt butter in heavy large saucepan over medium-low heat. Add flour and whisk to blend. Cook 2 minutes, whisking almost constantly (do not let roux brown). Gradually whisk milk with bay leaf into roux. Add 1/2 teaspoon coarse salt, nutmeg, and cloves and bring to simmer. Cook until sauce thickens enough to coat spoon, whisking often, about 3 minutes. Remove bay leaf. DO AHEAD: Béchamel sauce can be made 1 day ahead. Press plastic wrap directly onto surface and chill. Remove plastic and rewarm sauce before using, whisking to smooth.Blanch chard in large pot of boiling salted water 1 minute. Drain, pressing out all water, then chop coarsely. Heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add onion, half of garlic, and crushed red pepper. Sauté until onion is tender, 3 to 4 minutes. Mix in chard and season to taste with coarse salt and freshly ground black pepper.Heat remaining 2 tablespoons oil in heavy large nonstick skillet over medium- high heat. Add mushrooms and remaining garlic. Sauté until mushrooms are brown and tender, 7 to 8 minutes. Mix in nutmeg and season with coarse salt and pepper.Cook noodles in medium pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain; arrange noodles in single layer on sheet of plastic wrap.Brush 13 x 9 x 2-inch glass baking dish with oil to coat. Spread 3 tablespoons béchamel sauce thinly over bottom of dish. Arrange 3 noodles in dish to cover bottom (2 side by side lengthwise, then 1 crosswise). Spread half of chard mixture over pasta, then half of mushrooms. Drop half of ricotta over in dollops and spread in even layer. Sprinkle with half of Fontina, then 4 tablespoons Parmesan; spread 3/4 cup béchamel over. Repeat layering with 3 noodles, remaining chard, mushrooms, ricotta, Fontina, Parmesan, and 3/4 cup béchamel. Cover with 3 noodles and remaining béchamel. DO AHEAD: Can be made 2 hours ahead. Cover with foil. Let stand at room temperature.Preheat oven to 400°F. Bake lasagna covered 30 minutes. Uncover and bake until heated through and top is golden brown, 20 to 30 minutes longer. Let stand 15 minutes before serving.",
                "Spaghetti Squash Grilled Cheese Sandwiches: 1. Adjust an oven rack to middle position and preheat oven to 425°F. Arrange squash, cut sides up, on a baking sheet. Brush with butter, then sprinkle with brown sugar. Rub sugar into squash and season with salt and pepper. Roast squash until fork tender, about 1 hour. Transfer to cooling rack and cool for about 10 minutes. Using a fork, scrape the squash’s flesh out and transfer to a medium bowl. Reserve.2. Heat 1 tablespoon oil in a large skillet over medium-high heat until shimmering. Add shallots and sage and cook, stirring, until softened, about 5 minutes. Stir mixture into spaghetti squash and season with salt and pepper. Wipe out skillet.3. Top one side of each roll with about 1/2 cup squash, then sprinkle with 1/2 cup cheese. Top each sandwich with the remaining rolls, then brush the rolls on all sides with remaining 2 tablespoons oil.4. Cook sandwiches in now empty skillet over medium heat until cheese melts and bread is crisp and golden, about 5 minutes per side. Allow sandwiches to rest 3 minutes, then cut in half and serve.",
                "Danish Meatball Burgers with Pickled Red Cabbage: Make the pickled cabbage: Combine the vinegar, sugar and 1 teaspoon salt in a medium saucepan. Add the cabbage and bring to a boil. Reduce the heat; simmer until the cabbage is brightly colored and tender, about 30 minutes. Remove from the heat; stir in the jam.Meanwhile, make the remoulade: Mix the mayonnaise, mustard, relish, capers, curry powder, turmeric and 1 teaspoon minced onion in a small bowl (reserve the remaining onion). Refrigerate until ready to use.Make the patties: Combine the beef, half-and-half, breadcrumbs, nutmeg, remaining minced onion, 1 teaspoon salt and 1/4 teaspoon pepper in a large bowl and combine with your hands. Form the mixture into six 3/4-inch-thick patties.Heat 1 tablespoon olive oil in a cast-iron skillet over high heat. Add 3 patties to the skillet; cook until browned, 4 minutes. Flip and cook until cooked through, about 5 more minutes. Top each burger with a slice of cheese; cover and cook until melted, 1 minute. Transfer to a plate and repeat with the remaining 1 tablespoon olive oil, burger patties and cheese. Spread the remoulade on the top buns. Sandwich with the burgers and pickled cabbage.",
                "Geoduck, Sashimi and Sautéed: 1. Bring large pot of water, about 8 quarts, to boil. Have large bowl of ice water ready. Place geoduck inside pot and boil briefly until skin of the trunk turns a shade darker, about 20 seconds. Using tongs, place the geoduck in ice water to stop cooking. Peel off skin by tugging it off the meat (a dry dishtowel can help to get a grip). Using a small boning knife, gently pry open shell and cut the meat away from the shell edges. Discard the sack next to the body.2. To Serve the Trunk Sashimi-Style: Slice trunk thinly on a bias and dip in soy sauce and wasabi, or ponzu sauce.3. To Sauté the Body Meat: Slice thinly on a bias. Heat butter in a 10-inch stainless steel skillet over medium heat until foaming subsides and butter is slightly browned. Add geoduck slices and wine and sauté for 5 to 10 seconds, until slices are just beginning to turn opaque. Season with salt to taste and serve immediately.",
                "Dashi Oats With Crunchy Veg: Toss radishes, cucumbers, and vinegar in a medium bowl; season with salt. Gently massage vegetables with your hands to soften. Let marinate until ready to use.Thinly slice 8 scallions. Melt butter in a medium pot over medium heat until foaming. Add garlic, ginger, and sliced scallions and cook, stirring often, until tender and golden, 8–10 minutes. Stir in oats and cook, coating the grains in the aromatics, until warmed through, about 2 minutes. Add dashi powder and 5 cups water. Increase heat to high and bring to a boil, then reduce heat to medium-low and cook, stirring occasionally, until oats are tender and liquid is thick and creamy, 30–35 minutes.Slice remaining 4 scallions on a diagonal and toss with pickled vegetables.Divide oats among bowls. Arrange crunchy veg on top and drizzle with any liquid that remains in bowl. Drizzle with chili oil and top with peanuts.",
                "Cajun Burgers With Spicy Rémoulade: 1. Spread the beef in a single layer on a rimmed baking sheet or large plate. Freeze just until the meat begins to get stiff around the edges, about 20 minutes. Working in batches, place 1/3 of the beef in a food processor and pulse until very roughly chopped, about 10 pulses. Add 1/3 of the andouille and continue to pulse until the mixture is finely chopped and the andouille is well distributed, about 10 more short pulses. Repeat with remaining beef and andouille.2. Gently form meat into 6 patties, each about 1/2 inch wider in diameter than the burger buns. Using your thumb, press a dimple into the center of each patty. Arrange patties on a baking sheet and refrigerate until ready to cook.3. In a food processor, combine mayonnaise, ketchup, hot sauce, mustard, parsley, lemon juice, cayenne pepper, horseradish, and garlic. Process until smooth and season with salt and pepper. Set rémoulade aside.4. Place celery strips in a bowl of ice water and refrigerate until ready to use.5. Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil the grilling grate.6. Brush onion and bell pepper with oil and grill until lightly charred and soft, about 4 minutes per side. Set aside.7. Season patties with salt and pepper. Place burgers directly over hot coals, cover with vents open, and cook, turning occasionally, until burgers register 125°F for medium-rare or 135°F for medium on an instant-read thermometer, about 6 minutes. Transfer burgers to a large plate.8. Toast buns over center of grill until golden brown and warmed through.9. Assemble the burgers in this order: bottom bun, dollop of rémoulade, grilled onions and peppers, patty, additional dollop of rémoulade, celery, blue cheese, and top bun. Serve right away.",
                "Forager Sandwich : Toss shallot, thyme, mushrooms, oil, vinegar, and salt in a medium bowl. Let sit at room temperature 1 hour.Heat oil in a large skillet over medium heat. Cook onion and garlic, stirring often, until onion is softened and just translucent and garlic is golden, about 4 minutes.Working in batches, add kale, tossing and letting it wilt slightly before adding more.Reduce heat to medium-low and cook kale, tossing often, until tender, 12–15 minutes.Mix in red pepper flakes and season with salt and pepper.Place dried mushrooms in a small bowl and cover with boiling water; let stand until rehydrated and pliable, 5–8 minutes. Drain, squeeze out excess moisture, and finely chop.Mix mushrooms, shallot, mayonnaise, lemon juice, and rosemary in a small bowl; season with salt and pepper. Cover and chill.Heat oil in a medium skillet over high heat. Drain marinated mushrooms, pat dry, and cook until deep golden brown, 6–8 minutes per side.Meanwhile, heat butter in a medium nonstick skillet over low heat and cook eggs, stirring occasionally with a heatproof spatula, until just barely set, about 4 minutes (or cook over easy, if you prefer).Heat broiler. Spread cut sides of rolls with mushroom mayo (you may have some left over). Place rolls, cut side up, on a broilerproof rimmed baking sheet. Layer bottom halves of rolls with marinated mushrooms, kale mixture, scrambled eggs, and cheese. Broil until cheese is melted.Close sandwiches and serve with hot sauce, if desired.",
                "Rice & lentil-stuffed aubergines: Method Slice the aubergines in half lengthways through the stalk, then peel and finely chop the garlic and onion. Pick the dill.Bring a pan of water to a simmer over a medium-high heat. Add the aubergines, pop on the lid, reduce the heat and simmer for 6 to 8 minutes, or until they are tender. Take them out and drain well on kitchen paper.Preheat the oven to 180ºC/gas 4. When the aubergines are cool enough to handle, scrape out the flesh with a spoon, being careful not to pierce the skin. Roughly chop the flesh and place it in a large bowl, and arrange the skins in a baking dish.Heat 1 tablespoon of oil in a pan over a low-medium heat, then add the garlic and onion and gently fry for 3 to 4 minutes, until soft. Stir in the cumin and cook for another minute.Add the garlicky onion to the bowl of aubergine along with the cooked rice, lentils, raisins and half of the dill, mix well and season to taste.Stuff the aubergine skins with the rice mixture, and place them back in the baking dish. Drizzle over oil and roast for 25 minutes, until golden.To make the tomato sauce, place all of the ingredients in a pan over a low-medium heat and simmer gently for 4 to 5 minutes, until thickened. Blitz with a hand blender until smooth.Spoon the sauce over the stuffed aubergines and serve with the feta crumbled over and the remaining dill scattered on top.",
                "Cauliflower Soup with Thyme Croutons : Bring chopped cauliflower and milk to boil in heavy large saucepan. Reduce heat to medium and simmer uncovered until cauliflower is tender, about 9 minutes. Stir in whipping cream and 2 tablespoons butter. Cool soup slightly. Working in batches, puree soup in blender. Season to taste with salt and pepper. Keep soup warm.Melt remaining 2 tablespoons butter in heavy large skillet over medium-high heat. Add bread pieces and stir until brown and crisp, about 9 minutes. Season croutons to taste with salt and pepper. Stir in thyme.Divide soup among 4 bowls. Mound thyme croutons atop soup and serve.",
                "Carrot-Ginger Soup with Tofu: Heat 2 tablespoons vegetable oil in a large pot over medium heat. Add the carrots, onion and ginger and cook until the vegetables are just soft, about 5 minutes. Season with salt and pepper. Add the star anise, carrot juice and 3 cups water, then cover and boil until the vegetables are tender, about 20 minutes.Meanwhile, cut the tofu into 1-inch cubes. Mix the cornstarch and curry powder on a shallow plate and season with salt. Pat the tofu dry and roll it in the cornstarch mixture. Heat the remaining 6 tablespoons oil in a large skillet over high heat. Add the tofu and fry, turning, until golden and crisp on all sides, about 5 minutes. Drain on paper towels and season with salt.Discard the star anise. Transfer the soup to a blender and puree in batches, or puree directly in the pot with an immersion blender. Thin with water, if needed, and season with salt and pepper. Ladle into bowls and top with the fried tofu. Garnish with cilantro, if desired.",
                "Gold Medal® Classic Biscuits : Heat the oven to 450°F. In a medium bowl, stir the flour, sugar, baking powder and salt until mixed. Cut in the shortening using a pastry blender or fork, until mixture looks like fine crumbs. Stir in the milk until mixture forms a soft dough and leaves the side of the bowl (dough will be soft and sticky).Lightly sprinkle flour over a cutting board or countertop. Place dough on floured surface; gently roll in the flour to coat. To knead dough, fold dough toward you. With the heels of your hands, lightly push dough away from you with a short rocking motion. Move dough a quarter turn and repeat 10 times. Dough will feel springy and smooth.On the floured surface, flatten dough evenly, using hands or a rolling pin, until dough is 1/2 inch thick.Before cutting each biscuit, dip a 2 1/2-inch round cutter into flour to lightly coat it so it will cut cleanly through the dough without sticking. To cut, push the cutter straight down through the dough without twisting or turning. Cut the biscuits as close together as possible. On an ungreased cookie sheet, place biscuits about 1 inch apart for biscuits with crusty sides, or place with sides touching for biscuits with soft sides.Bake 10 to 12 minutes or until golden brown. Immediately remove from cookie sheet. Serve warm.This recipe is made available as a courtesy by BettyCrocker.com, a property of General Mills Inc.",
                "Jamaican Chicken Curry: 1. Heat the oil in a medium saucepan over medium heat until shimmering. Add the onions, garlic, and ginger and cook, stirring, until the mixture begins to soften and the onions are almost translucent, 5 to 8 minutes. Add peppers and cook, stirring, for another 2 minutes. Add curry powder, stir, and continue to cook until curry powder turns deep gold and is fragrant, about 1 minute. Season the chicken with salt and pepper, add to pan and continue to cook for 8 to 10 minutes. Add the potatoes and cook for 3 minutes before adding the chicken broth, coconut milk, Worcestershire, vinegar and hot sauce. Reduce heat to low and simmer until chicken is cooked, potatoes are tender, and sauce is lightly reduced, about 30 minutes. Season to taste with salt and pepper. Garnish with cilantro if desired, and serve with sides such as grilled or fried plantains, beans, and rice.",
                "Dinner Tonight: Sichuan-Style Chicken Noodle Soup: 1. Bring large pot of water to a boil. Meanwhile, Pour oil into medium-sized saucepan set over medium heat. Add leeks and mushrooms. Cook until leeks are soft, about four minutes.2. Add chicken stock, soy sauce, rice wine, cinnamon, star anise, Sichuan pepper, and black pepper. Turn heat to high and bring to boil. Reduce heat to medium-low, and simmer for five minutes.3. Meanwhile, add noodles to large pot of boiling cook for exactly one minute less than instructions on packaging say. When timer goes off, drain noodles and transfer to saucepan. Add shredded roast chicken and cook for one minute.4. Serve soup in large bowls with garnish of chopped jalapenos to taste.",
                "Banh Mi Panzanella: 1. For the Tofu: Transfer tofu to a large zipper-lock freezer bag. In a small bowl, whisk together lemongrass, soy sauce, honey, and fish sauce. Pour marinade over tofu, press out all air from the bag, seal, and refrigerate for at least 30 minutes or overnight, turning once halfway through marinating time.2. Drain tofu and pat dry with paper towels. In a large nonstick skillet, heat oil over medium-high heat until shimmering. Add tofu and cook, turning, until crispy. Set aside.3. Meanwhile, for the Hoisin-Honey Sauce: In a medium bowl, whisk together hoisin, rice wine vinegar, honey, sesame oil, and soy sauce. Set aside or refrigerate until ready to use.4. For the Chili Mayo: In a medium bowl, whisk together mayonnaise, Sriracha, and rice wine vinegar. Set aside or refrigerate until ready to use.5. For the Salad: In a large bowl, combine tofu, bread, cucumber, jalapeños, cilantro, and drained pickled vegetables. Drizzle with hoisin-honey sauce and toss again to coat. Transfer salad to serving plate, drizzle with chili mayo and serve.",
                "Glazed Leeks With Pine Nut Salsa Verde : Trim root ends of leeks (leave as intact as possible so they don’t break apart while cooking) and cook in a large pot of boiling salted water until meltingly tender (a paring knife should slide through the thickest part with no resistance), 15–20 minutes. Transfer to paper towels to drain and let cool.Meanwhile, bring chile, honey, ¾ cup vinegar, and a pinch of salt to a boil in a small saucepan over medium-high heat. Cook, stirring often, until reduced by half, about 5 minutes.Halve leeks lengthwise and transfer to a serving dish with high sides (you want the glaze to cover leeks enough to coat). Pour warm vinegar mixture over leeks and set aside.Preheat oven to 350°F. Toast pine nuts on a rimmed baking sheet, tossing halfway through, until golden brown, 5–7 minutes. Let cool.Toss pine nuts, parsley, oil, capers, and remaining 2 Tbsp. vinegar in a small bowl; season with salt and pepper.To serve, give leeks another toss in the glaze; spoon pine nut salsa verde over.",
                "Chickpea Crust Pizza: Preheat the oven to 425 degrees F.For the tomato sauce: In a large pot, heat the oil over medium-high heat. Add the garlic, carrots and onion and saute until the vegetables are soft, approximately 5 minutes. Season with salt and pepper. Add the tomato sauce and bring to a simmer. Cover and simmer on low heat until thick, about 20 minutes.For the crust: Meanwhile, in a bowl, whisk together the chickpea flour, garlic powder, salt and 2/3 cup water. In a 7 1/2-inch round nonstick pan, heat the olive oil over medium heat and pour the \"dough\" into the pan (about 1/8 inch thick). Cook the \"dough\" until the edges start to brown, approximately 3 minutes. Flip the crust over like a pancake and cook on the other side for another 3 minutes. Transfer the crust to a baking sheet.To finish the tomato sauce, put the sauce into a food processor and process until smooth.For the pizza topping: Brush the olive oil over the chickpea crust. Spread a thin layer of the tomato sauce over the crust, leaving a 1/2-inch border. Sprinkle on the grated provolone, covering the tomato sauce. Place the chicken sausage slices on top.Bake until the cheese is melted and bubbling, 10 to 15 minutes.",
                "Bang Bang Shrimp: Cook the shrimp according to the package instructions.Meanwhile, combine the Thai chili sauce, mayonnaise, honey and sriracha in a bowl and whisk until fully combined.Toss the cooked shrimp in the mayo mixture while it's still hot. Put the lettuce leaves down on a plate and spoon the shrimp over the lettuce. Sprinkle with scallions and serve.",
                "Vegetarian Meatballs with Soy-Honey Glaze: Preheat oven to 350°. Working in 3 batches, pulse mushrooms in a food processor until no pieces are bigger than ¼\". Transfer to a lightly oiled parchment-lined rimmed baking sheet. Wipe out and reserve food processor.Add chickpeas to sheet and toss to combine. Bake, tossing once halfway through, until chickpeas are slightly darkened and mushrooms have shrunk and are browned, 35–40 minutes. Let cool. Keep oven on.Meanwhile, bring chile, soy sauce, honey, and 1 Tbsp. vinegar to a boil in a small saucepan. Reduce heat to medium-low and simmer, stirring frequently, until slightly thickened and foamy on top, about 10 minutes. Let cool.Pulse eggs, ginger, garlic, panko, chopped scallion greens, ⅓ cup cilantro, and 3 Tbsp. oil in food processor until fully incorporated. Add chickpea-mushroom mixture and 1 tsp. salt and pulse until no pieces are bigger than ¼\". Transfer chickpea mixture to a large bowl and chill at least 25 minutes to firm up.Oil a new sheet of parchment and place on baking sheet. Roll chickpea mixture with your hands into golf-ball-size balls (about 1½\"). Arrange balls on prepared sheet and brush with about one-quarter of spicy soy glaze mixture. Bake meatballs until firm and slightly darkened, 18–20 minutes.Meanwhile, toss celery (with leaves) and remaining scallions, ½ cup cilantro leaves, and 2 Tbsp. vinegar in a medium bowl; season with salt.Arrange meatballs on a platter and drizzle with sauce. Scatter celery salad over. Serve remaining sauce alongside.Do Ahead: Soy glaze can be made 1 day ahead. Cover and chill. Meatballs can be formed 2 days ahead. Cover with plastic wrap on a rimmed baking sheet and chill.",
                "Huguenot Torte: 1. Preheat the oven to 325°F. Grease a 2-quart baking dish.2. In a large bowl, beat the eggs with a whisk until they’re creamy and frothy. Add the sugar, flour, baking powder, salt, apple, pecans, and vanilla, whisking to combine after each addition.3. Pour the batter into the prepared baking dish and bake for 45 minutes, or until the top of the torte is crusty. Remove the torte from the oven and let cool for about 10 minutes.4. Whip the cream with the buttermilk until stiff peaks form. Cut into individual portions—they will be lumpen and misshapen, with shards of crust and spoonfuls of ooze, but no matter—and serve with dollops of the whipped cream.",
                "Rosy Boa Cocktail: Combine salt, paprika, and chile powder in a small bowl. Moisten half of each rim of 8 rocks glasses and dip into chile salt. Set glasses aside.Combine grapefruit juice, tequila, pomegranate juice, lime juice, and rose water in a large pitcher or 8-cup measuring glass. Add 1 cup ice and stir until ice is melted and cocktail is very cold. Stir in ginger beer. Fill prepared glasses with ice and divide cocktail among glasses. Garnish with grapefruit wedges and top off with more ginger beer, if desired.Do Ahead: Grapefruit mixture can be made 8 hours ahead. Stir in ice, then cover and chill. Add ginger beer and prepare glasses just before serving.",
                "Spinach and Artichoke Omelet Wheels : Place a rack in the center of the oven and preheat to 350ºF. Coat a 10x15-inch jelly roll pan with nonstick cooking spray, line it with parchment paper with an overhang of a few inches on both sides, and lightly spray the parchment paper.Place the flour in a small bowl and slowly pour the milk over the flour. Whisk until smooth. Add the cream and whisk until smooth.In a medium bowl, whisk together the eggs, butter, mustard, soy sauce, and pepper. Add the cream mixture and whisk well by hand for about 3 minutes, until it is fully aerated and has some big bubbles. Pour the mixture into the prepared pan and distribute the spinach, artichoke hearts, and 1/2 cup of the cheese evenly over the top.Bake for about 12 minutes, until the edges are set and the center is beginning to set. Remove from the oven, sprinkle 1 cup of cheese on top, and bake for 4 to 6 minutes, until the cheese is just melted. Remove the pan from the oven and let cool for 5 minutes.Lift the long end of the parchment paper and tightly roll the omelet to create a long cylinder. Sprinkle with the remaining 1/2 cup cheese and the chives. Slice and serve!",
                "Pizza with Pesto, Ricotta, and Mozzarella: 1. At least 2 hours before baking, divide dough into three even parts, form into balls, place on a lightly floured surface, cover loosely with plastic wrap, place a towel on top of the plastic wrap to keep the edges pressed down, and allow balls to rise at room temperature.2. Meanwhile, bring a large pot of salted water to a boil and prepare an ice bath. Add spinach, basil, and garlic to boiling water and boil until leaves are just wilted, about 30 seconds. Transfer to ice bath and allow to chill completely. Transfer to the center of a clean kitchen towel. Gather up towel edges to form a bundle in the center. Squeeze until you've extracted as much liquid as possible.3. Transfer greens to work bowl of a food processor. Add 3 ounces of parmesan, pine nuts, garlic, olive oil, and lemon zest. Process until a smooth puree is formed. Season to taste with salt.4. At least 30 minutes before ready to bake, adjust oven rack to top position and place a baking stone or steel on top. Preheat oven to highest setting (500 to 550°F).5. Working one pizza at a time, stretch or roll dough out into a 12-inch circle on a lightly floured surface. Transfer to a lightly floured wooden pizza peel. Sprinkle surface evenly with 1 ounce of parmesan cheese. Dollop 4 ounces of mozzarella, 4 ounces of ricotta, and 1/3 of pesto over surface of pizza and sprinkle with salt. Transfer to pre-heated steel or stone and bake until blistered and bubbly, 4 to 8 minutes. Remove from oven, slice into 8 slices and serve. Repeat with remaining 2 pizzas.",
                "The Best Corn Chowder: 1. Hold one corn cob upright in a large bowl and cut off kernels with a sharp knife. Repeat with remaining cobs and reserve kernels and cobs separately.2. Use the back of a knife to scrape corn cobs into a medium saucepan to collect and milk left in the bases of the kernels. Break corn cobs in half and add to saucepan. Add chicken or vegetable stock, bay leaf, fennel seed, coriander seed, and whole black peppercorns. Stir to combine. Bring to a boil over high heat, reduce to just below a simmer, and let steep for 10 minutes. Strain through a fine mesh strainer and discard cobs and spices.3. While stock infuses, melt butter in a separate 3 quart saucepan over medium-high heat. Add onions, garlic, and corn kernels, and cook, stirring frequently, until onions are softened and kernels are tender, about 7 minutes. Reduce heat if butter begins to brown. Add flour and cook, stirring constantly, for 1 minute.4. Stirring constantly, gradually add infused corn stock, letting mixture come to a simmer. Add potatoes and 1 teaspoon salt. Let simmer, stirring occasionally, until potatoes are tender, about 10 minutes. Add half and half and stir to combine. Soup may look broken with melted butter floating on top at this stage.5. Transfer 1/4 of soup to a blender and blend on high heat until smooth, about 1 minute. Return to pot and whisk to combine. Alternatively, use a hand blender to blend in the pot until desired consistency is reached. Season to taste with salt, pepper, and sugar (with very fresh picked corn, sugar should not be necessary). Serve immediately, sprinkled with sliced scallions, or chill and serve cold. (Once chilled, you can adjust the texture by whisking in water a tablespoon at a time until desired consistency is reached.)",
                "Cannellini with Pork and Rosemary : Combine beans with enough water to cover by 2 inches in a 4-to 5-quart pot. Bring to a boil and boil 2 minutes, then remove from heat and let stand, covered, while you cook the pork.Bring pork and water (4 quarts) to a simmer in an 8-to 10-quart heavy pot. Skim any foam, then add bay leaves and oregano. Simmer, uncovered, 1 1/4 hours.Drain beans and add to pork mixture along with onions, garlic, rosemary, and 1 tsp each of salt and pepper. Simmer, uncovered, stirring occasionally, until beans are just tender, 35 to 45 minutes.While beans simmer, preheat oven to 475°F with rack in upper third. Toss tomatoes with oil and spread out, cut sides up, in a large 4-sided sheet pan. Stir together sugar, 1/2 teaspoon salt, and 1/2 teaspoon pepper and sprinkle over tomatoes. Roast until tomatoes begin to shrivel and caramelize on bottom, about 45 minutes.When beans are tender, scoop out about 4 cups beans with a slotted spoon and coarsely mash.Return mashed beans to stew along with tomatoes, parsley, and 1 teaspoon salt and simmer 3 minutes. Discard bay leaves and season stew with salt and pepper.",
                "Natina Corn: In a saucepan on medium-high heat, add the butter, chicken stock and thyme. Simmer until the thyme wilts slightly, about 8 minutes. Add the corn and stir to break up any chunks. Simmer for about 10 minutes. Remove from the heat, remove the sprigs of thyme, add the sour cream and season with salt and pepper. Stir to blend, and then serve with a dash of cayenne pepper.",
                "BBQ Jackfruit Brisket: For the jackfruit brisket: Preheat the oven to 300 degrees F. Line a baking sheet with parchment paper and spray with nonstick cooking spray.Place the vital wheat gluten in a large mixing bowl. Whisk in the paprika, salt, chili powder, granulated garlic, ground mustard, onion powder, black pepper and sage. Add in the jackfruit and mushrooms. Stir until incorporated. Use your hands to break up any large clumps and make sure the mixture is thoroughly mixed; it will resemble a dark streusel with pea-size pieces.Whisk together the stock and aminos in a small bowl. Pour this liquid into the jackfruit mixture. Use your hands to aggressively knead the mixture until it feels/looks like seasoned ground meat.Place the mixture onto the prepared baking sheet. Use your hands to press it into the shape of a brisket, about 1-inch thick. Cover the baking sheet with aluminum foil and bake until firm to the touch, about 1 1/2 hours.For the BBQ sauce: Meanwhile, combine the ketchup, beer, brown sugar, mushroom stock, vinegar, tomato paste, smoked paprika, onion powder, chili powder and salt in a saucepot. Place over medium-high heat and whisk until simmering. Reduce the heat to low and cook until thick, 15 to 20 minutes more. Set aside.Remove the aluminum foil and spread the BBQ sauce over the top, reserving some for serving. Turn the oven to broil on high. Place the \"brisket\" back into the oven and broil until the sauce bubbles and caramelizes, 2 to 3 minutes more.Remove from the oven and allow to cool for 10 minutes. Slice into thin pieces and serve warm with more BBQ sauce.",
                "Wine-Braised Venison Neck: 1. One hour before cooking, remove neck from refrigerator. Pour 2 cup boiling water over the mushrooms in a small bow, and leave them to soak. Preheat the oven to 300 F.2. Pat the neck dry and season with salt and pepper. In a dutch oven or large flameproof casserole, heat 2 tablespoons of the oil over medium high heat. Brown the neck on all sides, including the bone. Transfer the meat to a plate and discard any fat from the pot.3. Add the bacon or pancetta and the remaining 1 tablespoon of oil to the pot and cook over low heat for 2 minutes. Increase the heat, add the onions, carrots, and celery, and cook until the onions begin to soften, about 5 minutes, scraping the bottom of the pot frequently.4. Lift the mushrooms from the soaking liquid and add them to the pot, along with garlic and herbs. Strain the mushroom liquid through a fine sieve, discarding any sand or grid, and the liquid to the pot, with the cinnamon stick and lemon zest. Bring to a boil, deglazing the pot by scraping the browned bits from the bottom.5. Place the neck int the pot. Pour in any meat juices, add the wine, and bring to a boil. Cover with a damp piece of parchment paper and then the lid, and braise in the oven for 3 to 3.5 hours. The meat should be very tender and lift easily from the bone.6. Transfer the neck to a platter and cover with saran wrap to prevent drying out. Discard the herbs, cinnamon stick, and zest and let the sauce cool off slightly, then puree it with an immersion blender or food processor. Bring the sauce to a boil, skim off the foam, and boil hard for 10 to 12 minutes to reduce it to 4 cups. Cool the meat and sauce separately, then refrigerate overnight.7. The next day, remove any fat from the sauce. Preheat the oven to 300 F. Place the neck back into the pot with the sauce and place into the oven. Depending on you like to serve your meat, either serve in the pot, letting your guest take the neck meat off the bone, or debone prior to bring the neck to the table.",
                "Chicken Tetrazzini: 1. Slice the mushrooms, chop the onion, mince the garlic and chop the thyme.2. Add 1 tablespoon each of butter and oil to a large sauté pan and heat over medium-high heat. Add the mushrooms, onion, salt and pepper and sauté for about 7 minutes or until onions are translucent and mushrooms are limp.3. Add the garlic thyme and white wine, stir well. Sauté for an additional two minutes. Put the mixture in a bowl on the side.4. Put the milk, cream and chicken broth into a saucepan. Heat over medium-high heat until steam rolls off the top of the mixture.5. In the sauté pan, melt 3 tablespoons of butter, melt over medium heat. Add the 1/3 cup of flour to the butter. Whisk until the flour-butter blobs become golden, or about 2 minutes.6. Whisk in the heated milk, cream and broth mixture and keep whisking until there are no blobs of flour/butter left.7. Fill a pot with enough water for 16 ounces of dried fettucini (4-6 quarts). Bring your water to a boil.8. Preheat the oven to 450º F.9. When your water is boiling, add 3 tablespoons salt and your pasta. Boil for a little less than the package instructions—about 10 minutes.10. To the cream sauce in the sauté pan on the stove, add nutmeg, the rest of the salt, and the rest of the pepper. Turn the dial on the stove up to high. As soon as the cream mixture bubbles, turn the heat down to low and continue to whisk until the sauce thickens in about 10 minutes. Turn off the heat.11. Your pasta should be done; drain it and return it to your large pasta pot. Add the white sauce, onion/mushroom mixture, parsley and chicken to the pasta pot. Incorporate and toss until it looks like you’ll get a healthy amount of all the ingredients on each forkful.12. Carefully pour the pasta mixture into the baking dish. Sprinkle breadcrumbs and Parmesan cheese over the top. Cut the remaining butter (or blob it with our fingers) and dot over the breadcrumbs and cheese.13. Bake in the heated oven for about 20 minutes or until brown and toasty on the top.",
                "Three-Cheese Fondue with Champagne: Stir cornstarch and lemon juice in small bowl until cornstarch dissolves; set aside. Combine Champagne and shallot in fondue pot or heavy medium saucepan; simmer over medium heat 2 minutes. Remove pot from heat. Add all cheeses and stir to combine. Stir in cornstarch mixture. Return fondue pot to medium heat and stir until cheeses are melted and smooth and fondue thickens and boils, about 12 minutes. Season fondue with nutmeg and white pepper. Place over candle or canned heat burner to keep warm. Serve with bread cubes.",
                "Crab Cakes: Place the 2 tablespoons butter, 2 tablespoons oil, onion, celery, red and yellow bell peppers, parsley, capers, hot pepper sauce, Worcestershire sauce, crab boil seasoning, salt, and pepper in a large saute pan over medium-low heat and cook until the vegetables are soft, approximately 15 to 20 minutes. Cool to room temperature. In a large bowl, break the lump crabmeat into small pieces and toss with the bread crumbs, mayonnaise, mustard, and eggs. Add the cooked mixture and mix well. Cover and chill in the refrigerator for 30 minutes. Shape into bite-sized crab cakes.Heat the butter and olive oil for frying over medium heat in a large saute pan. Add the crab cakes and fry for 4 to 5 minutes on each side, until browned. Drain on paper towels; keep them warm in a 250 degree oven and serve hot.",
                "Crispy Caramel Chicken Skewers: 1. For the Marinated Chicken: In a large zipper-lock bag, combine chicken, fish sauce, brown sugar, and orange juice. Shake well to coat. Refrigerate for at least 2 hours or up to overnight.2. For the Caramel Glaze: In a medium saucepan, combine the brown sugar, fish sauce, orange juice, rice vinegar, and honey over medium heat. Stir until sugar dissolves. Add garlic, shallots, and ginger and continue to cook, stirring occasionally, until glaze becomes thick and sticky and easily coats the back of a spoon. Remove from heat and set aside.3. To Grill and Garnish: Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil the grilling grate.4. Scatter white and black sesame seeds and almonds evenly all over a rimmed baking sheet.5. Thread the chicken on 6 bamboo skewers. Transfer to the grill and cook over direct heat, turning and brushing with the glaze every 5 minutes until chicken is cooked through and crisp, about 8 minutes. When skewers are nearly done, brush chicken liberally one last time with glaze and roll the skewers in the sesame-almond mixture to coat. Return to grill and cook, turning, until almonds are lightly toasted, about 2 minutes. Remove from heat, garnish with scallions, and serve.",
                "Tofu Red Curry with Rice Noodles: Cook the noodles as the label directs. Drain and set aside.Meanwhile, heat a large pot over medium-high heat. Add the curry paste and cook, stirring constantly, until it turns deep red, 30 seconds to 1 minute. Stir in the coconut milk, ginger and brown sugar. Increase the heat to high and bring to a vigorous simmer. Stir in the squash, haricots verts and bell pepper. Cover, reduce the heat to medium and cook until the squash is just tender and the beans and bell pepper are crisp-tender, about 10 minutes.Stir in the fish sauce and season with salt. Stir in the tofu and cook, uncovered, until warmed through, about 1 minute. Divide the noodles and curry mixture among bowls. Top with basil and serve with lime wedges.",
                "Boston Cream Pie French Toast: In a medium bowl, whisk pudding with 1 1/4 cups of milk. Let sit while you make french toast.In a shallow baking dish, whisk eggs, remaining ½ cup milk, vanilla, cinnamon, and a pinch of salt. Working with one or two pieces of bread at a time, dip a slice into egg mixture and let soak a few seconds one each side.Heat a large nonstick skillet over medium-low heat and melt 1 tablespoon butter. Cook soaked bread slices until golden, 3 to 4 minutes per side. Remove to a wire rack to cool slightly. Repeat with remaining butter and slices.In a small saucepan over medium heat, heat heavy cream just until it bubbles. Place chocolate chips in a small heatproof bowl and pour hot heavy cream over them. Let sit 2 minutes, then whisk until smooth and no clumps remain.Place one piece of toast on the bottom of a plate. Top with half of the pudding and close the sandwich with another slice of toast. Spoon half the chocolate sauce over top. Repeat with remaining toast, pudding, and chocolate sauce and serve.",
                "Seriously Asian: Steamed Taro and Pork in Black Bean Sauce: 1. In a medium-sized bowl, combine cubes of pork rib with mashed black beans, garlic, and salt, mixing to evenly distribute. Cover and refrigerate for at least 8 hours and up to 30.2. Prepare your steamer and bring water underneath steamer to a boil.3. In a medium sized bowl, combine the marinated ribs, along with juices in the bowl and black beans and garlic, with the cubes of taro. Place bowl in steamer and steam over high heat for 45 minutes until cubes of pork and taro are tender. Garnish with slices of jalapeno and soy sauce or fish sauce to taste, about one tablespoon of either. Serve immediately. Leftovers may be refrigerated and reheated by steaming over low heat.",
                "Easy Almond Sticky Buns: Preheat the oven to 375 degrees F. Spray a 9-by-13-inch baking pan with nonstick spray.Butter the cut sides of the buns with half of the soft butter and sprinkle with the cinnamon sugar.Melt the remaining butter in a medium saucepan over high heat. Add the golden syrup and brown sugar and cook until melted and smooth. Whisk in the marmalade and orange zest and juice and cook, stirring occasionally, for 2 minutes. Whisk in the heavy cream and salt. Pour the syrup mixture into the baking dish and scatter the almonds evenly over the top.Put the buns in the syrup, cut-sides down, and bake until the syrup is bubbly, about 20 minutes. Remove to a cooling rack and let cool for 10 minutes. Invert (carefully!) onto a platter and eat."
            ]
        }, {
            "tag": "cold",
            "patterns": [
                "TD PB Crisp A-la Mode: Mix all of the dry ingredients, for the crust, together in a bowl. Add the beaten egg and the butter, and mix well until thoroughly combined.Combine all of the filling ingredients in a medium bowl.Mix all of the dry ingredients for the crisp in a bowl, then add the butter and mix until \"crumbly.\"Preheat the oven to 350 degrees F.Put the crust into the bottom of a warmed cast iron pan, forming a crust that comes up the sides of the pan. Add the filling and spread evenly. Trim any remaining crust that rises above the peanut butter mixture. Top with the crisp mixture and bake for 25 to 30 minutes.Mix the ice cream, preserves, and syrup until combined. Put the mixture in the freezer to harden and serve with the PB crisp.",
                "Margaret’s Maple Sugar Pie: Pulse sugar, salt, and 1¼ cups flour in a food processor to combine. Add butter and pulse until the largest pieces are pea-size. Add lard and pulse again until mixture resembles coarse meal. Transfer to a large bowl and drizzle in 3 Tbsp. ice water; mix with a fork to combine. Knead 3–4 times to bring dough together (only a couple of floury spots should remain). Flatten dough into a ½\"-thick disk, wrap in plastic, and chill until firm, at least 2 hours.Let dough sit at room temperature 5 minutes to soften.Roll out dough on a lightly floured surface to a 12\" round, rotating often and dusting with more flour as needed to prevent sticking. Transfer to a 9\" pie dish. Lift up edges and allow dough to slump down into dish. You should have about 1\" overhang. Fold edges under and crimp. Freeze 15 minutes.Meanwhile, preheat oven to 425°. Lightly coat a sheet of foil with nonstick spray and place in pie crust, coated side down, pressing into bottom and up sides. Fill with pie weights or dried beans and bake until edges of crust are pale golden, 15–20 minutes. Carefully remove foil and weights and continue to bake crust until bottom is golden and looks dry, 12–18 minutes more. Transfer dish to a wire rack and let crust cool.Do Ahead: Dough can be made 3 days ahead; keep chilled, or freeze up to 1 month. Crust can be baked 1 day ahead; store tightly wrapped at room temperature.",
                "Healthy Red, White and Blue Frozen Pops: Put six 3-to 4-ounce ice pop molds in the freezer for 30 minutes.Combine the strawberries and 1 tablespoon each coconut cream and honey in a blender. Puree until smooth. Pour into a liquid measuring cup and set aside. Rinse out the blender.Combine coconut milk, 1 tablespoon each coconut cream and lime juice in the blender. Puree until smooth.Evenly divide strawberry puree between the frozen pop molds. Carefully layer the coconut milk over the strawberry puree. Freeze for 30 minutes. Rinse out the blender.When you are ready to complete the frozen pops, combine the blueberries and the remaining 1 tablespoon each coconut cream, honey and lime juice in the blender. Puree until smooth (see Cook's Note).Remove the frozen pop molds from the freezer and fill with the blueberry puree, and insert the frozen pop mold stick.Freeze until set, at least 4 hours up to overnight. Let sit at room temperature for 5 minutes before unmolding and serving.",
                "Pickled Dilly Carrots: 1. Bring a small pot of water to a boil in which to blanch the carrots.2. Prepare 1 pint and a half jar, or 2 12-ounce jelly jars. Place lid(s) in a small pot of water and bring to the barest bubble to soften sealing compound.3. Peel carrots and trim to fit jars. Cut into thin sticks.4. When the water comes to a boil, drop in the carrots and cook for either 90 seconds if you plan on canning your pickles, or 3 minutes if you’re making them as refrigerator pickles.5. When time is up, remove carrots from water and run under cold water to stop cooking.6. Combine vinegar, water and salt in a small saucepan and bring to a boil.7. Place spices and garlic cloves into the bottom of the jar or jars.8. Pack carrots sticks upright in jar(s).9. Pour the boiling brine over the carrots, leaving 1/2 inch headspace.10. Tap jar(s) gentle to remove air bubbles.11. Wipe the rims and apply the lids and rings.12. If you’re canning the pickles, process them for 10 minutes in a boiling water bath.13. When time is up, remove jar(s) from canner and let cool.14. Sealed jars can be stored in a cool, dark place for up to one year. Refrigerator pickles should be placed in the fridge as soon as the jars are cool.15. Let pickles rest in pickling liquid for at least 48 hours before eating.",
                "Swirl Spice Cake : Whisk pecans, spice mixture, brown sugar, flour, and salt in a small bowl to combine. Drizzle in butter and mix until clumps form. Set aside.Preheat an oven to 325°F. Lightly coat an 8½x4½\" loaf pan with nonstick spray. Line with parchment paper, leaving overhang on long sides. Press paper into pan, then turn over, so greased side is facing up. Whisk flour, baking soda, baking powder, and ½ tsp. salt in a medium bowl to combine.Beat sugar and butter in the bowl of a stand mixer fitted with paddle attachment on medium-high speed, scraping down sides of bowl halfway through, until very light and fluffy, 6–8 minutes. Reduce speed to medium. With motor running, add eggs one at a time, beating to incorporate and scraping down sides of bowl after each addition. Reduce speed to low; add half of dry ingredients and mix just to combine. Add sour cream and vanilla and beat to combine. Add remaining dry ingredients and beat until incorporated.Scrape half of batter into prepared pan. Top with streusel (yes, it will look like a lot, but use all of it!), then scrape remaining batter over. Starting at a short side of the pan and working your way to the other short side, drag a butter knife back and forth from one long side to the other through batter to marble streusel; smooth surface.Bake cake until a tester inserted into the center comes out clean, 80–90 minutes. Transfer pan to a wire rack and let cake cool in pan 15 minutes. Run a small knife around edges of cake to loosen if needed, then, using parchment paper, lift out of pan onto rack. Peel away parchment. Let cake cool completely.Combine powdered sugar and a pinch of salt in a small bowl, then mix in orange juice, adding up to a teaspoonful more if needed, until you have a thick but pourable icing. Drizzle over cake and let sit until icing is set before serving, about 15 minutes.Do ahead: Cake can be baked 3 days ahead. Store airtight at room temperature.",
                "Waldorf Salad with Roast Beef Sandwich: Combine the mayonnaise and lemon juice in a medium-size bowl. Season with salt and pepper to taste. Toast the pecans in a toaster oven for 1 minute, or until brown to bring out their flavor. Be careful-they burn easily. Toss the celery, apple and pecans in the mayonnaise mixture. Place lettuce leaves on 4 plates and spoon the salad onto the leaves to serve.Spread the bread with mustard. Divide the roast beef between each slice of bread. Top with the tomato slices. Serve any extra tomato slices on the side.Divide yogurt between 4 dessert bowls.",
                "Double-Almond Chocolate Brownie: Preheat oven to 350°. Toast almonds on a rimmed baking sheet, tossing halfway through, until golden brown, 8–10 minutes. Let cool, then coarsely chop; set aside.Meanwhile, heat chocolate, butter, and cocoa powder in a medium heatproof bowl set over a medium saucepan of barely simmering water, stirring occasionally, until melted and smooth. Remove from heat and stir in espresso powder and vanilla. Let cool.Increase oven temperature to 375°. Lightly coat an 8x8\" baking dish with nonstick spray, then line with parchment paper, leaving a 2\" overhang on 2 sides. Coat parchment with nonstick spray.Roll out almond paste between 2 sheets of parchment to an 8x8\" square (it will be very thin; it’s okay if there are some holes and/or jagged edges).Using an electric mixer on medium-high speed, beat eggs and salt in a large bowl until foamy, about 5 minutes. Gradually add sugar and continue to beat until very thick and foamy, 5–8 minutes more. Reduce mixer speed to low, add cooled chocolate mixture, and beat to combine. Fold in flour until no streaks remain.Spread half of batter in prepared pan; smooth top. Lay sheet of almond paste over batter. Spread remaining batter over almond paste; smooth surface. For fudgy brownies, bake until edges are slightly puffed but center is still slightly wobbly, 22–25 minutes. For cakey brownies, bake until edges are puffed but center is set, 25–30 minutes. Immediately top with chocolate wafers and let melt, then spread with an offset spatula to cover top of brownie. Top with reserved almonds and let cool.Using parchment overhang, lift brownie out of pan and transfer to a cutting board. Cut into 16 squares.Do Ahead: Brownie can be made 3 days ahead. Wrap tightly in plastic and chill.",
                "Spicy Tamarind Caramel: 1. Crack the shells from the tamarind and de-vein as much as possible. Discard shells and place pulp in a medium saucepan with 3 cups of water. Bring pulp and water to a boil and then reduce to a simmer. Allow to simmer, covered, 45 minutes to 1 hour, until pods are completely broken down and you can see the glossy tamarind seeds throughout the mixture.2. Remove from heat and pour the mixture through a fine sieve into a bowl, stirring to separate the pulp dissolved in the liquid from that still clinging to the seeds.3. Return the pulpy seeds to the pan and add 1 cup fresh water. Once again, bring the mixture to a boil and then reduce to a simmer, this time for 15-20 minutes. Strain into the bowl with the first round of pulp. You should have about 2 1/4 cups. Discard seeds and rinse out saucepan.4. Spread one cup of sugar in an even layer on the bottom of saucepan and place over medium heat Cook undisturbed until sugar begins to melt and takes on a golden color. Carefully, as the mixture will bubble furiously, add the liquid tamarind pulp and whisk together. Cook about ten minutes until the mixture appears glossy and reaches 223°F on a candy thermometer.5. Remove from heat and stir in cayenne pepper and salt. Allow to cool, pour into a jar and store in the refrigerator.",
                "Strawberry-Peanut Butter Tart: Preheat the oven to 350 degrees F. Generously butter a 9-inch fluted tart pan with a removable bottom.Whisk the flour, baking powder and salt in a medium bowl. Beat the butter, peanut butter and both sugars in a separate bowl with a mixer until smooth. Beat in the egg and vanilla. Add the flour mixture and stir with a wooden spoon until combined.Press half of the dough into the prepared tart pan. Spread the jam over the dough, leaving a 1/2 -inch border around the edge. Drop about half of the remaining dough over the jam by the tablespoonful; lightly press the rest of the dough into the pan around the edge to form a crust. Bake until golden, 45 to 50 minutes.Transfer the pan to a rack and let cool. Remove the ring and transfer the tart to a plate.",
                "Don's Mix: 1. Put cinnamon sticks in a zip lock bag and bash a few times with a rolling pin. Combine broken cinnamon sticks, sugar, and water in a saucepan and bring to a boil. Let simmer for 10 minutes. Remove from heat and let steep for 15 minutes. Strain cinnamon syrup into a mason jar with a mesh strainer. Let cool.2. Add grapefruit juice to cinnamon mixture and shake. Mixture can be stored, sealed, in the refrigerator for up to 5 days, though it's tastiest when fresh.",
                "Habanero Lime Cheesecake: Preheat the oven to 400 degrees. Position top rack in the center of the oven. Place a baking pan on the rack below this. Boil water.Make crust: Mix the crumbs and salt together in a small bowl, then add butter and stir to mix. Set aside 1/4cup for topping. Press the rest into the bottom and sides of a 9-inch springform pan.Turn on kitchen or stove exhaust fan. Skewer and roast the habaneros over an open flame (gas burner is fine) and set them to steam under a towel. When they are cool enough to handle, put on plastic gloves if desired. Peel and deseed habaneros, then pound in a mortar with the 2 tablespoons of sugar until a coarse paste results.Cream the cream cheese, then add remaining sugar and salt. Beat in the eggs 1 at a time until incorporated. Add the cream and blend. Beat the zest and lime juice into this mixture. Add the habanero paste last and beat until well mixed. Pour into the crust, then gently tap the pan to level the filling. Sprinkle the reserved crumbs on top.Pour boiling water into the pan on the oven's lower rack. Place the cheesecake on the rack above it. Bake for approximately 1 hour or until the cheesecake pulls away from the edge of the pan. Remove from the oven and allow to set for 20 minutes. Wrap and keep in the refrigerator overnight, or if rushed, place in the freezer for 2 to 3 hours.Garnish, if desired, with slices of lime and place a whole habanero in the center.",
                "Cranberry Fruit Conserve: Cook the cranberries, sugar, and 1 cup of water in a saucepan over low heat for about 5 minutes, or until the skins pop open. Add the apple, zests, and juices and cook for 15 more minutes. Remove from the heat and add the raisins and nuts. Let cool, and serve chilled.",
                "Irish Coffee Caramel Ice Cream with Shaved Dark Chocolate and Candied Pecans: 1. Add sugar to a three quart saucepan with enough water to just moisten sugar, about 1/4 cup. Place on high heat and bring to a boil. Let caramel form and darken, rotating pot if hot spots form. When caramel has turned dark amber and starts to smoke, turn off heat and stir in butter with a wooden spoon. Caramel will bubble, so watch for steam.2. When butter is fully integrated, add half-and-half in a steady stream and stir to combine. Caramel will bubble high and steam. When dairy is fully incorporated, add coffee. If caramel seizes up, stir it on low heat until it dissolves.3. In a large bowl, whisk egg yolks well until lemony in color and thickened. Add a ladle of caramel mixture to yolks, whisking constantly. Repeat until bottom of bowl is warm to touch. Transfer yolk mixture to pot and whisk to combine.4. Return pot over medium-low heat and cook, whisking frequently, until a custard forms on a spoon and a finger swiped across the back leaves a clean line, or until custard temperature reaches 170°F. Stir in whiskey and salt to taste.5. Strain custard through a fine mesh strainer and chill in either ice bath or refrigerator until it is very cold, about 40°F. Churn in ice cream maker according to manufacturer's instructions, adding chocolate shavings and pecans in last minute of churning, then transfer to an airtight container and to harden in freezer for at least 4 hours before serving.",
                "Parker House Rolls: 1. Put the milk, yeast, bread flour, sugar, and potato flakes in the bowl of your stand mixer. Knead until the dough is smooth and elastic. The dough will be quite stiff at this point.2. Add the butter and salt and continue kneading until the butter is completely incorporated. Cover the bowl with plastic wrap and set aside until the dough has doubled in size, about an hour.3. Line a baking sheet with parchment paper and preheat the oven to 350°F. Lightly dust your work surface with flour. Turn out the dough, pat it down to flatten it. Fold the left side towards the middle, then the top, then the right side, and the bottom to form a rough square.4. With a rolling pin, roll the dough to about 9 by 12 inches. Using a pizza cutter or sharp knife, cut the dough into three 12-inch strips, then cut each strip into 4 equal pieces, so you have 12 squares.5. Using a chopstick, the handle of a wooden spoon, or a similar object, press a line onto each square going straight across (not diagonally) so it's not quite across the center of the square. This will help keep the dough from unfolding when it bakes. Fold the dough over at the crease, with the larger portion folded over the smaller one, like a clam with an overbite.6. Arrange the folded dough on the baking sheet, leaving space between them if you don't want them to touch, or placing them nearly touching if you prefer pull-apart buns. Cover the buns with plastic wrap and set aside until doubled in size, half the time it took for the first rise (about 30 minutes).7. When the buns have doubled in size, bake at 350°F until the buns are nicely browned, about 25 minutes. Remove the buns from the pan and let them cool on a rack. Serve the same day.",
                "Banana Cream Pie: 1. Shape and chill the pie crust. Wet the surface of a sheet tray with sides and line it with plastic wrap, with additional plastic wrap close at hand. In a large saucepan, whisk together the milk, vanilla (pod and seeds if using the vanilla bean), and half the sugar. Set aside. In a large bowl, whisk together eggs, yolks, and salt until lightened. In a separate bowl, whisk together remaining sugar and cornstarch, then add to the eggs, whisking constantly. Whisk for two minutes, until egg mixture is pale and fluffy.2. Place the milk mixture over medium heat and bring it just to a boil. Turn off the heat, and temper the egg mixture with the hot milk mixture in four additions, whisking constantly as you add the hot liquid to the egg mixture. Return the mixture to the pot and whisk constantly over medium-low heat until it begins to thicken and sputter. Once it begins to sputter, whisk two additional minutes, then turn off the heat and continue whisking as you add the butter. Whisk until the butter is completely melted and combined, then pour the pudding into the lined sheet tray. Spread it evenly to cool, then cover the surface directly with plastic wrap. Allow it to come to room temperature, then transfer to a sealed container and refrigerate for at least 2 hours.3. Preheat the oven to 425°F. Line the chilled pie crust with parchment or foil and fill with weights (I reuse dried beans for this purpose). Bake the pie for 15 minutes, rotating halfway through, then remove the weights and lining and bake on the lower rack until the bottom of the crust is a golden brown. Remove from the oven and allow the shell to cool completely.4. When ready to assemble, whisk the pudding until it becomes smooth and supple. Fold in the cold whipped cream. Spread a third of the pudding over the bottom of the crust, then top with a layer of bananas, then repeat, reserving bananas for garnish (do not make the top layer bananas, they will become brown and unsightly). Top with additional whipped cream and bananas, sliced right before serving.",
                "Romaine, Avocado, and Corn Salad: In a bowl combine the romaine, corn, and cherry tomatoes.Add 3/4 cup of avocado. Place the remaining avocado in a blender along with 1/3 cup water, lime juice, and chili powder; season with salt and pepper.Pour dressing over the salad; toss gently. Looking for more healthy recipes? Check out our collections of low-fat recipes, healthy recipes for the whole day, and vegan recipes.",
                "Irish Coffee Caramel Ice Cream with Shaved Dark Chocolate and Candied Pecans: 1. Add sugar to a three quart saucepan with enough water to just moisten sugar, about 1/4 cup. Place on high heat and bring to a boil. Let caramel form and darken, rotating pot if hot spots form. When caramel has turned dark amber and starts to smoke, turn off heat and stir in butter with a wooden spoon. Caramel will bubble, so watch for steam.2. When butter is fully integrated, add half-and-half in a steady stream and stir to combine. Caramel will bubble high and steam. When dairy is fully incorporated, add coffee. If caramel seizes up, stir it on low heat until it dissolves.3. In a large bowl, whisk egg yolks well until lemony in color and thickened. Add a ladle of caramel mixture to yolks, whisking constantly. Repeat until bottom of bowl is warm to touch. Transfer yolk mixture to pot and whisk to combine.4. Return pot over medium-low heat and cook, whisking frequently, until a custard forms on a spoon and a finger swiped across the back leaves a clean line, or until custard temperature reaches 170°F. Stir in whiskey and salt to taste.5. Strain custard through a fine mesh strainer and chill in either ice bath or refrigerator until it is very cold, about 40°F. Churn in ice cream maker according to manufacturer's instructions, adding chocolate shavings and pecans in last minute of churning, then transfer to an airtight container and to harden in freezer for at least 4 hours before serving.",
                "White Chocolate Banana Pudding: Mix the pudding mix, milk, and sweetened condensed milk and blend well. Fold in the whipped topping, bananas, and white chocolate chips.Refrigerate overnight. Serve in individual serving cups. Garnish with white chocolate chips and vanilla wafers.",
                "Dakos (Greek Bread Salad): Preheat the grill. Brush the bread with oil on both sides and season with salt and pepper. Grill bread on both sides until lightly golden brown. Remove the bread to a platter and let sit at room temperature to get slightly hard.Meanwhile, whisk together 1 cup olive oil, lemon juice, and dill in a medium bowl. Season, to taste, with salt and pepper. Fold the cucumber, tomatoes, onion, and feta into the oil mixture and let stand at room temperature for 30 minutes. Spoon the mixture over the bread. Garnish with additional dill and drizzle with chili oil, if desired. Serve immediately.",
                "Thick Bananas Foster Shake: Melt sugar in a small saucepot on medium heat. When sugar has melted to an amber color, add butter, stirring until melted. Remove from heat and slowly stir in cream being careful not to splatter. Pour half the caramel into a bowl and set aside. Fold bananas into remaining caramel in saucepot and return to medium-high heat. Stir to combine and cook until tender, about 2 minutes. Set aside and let cool slightly. Add ice cream, banana-caramel mixture, banana liqueur and rum to a blender and blitz until smooth. Drizzle remaining caramel down the sides of glass goblets. Pour in shake and serve.",
                "Iced Lemon Tulip Cookies: 1. For The Cookies:In a medium bowl, whisk together flour, baking powder, and salt; set aside. In the bowl of a stand mixer fitted with a paddle attachment, beat together butter and sugar until light and fluffy, about 3 minutes. Beat in egg, lemon juice, and lemon zest. Add dry ingredients and mix until just combined. Divide dough in two, wrap each section in plastic wrap, and refrigerate for 30 minutes.2. Adjust oven rack to middle and lower positions and preheat oven to 350°F. Line two baking sheets with parchment paper. Flour a clean work surface. Unwrap one of the balls of dough, leaving the other in the fridge until you are ready to use it. Roll it out until 1/4-inch thick, occasionally picking it up and reflouring the board to avoid sticking. Use your cookie cutter to cut out shapes, then transfer them to the prepared baking sheet. Continue until all dough is used. Bake cookies until golden at the edges, 12 to 15 minutes. Let cool 5 minutes then transfer to a wire rack to finish cooling completely.3. For Decorating: While cookies are cooling, whisk together egg whites and confectioners sugar until smooth. Place colored sanding sugar or sprinkles in a shallow bowl. Use a small knife or brush to cover a cookie with icing, then lightly press cookie, icing side down, onto sprinkles to coat. Repeat with remaining cookies.",
                "Yogurt Dip: Drain the yogurt in cheesecloth or paper towel for a short while so it thickens even more. Place the yogurt in a bowl, add the remaining ingredients and mix together.",
                "Deep-Dish Maple-Bourbon Cream Pie : Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, about 10 minutes; let cool.Pulse pecans and 1 Tbsp. flour in a food processor until finely ground. Add granulated sugar, salt, cinnamon, and remaining 1 cup plus 7 Tbsp. flour and pulse to combine. With the machine running, add butter, vinegar, and 2 Tbsp. cold water in a slow, steady stream and mix just until incorporated.Transfer mixture to a large bowl and press with your hands until a dough forms. Form into a 6\" disc, then transfer to pie plate and press into bottom and up sides with a flat-bottomed measuring cup. Crimp edge with a floured fork, if desired, and freeze while you prepare the filling.Position rack in center of oven and preheat to 350°F. Cook maple syrup in a medium saucepan over medium-high heat until reduced to about 1/2 cup, 8–10 minutes.Whisk eggs, brown sugar, flour, and salt in a large bowl until smooth. Whisk in cream, bourbon, cinnamon, and reduced maple syrup until combined.Heat butter over medium in a small saucepan, swirling pan occasionally, until nutty, dark brown, and most of the foam has subsided, about 5 minutes. Immediately whisk into maple syrup mixture.Place a sheet of parchment paper over dough and fill with pie weights or dried beans. Bake until edge is lightly golden, 10–15 minutes. Remove weights, then cover edge with a pie shield or foil to prevent overbrowning. Continue baking until center is golden brown, 5–10 minutes more.Pour filling into crust and bake pie until edge is set but center is still very jiggly, 40–45 minutes. Transfer to a wire rack and let cool at least 2 hours (the center will set as pie cools).Combine cream and yogurt in a large bowl. Scrape in vanilla seeds and reserve pod for another use, or add vanilla extract. Using an electric mixer on medium-low speed, beat until soft peaks form. Mound whipped cream in center of pie.",
                "Coconut Cake: 1. Preheat oven to 375°F. Butter 8- by 8- by 2-inch baking pan.2. Put eggs, condensed milk and baking powder in the bowl of a food processor. Pulse until combined, 5 pulses. Add 2 cups of coconut flakes, pulse until flakes are small but not smooth, 5 seconds. Pour batter into pan and top with remaining coconut.3. Bake until top is golden and tester comes out clean, about 35 minutes. When cooled, cut into 1.5 inch squares.",
                "Sazerac : In old-fashioned glass, add ice and set aside. In another, combine sugar, bitters, and water. Muddle until sugar is completely dissolved. Add rye whiskey, fill with ice, and stir well, about 15 seconds. From first glass, discard ice, then add Herbsaint. Holding glass horizontally, turn it so that Herbsaint completely coats the interior. Discard any excess. Strain contents of second glass into chilled glass. Twist lemon peel directly over drink to release essential oils, and serve.",
                "Limoncello: Put the lemon peels, lavender, if using, and rum or vodka in a container and let stand for 4 weeks.Strain the mixture into a decanter.Mix the sugar and water in a medium saucepan and bring to a boil. Reduce the heat and simmer until the sugar has dissolved. Let cool before adding to the rum mixture.Serve in small aperitif glasses.Store in the freezer for up to 1 year.",
                "Raspberry-Campari Sorbet: 1. In a blender combine raspberries, sugar, water and Campari. Blend on medium until raspberries are completely pureed, 30 seconds to 1 minute. Pour through a fine mesh strainer into a measuring cup, pressing on strainer with a spoon to separate juice from seeds. Measure out 3 cups of puree and discard remainder.2. Transfer puree to a mixing bowl and stir in orange zest, then add salt, followed by lemon to taste. Cover mixture and chill in refrigerator until very cold, about 2 hours, and churn in ice cream maker according to manufacturer's instructions. Transfer sorbet to an airtight container and chill in freezer for at least 4 hours before serving.",
                "Persephone: 1. Stir applejack, sweet vermouth, sloe gin, lemon juice, and simple syrup with ice until well chilled. Strain into a chilled coupe.",
                "O' Choco Cafe Cake - Semi-Homemaker: Set the ice cream out on counter for about 30 to 45 minutes to soften, but not melt.Crush the cookies in a food processor along with the butter.Spray a 9 by 5-inch loaf pan with cooking spray and line it with waxed paper so that the paper covers sides and is taller than pan. The paper should fall over the sides of pan. Press the crushed cookies into the bottom of the pan to make a thick layer. Do not allow the cookies to go up the sides.Layer the ice cream in the order you prefer. (I usually do coffee, chocolate, and then the vanilla.) Smooth out each layer before pouring in the next flavor of ice cream to make a level surface for the next layer. Fill the pan with the last layer so that the ice cream is level with the sides of the pan.Cover with plastic wrap and place in the freezer until the ice cream is firm and solid, at least 5 to 6 hours. (I usually start this in the morning to serve as a dessert after dinner.)Once the ice cream is firm and solid remove the plastic wrap. Dip pan into warm water to make it easy to remove, but do not let water get inside the pan. Invert onto a decorative plate, using the waxed paper to ease the cake out of the pan. Remove the waxed paper and serve.",
                "Chocolate and Passionfruit Layer Cake : Preheat the oven to 180°C/160°C fan/gas 4/350°F then grease two 20cm (8-inch) tins and line with baking parchment.Make two batches of My Favorite Chocolate Cake recipe and use it to fill the tins.Bake for 25–30 minutes until risen and a skewer inserted comes out clean. Leave to cool in the tin for ten minutes before turning out onto a cooling rack.Whip the cream and confectioners' sugar together in a small bowl until it forms soft peaks and holds its shape when mixed. Be careful to stop when it reaches soft peaks or you might over-whip the cream, which will ruin the finished cake.Spread the whipped cream all over the top of one of the cake layers, then cover with spoonfuls of passionfruit curd. Carefully sandwich the second layer on top of the first.To make the icing, melt the butter and chocolate together in a microwave or in a heatproof bowl over a pan of simmering water. Remove from the heat and mix in the confectioners' sugar and the milk, then use a palette knife to spread it over the top of the cake. Sprinkle over chocolate shavings before serving. Keep any leftover cake in the fridge, where it will keep well for 2–3 days."
            ]
        }
    ]
}
