{
    "intents": [
        {
            "tag": "modern",
            "patterns": [
                "Citrus-Cured Salmon : Combine salt, granulated sugar, brown sugar, peppercorns, coriander seeds, fennel seeds, and red pepper flakes in a medium bowl. Spread half of curing mix in the center of a foil-lined rimmed baking sheet roughly the same size as the fish. Place fish, skin side down, on curing mixture. Spread lemon zest, lime zest, and orange zest evenly over fish; cover with remaining curing mixture. Bring edges of foil up and over salmon and crimp to enclose. Place another baking sheet on top of salmon and weigh down with several large cans or a heavy pot. Chill, unwrapping and flipping fish halfway through, 24 hours.Rinse fish and pat dry; place, skin side down, on a cutting board. Using your longest, sharpest knife and wiping down blade with a moist towel between slices, cut on a diagonal 1/8\"–1/4\" thick, leaving skin behind.Salmon can be cured 3 days ahead. Cover tightly and chill.",
                "Yogurt Pesto Dip: Add the yogurt and pesto to a medium bowl and stir until fully combined. Add salt and pepper to taste.",
                "Hellfire Jerk Chicken With Rummy Grilled Pineapple: 1. Add allspice, cinnamon, nutmeg, black pepper, salt, thyme, ¼ cup brown sugar, soy sauce, lime juice, vinegar and oil to a blender. Blend well. Add green onions, garlic, ginger and habanero peppers and purée until smooth. Divide jerk sauce in half. Reserve half in refrigerator.2. Place chicken, two tablespoons rum and remaining half of jerk sauce in a resealable plastic bag. Marinate in the refrigerator overnight or up to two days.3. At least four hours prior to cooking, place pineapple, remaining three tablespoons rum, and remaining three tablespoons brown sugar in a resealable plastic bag. Shake to combine and dissolve sugar. Place in refrigerator to marinate.4. Light one chimney full of charcoal. When all charcoal is lit and covered with gray ash, spread coals evenly over the surface of the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grill grate. Place chicken on the grill, skin side down. Cook until skin is crisp and charred, about 4 minutes. Flip chicken and continue to cook, turning and basting occasionally with marinade until a glistening crust forms on the outside of chicken and an instant read thermometer registers 155°F when inserted into the thickest part of the breast (about 20 to 30 minutes). As chicken nears the end of cooking, remove pineapple from the refrigerator and cook, brushing with glaze, until browned and lightly charred on all sides (about 6 minutes).5. Remove chicken and pineapple from grill. Allow to rest for a 10 minutes. Serve with remaining jerk sauce.",
                "Amaro-Spiked Mocha with Caramelized Brioche: Heat butter in a small skillet, preferably nonstick, over medium-low until it begins to foam. Add brioche and cook, turning occasionally, until golden brown on all sides, about 3 minutes total. Transfer to paper towels and let drain.Wipe out skillet and sprinkle with sugar and salt; set over medium heat. Cook (undisturbed) until edges of sugar begin to melt, about 1 minute. Stir sugar, bringing edges in toward the center to prevent burned spots, and continue cooking until all sugar is melted and turns amber color, about 4 minutes. Add brioche and quickly turn to coat all sides in caramel, about 30 seconds. Transfer to a parchment-lined rimmed baking sheet and let cool.",
                "Quick Fruit and Citrus Barbecue Sauce: 1. In a medium bowl, whisk together barbecue sauce, mango juice, pineapple juice, lemon juice, lime juice, honey, ginger, and habanero hot sauce. Season with additional hot sauce to taste. Use immediately or pour back in bottle and store in refrigerator for up to a month.",
                "Perfect Cast-Iron Skillet Chicken Thighs: Preheat oven to 475°. Season chicken with salt and pepper. Heat oil in a 12\" cast-iron or heavy nonstick skillet over high heat until hot but not smoking. Nestle chicken in skillet, skin side down, and cook 2 minutes. Reduce heat to medium-high; continue cooking skin side down, occasionally rearranging chicken thighs and rotating pan to evenly distribute heat, until fat renders and skin is golden brown, about 12 minutes.Transfer skillet to oven and cook 13 more minutes. Flip chicken; continue cooking until skin crisps and meat is cooked through, about 5 minutes longer. Transfer to a plate; let rest 5 minutes before serving.",
                "Toasted Garlic–Herb Blender Sauce: Heat a medium heavy skillet, preferably cast iron, over medium. Toast garlic, tossing occasionally, until skins are darkened on all sides and cloves are softened, 12–15 minutes. Let cool.Peel garlic; discard skins and transfer cloves to a blender. Add parsley, mint, oil, lemon zest and juice, red pepper flakes, and salt. Blend until a pesto-like sauce forms.Do Ahead: Sauce can be made 1 week ahead. Cover and chill.",
                "Jack Rose: 1. Combine applejack, grenadine, lemon juice, and bitters in a cocktail shaker. Fill shaker with ice and shake vigorously until well chilled, about 15 seconds. Strain into a chilled coupe or martini glass. Squeeze lemon twist over surface of drink, skin-side-out to release fragrant oils. Rub rim of glass with skin side of lemon twist and discard twist. Serve immediately.",
                "Sazerac : In old-fashioned glass, add ice and set aside. In another, combine sugar, bitters, and water. Muddle until sugar is completely dissolved. Add rye whiskey, fill with ice, and stir well, about 15 seconds. From first glass, discard ice, then add Herbsaint. Holding glass horizontally, turn it so that Herbsaint completely coats the interior. Discard any excess. Strain contents of second glass into chilled glass. Twist lemon peel directly over drink to release essential oils, and serve.",
                "Beloved's Allsorts Inc.: 1. Fill a cocktail shaker with ice. Add pear eau de vie, mezcal, tequila, lemon juice, Velvet Falernum, allspice dram, and orange bitters. Shake until well chilled, about 15 seconds.2. Strain into rocks glass filled with ice.",
                "Burnt Garlic-Sesame-Chili Oil for Ramen: 1. Combine canola oil and 10 cloves minced garlic in a small saucepan and cook over medium-low heat, stirring, until it starts to brown. Reduce heat to low and continue to cook, stirring frequently, until garlic turns completely black, about 10 minutes (garlic will become very sticky in the process).2. Transfer mixture to a heat-proof bowl and add sesame oil. Transfer to a blender and blend on high speed until completely pulverized, about 30 seconds. Return mixture to saucepan and add chilies and remaining garlic. Cook gently over low heat until chilies and fresh garlic begins to bubble. Remove from heat and set aside to cool.3. Grind sesame seeds in a mortar and pestle or a food processor until roughly ground but some large pieces still remain. Stir sesame seeds and sugar into oil mixture. Season to taste with salt. Transfer to a sealable container and store in the refrigerator for up to 2 months.",
                "Steak Frites With Herb Mustard: Preheat the oven to 450 degrees F. Whisk the mustard and olive oil in a small bowl. Coat the steak with 2 tablespoons of the mustard mixture, then season with black pepper and set aside. Whisk the chives, tarragon and 2 tablespoons cold water into the remaining mustard mixture. Slice the potatoes into 1/4-inch-thick sticks; pat dry. Whisk the egg whites, paprika, cayenne and 1/4 teaspoon salt in a large bowl; add the potatoes and toss. Coat a rimmed baking sheet with cooking spray. Add the potatoes, letting the excess egg drip off; spread out and spray with cooking spray. Bake until golden brown, 25 minutes. Meanwhile, cook the steak: Sprinkle 1/4 teaspoon salt in a large cast-iron skillet. Heat the pan over high heat until very hot, then add the steak and place another heavy skillet on top to weigh it down. Sear until browned, about 3 minutes per side. Turn off the heat and let the steak rest in the pan, 5 to 8 more minutes for medium rare. Thinly slice against the grain and serve with the fries and herb mustard.",
                "Limoncello: Put the lemon peels, lavender, if using, and rum or vodka in a container and let stand for 4 weeks.Strain the mixture into a decanter.Mix the sugar and water in a medium saucepan and bring to a boil. Reduce the heat and simmer until the sugar has dissolved. Let cool before adding to the rum mixture.Serve in small aperitif glasses.Store in the freezer for up to 1 year.",
                "Gemelli with Broccoli Rabe and Anchovies : Put oven rack in middle position and preheat oven to 350°F.Cook pasta in a 7- to 8-quart pot of boiling salted water 6 minutes, then stir in broccoli rabe and boil until pasta is al dente, about 5 minutes more.While pasta is cooking, toss panko with 1 tablespoon oil in a shallow baking pan until coated and bake, stirring once or twice, until golden, 8 to 10 minutes. Season crumbs with salt.While broccoli rabe (with pasta) is cooking, cook garlic, anchovies, and red-pepper flakes in remaining 7 tablespoons oil in a 12-inch heavy skillet over moderate heat, stirring and mashing anchovies into oil with a wooden spoon, until garlic is golden, about 3 minutes. Remove from heat.Drain pasta and broccoli rabe in a colander, then add to anchovy mixture in skillet, tossing to combine.Serve pasta sprinkled with some toasted panko and pass remainder.",
                "Rainbow Spaghetti: Place 2 tbsp water into each ziplock back (we used 6 for 6 different colors). Add 10 drops gel food coloring to each bag.Divide the spaghetti into the 6 different bags. Shake until they are coated in their colors.Remove each pasta individually from ziplock bag and rinse with cold water. Combine in a large bowl and toss together with butter and parm. Season with salt and pepper and serve.",
                "Brown Rice Porridge with Hazelnuts and Jam: Preheat oven to 350°. Toast hazelnuts on a rimmed baking sheet, tossing occasionally, until golden brown, 8–10 minutes. Let cool, then coarsely chop.Combine almond milk, rice, sugar, salt, and 4 cups water in a large saucepan; scrape in vanilla seeds and add pod. Bring to a boil, reduce heat, and simmer, stirring occasionally, until rice is very tender and mixture resembles loose rice pudding or oatmeal, 60–70 minutes. Remove vanilla pod. Serve porridge topped with jam and hazelnuts.",
                "Improved Gin Cocktail: 1. Combine genever, simple syrup, Cointreau (or maraschino), and bitters in a mixing glass and fill with ice. Stir well to chill, about 15 seconds.2. Strain into a chilled cocktail glass. Twist a piece of lemon peel over the drink and rub around the rim of the glass.",
                "Grilled Chicken and Peach Saltimbocca Skewers: 1. For the Marinade: In a large bowl, combine wine, lemon juice, soy sauce, chopped sage, and shallot. Whisk in olive oil and red pepper flakes, then season with salt.2. For the Skewers: Add chicken and peach cubes to bowl of marinade. Cover and refrigerate for at least 30 minutes and up to 8 hours.3. Light 1 chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil grilling grate.4. Meanwhile, working with one slice at a time, place prosciutto slices on a flat surface and lay 1 to 2 sage leaves on top of each. Fold prosciutto slices in half lengthwise so that sage is sandwiched inside.5. Remove chicken and peaches from marinade and reserve marinade. Using a skewer, pierce one end of sage-stuffed prosciutto. Place a piece of chicken right where the skewer pierced the prosciutto and slide skewer through the chicken as well, then slide skewer through prosciutto again, on the other side of the chicken. Next, slide a peach cube onto skewer, then weave prosciutto and pierce once more on the far side of the peach cube. Repeat, alternating chicken and peach chunks, with prosciutto snaking back and forth around them along the length of the skewer. Repeat until all 6 skewers are assembled.6. Pour marinade into a small saucepan and cook over high heat. Bring to a full, rolling boil for 2 minutes, then reduce to a simmer. Cook, whisking occasionally, until reduced and thickened to a sauce-like consistency. Set aside.7. Grill skewers over high heat until prosciutto crisps and chicken has cooked through, about 3 minutes on each side. If skewers threaten to burn, move them to the cooler side of the grill to finish cooking. Serve skewers warm with the dipping sauce made from the marinade.",
                "(New) Old School Lemon Meringue Pie: For the crust: Place the all-purpose flour, 1/4 cup rice flour, sugar, and 1/4 teaspoon salt in a food processor and pulse to combine. Add the cream cheese and pulse until fine crumbs form. Add the butter and pulse to pea-size coarse crumbs. Add the ice water and vodka, then pulse until combined. The dough will be light and fluffy but will not come together in a ball. There is no need to rest the dough or chill it before rolling.Lightly sprinkle some rice flour on your work surface and empty out the pie dough. Using your hands, form the dough into a round disk. Sprinkle a little more rice flour on top of the dough. Roll out the dough a little, then fold the dough in half. Repeat 2 more times. Roll out the dough into a circle a little bigger than a 9-inch pie pan. Transfer the dough to the pie pan. Crimp the dough edges and place in the freezer while the oven heats.Place a cookie sheet in the bottom third of the oven. Preheat the oven to 425 degrees F. Line the pie crust with parchment paper or nonstick foil and weight it down with pie weights or dried beans. Bake for 15 minutes. Remove the pie weights and parchment. Dock or prick the bottom of the crust with a fork. Reduce the oven temperature to 375 degrees F. Return the pie crust to the oven and bake an additional 15 minutes or until golden brown on the bottom and sides. Cool completely on a wire rack before filling. Meanwhile, make the lemon filling.For the lemon filling: Place 2 tablespoons water in a ramekin or small bowl. Sprinkle the gelatin over the top. Let stand 5 to 10 minutes to bloom.Place the sugar, cornstarch, lemon zest, and pinch of salt in a medium saucepan. Stir together. Add 1/2 cup water and stir until combined. Heat over medium-high heat, whisking often until it reaches a boil and thickens. Whisk in the lemon juice and cook for 1 minute longer. Remove from the heat. Whisk 1/4 of the hot liquid into the egg yolks, a little at a time. Return the tempered egg yolks to the saucepan. Cook, whisking, until the mixture comes to a simmer and thickens slightly, the mixture will be pretty loose at this point. Strain the lemon filling into a bowl. Whisk in the butter, one piece at a time, until incorporated. Add the gelatin. Stir until smooth, and then stir in the cream. Cover with plastic wrap and let cool at least 20 minutes.Pour the warm, but not hot filling into the cooled pie crust. Cover with plastic wrap and refrigerate for 4 hours or overnight until set.For the meringue: Place 2-inches water in a medium saucepan and bring to a simmer. Fit a bowl over the pan of simmering water, creating a double boiler. The bottom of the pan should not touch the water. Place the sugar, 1/2 cup egg whites, cream of tartar, and salt into the bowl. Whisk to combine. Cook, whisking constantly, until the sugar is dissolved and the eggs are foamy and warm, but not hot to the touch, about 5 minutes. Remove from heat. Whip the egg white mixture to stiff peaks using a mixer. Mound the egg whites over the pie and spread using the back of a spoon to create peaks.Brown the meringue using a kitchen blow torch, if desired or place the pie under a broiler to brown the peaks.Cream cheese and vodka help make an easy to roll and tender pie crust. A little rice flour decreases the gluten and adds a nice texture. There is no need to chill or rest the dough before rolling. Also, it is a breeze to roll out.Cornstarch prevents the egg yolks from curdling. Knowing when to add the lemon juice prevents a runny filling. A little unflavored gelatin makes the perfect filling... it is easy to slice without being too thick or gelled.Heating the egg whites and sugar together before whipping makes a more stable meringue and one that does not weep, bead or shrink!",
                "Glass Noodles with Chicken and Mushrooms: 1. In large bowl, soak noodles in warm water for at least 30 minutes. When softened, cut noodles into 4 to 5-inch lengths. In small bowl, toss chicken with 1 tablespoon Shaoxing wine, 1/2 teaspoon of grated ginger, and 1/4 teaspoon salt; set aside.2. In large wok or 12-inch nonstick skillet, heat 4 tablespoons oil over medium heat until shimmering. Add remaining grated ginger, cilantro stems, garlic, chilies, and 1 teaspoon salt. Cook, stirring, until beginning to turn golden, about 2 minutes.3. Add shiitake mushrooms and cook until softened and beginning to brown, about 5 minutes, adding another tablespoon oil if mixture is too dry. Add chicken and cook until almost cooked through, about 2 minutes. Stir in oyster mushrooms and celery. Cook for one minute.4. Stir in soy sauce, white pepper, chili flakes, remaining 2 tablespoons Shaoxing wine, and chicken broth. Bring to simmer. Increase heat to medium-high. Stir in noodles and green onions and cook, stirring, until mixture is well combined and noodles are cooked through, 3 to 5 minutes. Stir in cilantro leaves, season to taste, and serve.",
                "Persimmon Sundaes : Make deep cut in pointed end of each Hachiya persimmon. Spoon pulp from persimmon skin into food processor and puree until smooth. Measure 1 cup persimmon puree.Combine pear juice, brown sugar, and butter in heavy small saucepan. Bring to boil over medium heat, stirring until brown sugar dissolves. Boil until syrupy, about 4 minutes. Add 1 cup persimmon puree and stir until heated through (do not boil). Add cardamom to taste. (Persimmon sauce can be prepared 1 day ahead. Cover and refrigerate. Rewarm sauce before using.)Make sundaes with a scoop each of butter pecan and rum raisin ice cream, some persimmon sauce, and pecans.",
                "Parmesan-Basil Butter: 1. Combine butter, basil, Parmesan, lemon juice and zest, and garlic in the bowl of a food processor (see note) and pulse until garlic and herbs are chopped and lemon juice is incorporated. Season to taste with salt and pepper and pulse to combine. Wrap butter tightly and store in the refrigerator for up to 2 weeks or in the freezer for several months.",
                "Vanilla Bean-Nutmeg Shake with Blackberry Swirl: Combine blackberries and sugar in a small saucepan and cook, over low heat, until slightly thickened and sugar is dissolved. Mash the blackberries slightly with a fork and let cool.In a blender, combine 1/3 cup milk, 10 ounces of ice cream, vanilla bean seeds and the nutmeg and blend until smooth. Fill a tall milkshake glass 1/3 of the way with some of the milkshake, add a few tablespoons of the blackberry puree, fill 1/3 of the way with more milkshake, then a few tablespoons of the puree and finish with the remaining milkshake. Use a straw to stir and swirl the mixtures together. Garnish with a few fresh blackberries and serve.",
                "Buttery, Flaky Frangipane Puff Pastry Waffles: 1. Preheat a Belgian waffle iron according to manufacturer directions. In a stand mixer fitter with the paddle, combine almond meal, granulated sugar, flour, and salt and mix at low speed until blended. Add butter and egg and mix until frangipane is light and fluffy.2. Lightly dust a work surface. Lay out puff pastry sheet, lightly flour top, and roll into an approximate 16- by 16-inch square. Spread frangipane on puff pastry, leaving a 1 inch border on all edges.3. Roll puff pastry sheet away from you like a jelly roll. When completely rolled, pinch seam to seal. Pinch ends of puff pastry to seal, then roll into a disk-shaped spiral. Place spiral in center of preheated waffle iron. Cook until puff pastry is deep golden brown on all surfaces and an instant-read thermometer inserted into the center registers 200°F, about 12 minutes.4. Transfer to a cutting board, cut into wedges, dust with powdered sugar, and serve immediately.",
                "Lemon And Herb Roasted Chicken With Baby Potatoes: Preheat the oven to 400 degrees F.Rinse the chicken with cool water, inside and out, then pat it dry with paper towels. Season the cavity with salt and pepper, and then stuff the lemon, garlic, and herbs inside. Place the chicken, breast-side up, in a roasting pan. Tie the legs of the chicken together with kitchen twine to help hold its shape. Toss the potatoes around the chicken. Season the whole thing with a fair amount of salt and pepper and drizzle with olive oil. Roast the chicken and potatoes for 1 to 1 1/2 hours. Don't forget to baste the chicken with the drippings and rotate the pan every 20 minutes or so to insure a golden crispy skin. The chicken is done when an instant-read thermometer says 165 degrees F when inserted into the thickest part of the thigh (the legs of the chicken should wiggle easily from the sockets too.) Remove the chicken to a platter and let stand for 10 minutes, so the juices settle back into the meat before carving. Serve with the roasted potatoes on the side.",
                "Chocolate and Walnut Scones: 1. Preheat the oven to 375°F / 190°C. In a large mixing bowl, stir together the flour, sugar, baking powder, and salt. Using your fingers, crumble the butter into the dry mixture until you have a rough crumb, like tiny marbles coated in sand, then add the chocolate and walnuts and stir until mixed.2. In a medium bowl, stir together the buttermilk, egg, and vanilla. Slowly add the buttermilk mixture to the flour mixture and mix it with your hands, just until the dough comes together, taking care not to overwork it.3. With lightly floured hands, tip out the dough onto on a floured work surface and press it into a sheet about 1 inch / 2.5 centimeters thick.4. Using a sharp-edged pastry cutter, or a drinking glass if you don’t have one, cut circles in the dough. After you’ve cut as many as you can, pull the remaining dough together and repeat until all the dough is used.5. Bake the scones on an ungreased baking sheet for 15 to 20 minutes, or until lightly browned on top. Place the baking sheet on a cooling rack for 5 minutes, then transfer the scones to the rack to cool slightly. Serve while still warm, or store in a breadbox or an airtight tin for up to 5 days.",
                "Spicy Tortas de Milanesa: 1. For the Chipotle Mayonnaise: In a medium-sized bowl, combine the minced chipotle chile, lime juice, and mayonnaise. Season to taste with salt and pepper. Set aside.2. For the Torta: Pat the pork cutlets dry and season with salt and pepper. Add flour to one plate or shallow pie pan, eggs to second, and bread crumbs to third. Take one cutlet and toss it in the flour until covered. Shake off any excess, and dip the cutlet in the whisked egg. Let the excess drip back into the bowl, and then toss the cutlet in the breadcrumbs, pressing down on the breadcrumbs so it is completely covered. Repeat process with remaining cutlets.3. In a large cast-iron skillet, pour in enough oil to come 1/2-inch up the sides. Heat over medium-high heat until it reaches 350°F. Add as many of the breaded cutlets as will fit in a single layer. Cook until golden brown, two to three minutes a side. Adjust the heat as necessary to maintain the temperature. Drain the cutlets on paper towels. Repeat process with any remaining cutlets.4. Cut the rolls in half horizontally, and use your fingers to remove some of the soft insides. Spread some of the chipotle mayonnaise on the cut side of both the top and the bottom slices of each roll. Add the cooked cutlets on top of the bottom slices, and top each with a quarter of the lettuce, avocado, onion, and pickled jalapeno. Cap each with the top slice. Serve with sandwiches with lime wedges.",
                "Green Salad With Buttermilk Dressing: Puree 2 scallions, 1/2 garlic clove, 1/4 cup each buttermilk and plain yogurt, 2 teaspoons rice vinegar and 1/4 teaspoon each sugar and salt in a blender. Toss 2 heads butter lettuce, 1/2 cup shredded carrots, some fresh cilantro and parsley, and the dressing in a large bowl; season with salt and pepper.",
                "Chicken Primavera Spaghetti Squash Boats: Preheat oven to 400°. Drizzle cut sides of spaghetti squash with oil and season with salt and pepper. Place cut side down on a large, rimmed baking sheet. Roast until tender, 30 to 35 minutes. Let cool slightly. Using a fork, break up squash strands.Meanwhile, make primavera filling: In a large skillet over medium heat, heat oil. Add onion and pepper and cook until mostly tender, 3 to 4 minutes, then add tomatoes, zucchini, garlic, and lemon zest. Season with salt, pepper, and Italian seasoning and cook 3 to 4 minutes more. Stir in chicken and remove from heat.Divide mixture between spaghetti squash halves and stir to combine. Top each spaghetti squash with cheese and return to oven to melt, 5 minutes.Top with Parmesan and parsley to serve.",
                "Butterflied Chicken with Herbs and Cracked Olives : The night before you plan to grill the chickens, place them on a work surface, breast side up, and open them up against the surface as much as possible. Using your palms, press firmly on breastbone to flatten breast. You may hear a crack. This means you’re doing it right. Set chickens, breast side up, on a large rimmed baking sheet. Season generously on both sides with salt and black pepper. Chill, uncovered, at least 8 hours and up to 2 days.Remove chickens from refrigerator and set out on your counter. Combine garlic, Aleppo-style pepper, rosemary, and 1/4 cup oil in a small bowl. Rub chickens all over with mixture and let sit until room temperature, 1–2 hours.Prepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Set chickens, skin side down, on grate over indirect heat. Cover grill, placing cover vent (if your grill has one) over chickens so it draws heat up and over them. Grill, rotating chickens as needed so that they color evenly, until skins are lightly browned, 15–20 minutes.Turn chickens and continue to cook, covered, until skins are deep golden brown and crisp and an instant-read thermometer inserted into the thickest part of breasts registers 160°F, 20–25 minutes. Transfer chickens to a cutting board and let rest at least 10 minutes before carving.Mix olives, lemon juice, oregano, chopped parsley, remaining 1/4 cup oil, and any accumulated juices from chicken on the cutting board in a medium bowl. Season with salt.To serve, arrange carved chickens on a platter and top with olive mixture and parsley leaves.",
                "Cabbage and Carrot Slaw with Walnut-Za'atar Pesto : Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool. Process walnuts, garlic, cheese, and za'atar in a food processor until nuts are coarsely chopped. With motor running, stream in oil; process until coarsely ground. Season with salt.Pesto can be made 1 day ahead. Cover and chill.Place currants in a small bowl and cover with very hot water. Let sit until soft and plump, 5–10 minutes.Meanwhile, whisk yogurt, lemon juice, and oil in a large bowl; season with salt and pepper. Thin with water until dressing is consistency of heavy cream.Drain currants and add to dressing along with cabbage, carrots, and parsley; toss to coat. Season with salt.Swipe walnut pesto on a platter and arrange slaw over; sprinkle with za'atar.",
                "Man'oushe with Za'atar Oil, Tomatoes, and Cucumber: Whisk sugar, yeast, and ½ cup warm water (105°–110°) in a medium bowl until yeast is dissolved. Let sit until foamy, 5–10 minutes.Meanwhile, whisk salt and 3¼ cups flour in a large bowl. Make a well in the center and pour in yeast mixture, 2 Tbsp. oil, and ¾ cup warm water. Stir with a wooden spoon from the center out to gradually incorporate dry ingredients until you have a rough, shaggy dough.Turn out onto a work surface and knead lightly to bring together into a single mass. Continue kneading, adding flour as needed if sticky, until dough is smooth, supple, firm, and elastic, about 5 minutes. Place in an oiled bowl; turn to coat. Cover with plastic wrap and let sit in a warm spot until doubled in size, 1¼–1¾ hours.",
                "Chili Mac: In a large pot, boil pasta until al dente.Meanwhile, in a big, deep pot, brown beef in oil over medium high heat. Add onions, peppers, and garlic. Season meat mixture with chili powder, cumin, cayenne, and salt. Cook together 5 minutes, stir in beer or broth, and reduce liquid by half, 2 minutes. Stir in tomatoes and simmer for 10 minutes.Drain pasta. Add hot pasta to chili pot and stir to coat pasta evenly. Remove from heat and garnish big bowlfuls of chili mac with chopped scallions.",
                "Dairy-Free \"Parmesan\" Cheese: In a blender or food processor, pulse the cashews, nutritional yeast, garlic powder and salt until the mixture has the consistency of fine crumbs and resembles freshly grated Parmesan cheese, about 10 times. Refrigerate in an airtight container for up to 3 weeks.",
                "S'mores Eclairs: Preheat the oven to 425 degrees F.Sift the cocoa powder and flour together at least 3 times. Set aside. Place the water, butter, sugar, and salt in a heavy 2-quart saucepan. Bring this mixture just to a boil over high heat. Remove from heat and add the sifted cocoa and flour in all at once. Stir with a wooden spoon until the dough comes together to form a ball. Return the pan to medium-high heat and beat constantly until a film develops on the bottom of the pan, about 2 minutes. Do not let it burn.Transfer the dough to the bowl of an electric mixer with a paddle attachment. Add the eggs 1 at a time, beating well after each addition. Scrape down the side of the bowl and continue to beat the dough for 4 minutes at high speed. Transfer the dough into a piping bag fitted with a large star tip. Line a baking sheet with parchment paper and pipe 3 to 4-inch log shapes onto the paper. Bake for 10 minutes; then reduce the oven temperature to 325 degrees F. Bake for another 15 minutes. Turn the oven off. Remove the eclairs from the oven and poke a hole in each one using a skewer or piping nail. Place the eclairs back in the oven and leave the door ajar for 10 minutes, allowing the eclairs to dry.Cut the eclairs in 1/2 lengthwise with a serrated knife. Place the bottom halves of the eclairs on a sheet pan and put 3 marshmallows into each. Place under the broiler until golden, watching closely. Remove from oven. Place tops on and ladle the chocolate sauce over top.Place the chocolate in a stainless-steel bowl. Pour the heavy cream into a small saucepan over medium-high heat and heat the cream until just before the boiling point. Pour the cream over the chocolate and let sit for 1 minute. Whisk until smooth and glossy.",
                "Jerk Turkey Legs: Combine the oil, thyme, brown sugar, allspice, lime juice, garlic, chile peppers, ginger, scallions, 1 1/2 teaspoons salt and 1/4 teaspoon black pepper in a food processor and pulse until smooth.Coat the turkey legs in the jerk marinade and refrigerate at least 4 hours and up to overnight.Preheat the oven to 425 degrees F.Spread the turkey legs on a rimmed baking sheet and roast until the skin is golden brown all over and the turkey is cooked through (an instant-read thermometer inserted into the center of the meat, avoiding bone, should register at least 165 degrees F), 45 to 50 minutes.Serve the turkey legs topped with the cilantro, with lime wedges on the side.",
                "Bittersweet Amaro- and Whiskey-Spiked Coffee: 1. For the Spiked Whipped Cream (optional): Beat cream, Gran Classico, and sugar with a whisk, hand mixer, or stand mixer until stiff peaks begin to form. Set aside.2. For the Spiked Coffee: Fill two small mugs with boiling water to warm them. In a measuring cup, mix Averna, bourbon, crème de cacao, and Gran Classico. Stir well. When coffee is ready, dump hot water from mugs and divide bourbon mixture evenly between them. Add coffee and stir well. Top with whipped cream, if using, and serve.",
                "Chicken Under a Skillet with Lemon Pan Sauce: Place chicken on a work surface and use kitchen shears to snip off wing tips (they get in the way of the breasts during cooking; save them for stock). Turn chicken breast side down and use shears to cut along both sides of the backbone to remove it (save for stock along with those wing tips).Photo by Laura MurrayOpen up chicken and use the tip of a knife to cut a shallow line along either side of the rectangular bone and strip of cartilage in the middle of breast. Turn chicken skin side up and press down on center of breast to flatten chicken—you should hear the breastbone crack.Photo by Laura MurraySeason generously on both sides with salt and pepper and let sit at room temperature at least 20 minutes and up to 1 hour.Preheat oven to 350°. Heat a dry large cast-iron skillet over medium. Pat chicken dry with paper towels and season all over again with a light sprinkling of salt. Add oil to skillet, then chicken, arranging skin side down. Cover the bottom of another smaller cast-iron skillet with foil and place over chicken to weigh it down.Photo by Alex Lau, styling by Claire SaffitzCook, peeking under foil and lifting chicken a bit to check, until skin is deep golden brown and crisp all over, 15–18 minutes. Remove top skillet and turn chicken skin side up. Transfer skillet to oven and roast chicken just until cooked through (an instant-read thermometer inserted into the thickest part of breast should register 160°), 15–20 minutes. Carefully remove skillet from oven and place chicken skin side up (to preserve that crispness) on a plate to rest.Photo by Alex Lau, styling by Claire SaffitzSet skillet over medium-low heat and add shallot and red pepper flakes. Cook, stirring often, until shallot is softened and golden, about 3 minutes. Add wine and lemon juice and swirl skillet to emulsify. Reduce heat to low and add butter; cook, swirling to combine, until melted. Pour in juices that have pooled under chicken on plate; mix in parsley. Return chicken to skillet to serve.",
                "Sausage-Stuffed Mushrooms: Preheat the oven to 350 degrees F.Wipe off or wash the mushrooms in cold water. Pop out the stems, reserving. Chop the mushroom stems finely and set aside.Crumble the sausage into a hot dry skillet and cook until browned, 6 to 8 minutes. Set aside on a plate to cool.Add the rosemary, sage, garlic and onions to the same skillet; cook for 2 minutes over medium-low heat. Pour in the wine to deglaze the skillet, allowing the liquid to evaporate for a couple of minutes. Add the chopped mushroom stems and cook, stirring, for 2 minutes. Add salt and pepper to taste. Set the mixture aside on a plate to cool.In a bowl, combine the cream cheese and egg yolk. Add the Cheddar cheese and mix. Add the sausage and mushroom stems and stir together.Arrange the mushroom caps on a baking sheet. Spoon some of the sausage mixture into the cavity of each mushroom, filling the cap and creating a sizable mound over the top. Bake until golden brown, 20 to 25 minutes. Sprinkle with the chives."
            ]
        }, {
            "tag": "comfort",
            "patterns": [
                "Chewy Coconut–Chocolate Chip Cookies : In a medium bowl, whisk together the flour, oats, coconut, baking soda, and salt.In a stand mixer fitted with the paddle attachment, cream the butter, brown sugar, and granulated sugar on medium-high speed fluffy and yellow.Add the vanilla and the eggs, one at a time, beating after each addition for 30 seconds.Reduce the speed to medium-low and add the flour mixture in three parts, beating for about 10 seconds after each addition. Add the chocolate chips and mix until just combined.Cover the bowl with plastic wrap and refrigerate for at least 30 minutes or overnight. Preheat the oven to 350°F. Line a rimmed baking sheet with parchment paper.Scoop out portions of dough the size of golf balls, roll them between your palms loosely, and place them 2 inches apart on the baking sheet (you’ll need to bake the cookies in several batches). Bake for 14 minutes, or until the cookies are set around the edges. Halfway through baking, remove the pan from the oven and drop it onto a heat-safe flat surface, such as the open oven door (this deflates the cookies, creating a deliciously chewy center and crisp edges—in other words . . . perfect!). Immediately return the cookies to the oven, rotating the pan 180 degrees, and complete baking, until the center resists light pressure but is still somewhat soft.Let the cookies cool on the baking sheet for 5 minutes, then transfer them to a wire rack to cool completely. Repeat to make the rest of the cookies.To store extra dough and make future cookie baking a breeze, roll out balls and freeze them on a cookie sheet. Once they’re set, transfer them to a resealable freezer bag or airtight container and keep them frozen for up to 3 months. Let the dough balls sit out at room temperature for 15 minutes before baking as usual.",
                "Tex-Mex-Style Beef Enchiladas: Toast flour in a large skillet over medium-high heat, stirring frequently, until golden brown and smells like toasted nuts, about 10 minutes. Transfer to a plate; wipe out skillet.Heat 2 Tbsp. oil in same skillet over medium-high. Add ground beef and cook, stirring to break up clumps, until browned, about 10 minutes. Using a slotted spoon, remove beef and reserve drippings in skillet.Cook onion, jalapeño, poblano chile, and garlic in same skillet, stirring and scraping up any browned bits, until softened, about 10 minutes. Add tomatoes, season with salt, and continue cooking until most of the liquid has evaporated and tomatoes begin to stick to the skillet, about 8 minutes. Add chili powder and cumin and cook, stirring frequently, until very fragrant, about 1 minute. Add reserved beef and toasted flour and toss until coated.Whisking constantly, add broth, bring to a boil, and continue to whisk until no lumps remain. Reduce heat to medium and cook until chili gravy has thickened and beef is tender, 30–35 minutes; season with salt. Strain through a fine-mesh sieve into a large bowl; set beef and gravy aside separately.Meanwhile, preheat oven to 425°. Heat remaining 1 cup oil in a medium skillet over medium-high until oil bubbles immediately when edge of tortilla touches the surface. Working one at a time, fry tortilla, turning once, until just starting to brown and crisp, about 10 seconds per side. Transfer tortilla to paper towels to drain. Repeat with remaining tortillas.Dip both sides of each tortilla in chili gravy just to coat, then transfer to a rimmed baking sheet. Spread 1 cup gravy lengthwise down the center of a 13x9\" baking dish. Working one at a time, spread ¼ cup beef mixture down the center of tortilla and fold one side over filling, then continue to roll enchilada onto itself. Place seam side down in prepared baking dish as you go (enchiladas should be nestled right up against each other). Top with cheese and remaining gravy. Bake until sauce is bubbling and cheese is beginning to brown, 20–25 minutes. Let sit 10 minutes before serving.",
                "Chinese-Style Deep-Fried Salty Shrimp: 1. Heat two tablespoons of oil in a wok over medium heat until shimmering. Add the garlic, scallions and let brown, stirring occasionally, 3 to 5 minutes. Add the chili pepper flakes if using and stir until aromatic, about 30 seconds. Transfer oil and aromatics to a large metal bowl. Wipe wok clean with paper towel.2. Add remaining oil to wok and heat to 375°F over medium heat. Meanwhile, combine egg and cornstarch in a medium bowl. Add shrimp and toss to coat. When the oil is ready, add half of the shrimp, dropping them into the oil one at a time. Cook, agitating and flipping shrimp frequently until crisp and just cooked through, 2 to 3 minutes total. Transfer shrimp to a paper towel-lined plate and repeat with remaining batch.3. Add drained fried shrimp to bowl with browned aromatics. Season to taste with salt, pepper, and optional additional seasonings. Serve immediately.",
                "Mac And Four Cheeses: Cook the macaroni according to the package directions in lightly salted water, leaning toward the al dente side. Do not overcook!Put the cream, butter and garlic clove into a Dutch oven and heat on the stove over low heat. When the cream is hot, add the fontina, goat cheese, Parmesan and Romano.Drain the macaroni (reserving some of the cooking water if needed) and add it to the pot. Stir gently to combine, adding hot macaroni water as needed for consistency. Don't overmix; if there are little clumps of cheese here and there, it's fine! Taste and add about 1/2 teaspoon salt if needed. Add some pepper and minced parsley and stir. Serve immediately.",
                "Caramel Apples: Add the sugar, corn syrup and 1/2 cup water to a small saucepan over medium-high heat. Stir a few times before the sugar begins to boil to combine the ingredients. Attach a candy thermometer to the inside of the pan and bring the syrup to a boil. Cook until the syrup begins to turn an amber color, then swirl the syrup to even out the color. Continue to cook until the syrup is a deep amber and the thermometer reads between 375 and 380 degrees F, then remove from the heat. Carefully pour in the cream and gently whisk to combine. Stir in the butter, vanilla and a pinch of salt until smooth. Keep off the heat but keep the thermometer attached to the pan.Pierce the apples through the stem ends about halfway through with candy apple sticks. Line a baking sheet with parchment and lightly spray with nonstick cooking spray.When the temperature of the caramel reads around 190 degrees F, dip an apple, using the stick as a handle and swirling to coat completely. Allow excess caramel to drip off the bottom and use a spatula to help remove any large amount of caramel, as it will pool around the apple when you set it down to cool on the lined baking sheet. Repeat with the remaining apples, gently heating the caramel on the stovetop over low heat, stirring, if it gets too thick for dipping. Allow the caramel to set and cool completely before serving or wrapping apples, about 1 hour. (See Cook's Note.)",
                "Bake the Book: Ultrathin Chocolate Chunk Cookies: 1. Preheat the oven to 325°F. Position racks in the upper and lower thirds of the oven.2. Combine the flour and baking soda in a small bowl and mix together thoroughly with a whisk or fork.3. In a large bowl, whisk together the melted butter, oats, sugars, corn syrup, milk, and salt. Mix in the flour mixture. If the batter is warm from the butter, let it cool before adding the chocolate. Stir in the chocolate chunks. If possible, let the dough rest for at least several hours at room temperature or (better still) overnight in the fridge. The rest makes for an especially crisp and extra-flavorful cookie!4. Divide the dough into 15 equal pieces. Lay out 3 sheets of aluminum foil, cut to fit your cookie sheets, on the counter. Arrange 5 pieces of dough (4 in a square and 1 in the center) well apart on each sheet of foil, remembering that the cookies will spread to 5 inches. Flatten each piece of dough until it is about 3 1/2 inches in diameter. Slide two of the sheets onto baking sheets.5. Bake for 20 to 25 minutes, until the cookies are thin and very brown. If they are too pale, they will not be crisp. Rotate the pans from top to bottom and front to back halfway through the baking time to ensure even baking. Slide the foil with cookies onto racks to cool completely before removing the cookies from the foil. Repeat with the third batch—you can even slide the next foil and cookie dough onto a hot baking sheet as long as you put the pan in the oven immediately. Cool the cookies completely before stacking or storing. May be kept in an airtight container for at least 3 days.",
                "Ice Cream Sundae Pizza: Preheat the oven to 350 degrees F. Lightly grease a round 14-inch deep-dish pizza pan.In a medium bowl, combine the butter and chocolate. Microwave on high, in 30-second intervals, stirring between each, until the chocolate is melted and smooth, about 1 minute 30 seconds total.In a large bowl, beat the sugar and eggs at medium-high speed with an electric mixer until fluffy. Gradually beat in the flour and salt. Stir in the melted chocolate and vanilla extract. Pour the batter into the prepared pan, and bake until a toothpick inserted into the middle comes out clean, 16 to 18 minutes. Let cool completely.Spread the softened ice cream evenly over the cooled brownie, to the edges of the pan. Freeze for 2 hours or up to 2 days.Top the pizza with the caramel flavored ice cream topping, toasted coconut, cherries, hot fudge flavored topping, peanuts, pretzels, raspberries, strawberry flavored ice cream topping and whipped cream. Cut into wedges to serve.",
                "Easy Peach Sorbet: 1. Combine peaches, lime juice, and sugar in a food processor and purée until very smooth with no large chunks. You should have about 1 quart of purée. Pour through a fine mesh strainer into an airtight container and add salt to taste. Press a piece of plastic wrap against surface of purée and chill for 2 to 3 hours, or until very cold.2. Churn in an ice cream maker according to manufacturer's instructions. Transfer to a container and chill in freezer for 2 to 3 hours, or until firm.",
                "Black Bean, Corn, and Turkey Chili: Heat the oil in a 4-quart saucepan over medium-high heat. Add the turkey, onion, chili powder, cumin, oregano, black pepper, and garlic powder. Cook until the turkey is well browned, stirring often to separate meat.Stir the stock, salsa, sugar, beans, and corn in the saucepan and heat to a boil. Reduce the heat to low. Cover and cook for 30 minutes or until the mixture is hot and bubbling. If using Swanson® Natural Goodness Chicken Broth each serving contains: Calories 288, Total Fat 10g, Saturated Fat 2g, Cholesterol 61mg, Sodium 907mg, Total Carbohydrate 31g, Dietary Fiber 7g, Protein 20g, Calcium 5%DV",
                "Boiled Coke with Ginger and Lemon: 1. Add coke, ginger, and lemon to a medium saucepan. Bring to a boil over high heat, then adjust heat to maintain an active simmer. Simmer until reduced by 15 to 20 percent, 5 to 10 minutes. Pour into cup (through a fine mesh strainer if desired). Let cool at room temperature for a few minutes and serve.",
                "Spice Roll-Out Cookies : Sift flour, ginger, cinnamon, baking soda, salt, allspice, nutmeg, mustard, and cloves into large bowl. Using electric mixer, beat butter in another large bowl at medium speed until smooth and creamy, about 2 minutes. Add brown sugar; beat 1 minute. Add molasses; beat until fluffy, about 2 minutes. Add egg; beat until well blended, about 1 minute. Reduce speed to low; beat in vanilla. Add flour mixture; beat on low speed just to blend. Gather dough into ball; divide in half. Form each half into ball; flatten into disk. Wrap disks separately in plastic; chill until firm, at least 4 hours. DO AHEAD: Can be made 2 days ahead. Keep chilled.Position rack in center of oven; preheat to 350°F. Line 2 baking sheets with parchment paper. Working with 1 disk at a time, roll out dough between 2 sheets of waxed paper to 1/8-inch thickness for smaller (2-inch) cookies and 1/4-inch thickness for larger (3- to 4-inch) cookies. Using decorative cookie cutters, cut out cookies and transfer to prepared sheets, spacing 1 inch apart. If cookies become too soft to transfer to baking sheets, place in freezer on waxed paper for 5 minutes before continuing. Gather scraps, roll out dough, and cut more cookies, repeating until all dough is used. If not icing cookies, decorate with sprinkles or other sugar toppings, if desired. Bake 1 sheet at a time until cookies are firm on top and slightly darker around edges, about 8 minutes for smaller cookies and up to 12 minutes for larger cookies. Cool completely on rack. Line baking sheets with fresh parchment as needed. Decorate cookies with Royal Icing, then sprinkles or other sugar toppings, if desired. Let stand until icing sets. DO AHEAD: Cookies can be made 4 days ahead. Store between sheets of waxed paper in airtight containers at room temperature.",
                "DIY Blueberry Cereal Bars: 1. Measure flours, oats, wheat bran, brown sugar, baking power, salt, and cinnamon into the bowl of a food processor and pulse until ingredients are mixed and oats broken down. Add butter and pulse until pieces resembles coarse meal, 8 to 10 one-second pulses.2. Stir vanilla into the milk and, with processor motor running, add liquids to the dry ingredients in a thin stream. Continue processing until dough comes together. Divide into two equal portions and flatten into 1/2-inch discs. Wrap each portion in plastic and refrigerate until firm enough to roll out, about two hours.3. Meanwhile, make the filling. Place blueberries and water into a small, heavy-bottomed sauce pan and bring to a boil. Reduce heat and simmer gently, covered, for 20 minutes, stirring occasionally. Transfer fruit and water to a food processor and process until broken down into a rough purée. Transfer filling to a bowl, cover, and refrigerate until needed.4. When ready to assemble the bars, adjust oven rack to center position and preheat oven to 350°F.5. Flour rolling surface and place one portion of the dough in the center. Flour top of dough and roll into an 8- by 12-inch rectangle, turning regularly to prevent sticking. Cut dough in half the long way to create two 4- by 12-inch sheets. To aid with filling and shaping the bars, place each strip of dough on a similarly sized piece of baking parchment before proceeding. Brush any excess flour from dough surface with a dry pastry brush.6. Spread an even 1-inch strip of filling (about 2 1/2 tablespoons) down the 12-inch center line of each piece of dough. Using the edge of the parchment as an aid, fold one long side of the dough over the filling, covering it slightly more than half way. Brush a light coating of the egg wash over the remaining edge and, again using the parchment to help keep things even, fold the second dough edge so that it overlaps the first by 1/4 inch. Press gently to seal and flip the bars over so that they are seam-side down. Cut each log into three 4-inch portions.7. Brush any excess flour from dough surface with a dry pastry brush. Coat each bar with a thin layer of the egg wash and sprinkle tops with wheat bran. Leave bars on parchment strips and transfer to baking sheet.8. Repeat steps five through seven with remaining dough and filling.9. Bake bars until just golden, 16 to 18 minutes. Transfer to a wire rack until cool. Store at room temperature in an air-tight container for up to 5 days",
                "Raspberry-Campari Sorbet: 1. In a blender combine raspberries, sugar, water and Campari. Blend on medium until raspberries are completely pureed, 30 seconds to 1 minute. Pour through a fine mesh strainer into a measuring cup, pressing on strainer with a spoon to separate juice from seeds. Measure out 3 cups of puree and discard remainder.2. Transfer puree to a mixing bowl and stir in orange zest, then add salt, followed by lemon to taste. Cover mixture and chill in refrigerator until very cold, about 2 hours, and churn in ice cream maker according to manufacturer's instructions. Transfer sorbet to an airtight container and chill in freezer for at least 4 hours before serving.",
                "Creamy Tex-Mex Chicken Enchiladas Verdes: 1. Place chicken in a medium stockpot and cover with water. Add bay leaves, quartered onion, and peppercorns, and bring to a boil over medium heat. Simmer until chicken is no longer pink and is cooked through, about 15 minutes.2. Remove chicken from liquid. Discard stock or save for another use. Using two forks or your hands, shred the chicken, discarding any fatty or tough parts. Place in a large bowl, along with cream cheese, sour cream, milk, chilies, and taco seasoning. Stir to combine and set aside.3. Adjust oven rack to lower-middle position and preheat oven to 375 °F.4. Heat oil in a large saucepan over medium heat. When oil is shimmering, add onion and garlic and cook, stirring occasionally, until translucent, about 7 minutes. Add enchilada sauce, salsa, and tomatoes. Season with salt, stir and simmer for 20 minutes.5. Spray a 13- by 9-inch baking pan with cooking spray. Spread one ladleful of sauce on the bottom of the pan. Working one at a time, dip enchiladas in sauce to coat and spoon about 1/3 cup of filling along the center of the tortilla. Roll tortilla over filling and place seam-side down in the prepared baking pan. Repeat the process until filling is gone, tightly packing enchiladas side by side in a row. Top with cheese and transfer to the oven to bake until brown and bubbly, about 35 minutes.6. Remove from oven and let rest for 10 minutes. Serve with sour cream and limes.",
                "Three-Cheese Garlic Bread: Position rack in center of oven and preheat to 475°F. Mix first 3 ingredients in medium bowl. Mix in feta, 1/2 cup Parmesan, Jack cheese, and onions. Spread 2 tablespoons cheese mixture onto each bread slice. Top each with 1 tablespoon Parmesan; press to adhere. Place on baking sheet. Sprinkle lightly with salt and pepper. Bake until cheese is golden and bubbly, about 12 minutes.",
                "Butterscotch Pie with Curry Crust: Place a rack in middle of oven and preheat to 325°. Toast fennel seeds in a small dry skillet over medium heat, stirring often, until fragrant, about 2 minutes. Transfer to a small plate; let cool, then finely chop.Pulse cookies in a food processor until very fine crumbs form (you should have about 2 cups). Add fennel seeds, flour, raw sugar, curry powder, and salt and pulse to combine. Add butter and pulse until mixture is the consistency of wet sand.Transfer mixture to a 9” pie dish. Using a measuring cup, press firmly onto bottom and up sides of pie dish. Place pie dish on a rimmed baking sheet and bake crust, rotating halfway through, until dry and set, 20–25 minutes. Transfer pie dish to a wire rack and let crust cool.DO AHEAD: Crust can be baked 1 day ahead. Store wrapped tightly at room temperature.",
                "Monster Cookies: 1. Move oven rack to the center position and preheat oven to 350°F. Prepare two large baking sheets with parchment paper. In a large bowl whisk together flour, baking soda, cinnamon, and salt. Set aside.2. In the bowl of an electric stand mixer fitted with a paddle attachment, cream the butter and sugars together on medium speed until fully incorporated. Add peanut butter and vanilla, and mix on medium speed until incorporated, scraping down the sides of the bowl as needed. Add eggs, mix until incorporated, then slowly incorporate the flour mixture on low speed. When just combined stir in oats, 3/4 cup M&Ms, and chocolate chips. Cover and chill the dough for 30 minutes.3. Use a large spoon or ice cream scoop to scoop twelve equally sized cookies and space a couple inches apart on the baking sheets. Use the back of the spoon to press down on the cookies lightly spreading them into a circle about 2 1/2-inches in diameter. Cookies will continue to spread slightly in the oven. Lightly press the remaining M&Ms into the tops of the cookies. Bake for 12-13 minutes or until edges are light golden brown. Do not over bake. Remove from oven and cool in pan for 3 minutes then transfer to a wire rack to cool completely. Store in an airtight container to retain freshness.",
                "Fried Coke: 1. In a small saucepan heat 1 1/2 cups of Coca Cola over medium high heat until it reduces to just 1/2 a cup of cola concentrate, about 15 minutes. Remove from heat and set aside to cool. While coke is reducing, whip cream and granulated sugar in a stand mixer or by hand until stiff peaks are formed. Combine confectioner's sugar and cinnamon in a large bowl and set aside.2. Heat oil to 360°F in a large Dutch oven and adjust flame to maintain temperature. While oil is heating prepare the fritter batter.3. In a large bowl whisk together remaining 1/3 cup of Coca Cola with vanilla. Stir in Bisquick to form a sticky dough. Sprinkle surface of dough with flour until a pliant and less sticky dough forms. Turn the dough out onto a generously floured surface. Flatten the dough into a large square about 1/2' thick and cut into 3/4' square pieces. Roll each square into a little ball.4. One at a time, place the balls in a shallow heat-resistant strainer then carefully transfer to the hot oil, cooking no more than 4 at a time. Fry for 1 to 2 minutes or until golden on the bottom. Then using heat resistant strainer or tongs, carefully turn fritters and fry until golden brown on second side, about 1 minute longer. Use strainer to remove fritters from hot oil. Transfer to a paper towel lined wire cooling rack. Repeat, cooking in batches, until all the dough balls have been fried.5. Toss fritters in cinnamon sugar. Divide the fritters among four low ball glasses, drizzle fritters with Coke concentrate then top with whipped cream and a cherry. Serve immediately.",
                "Sweet and Smoky Popcorn: Pop the popcorn according to the package directions, and pour it onto a sheet pan. Drizzle with melted butter and sprinkle with Parmesan and chili powder. Add salt, to taste. Toss to combine. Serve warm."
            ]
        }, {
            "tag": "traditional",
            "patterns": [
                "Herbes de Provence Rotisserie Chickens : Place butter, herbes de Provence, and salt in small bowl; mash with fork until blended to thick granular paste. Starting at neck end of each chicken, carefully run fingers under skin of breasts to loosen. Starting at each side of main cavity, carefully run fingers under skin of thighs to loosen. Rub herb-seasoned butter on chicken under loosened skin and on outside of each chicken. Truss chickens by tying legs together and tying wings flush to sides. Enclose chickens in extralarge resealable plastic bags. Chill at least 6 hours. DO AHEAD Chickens can be prepared 1 day ahead. Keep refrigerated. Let chickens stand at room temperature about 30 minutes before cooking.Remove spit from rotisserie attachment and prepare barbecue (medium-high heat). Thread chickens on spit, pushing close to center. Reattach spit to motor. Place shallow disposable foil pan(s) under chickens for drips. Close grill, inserting stem of instant-read thermometer through hole in hood of grill to monitor temperature. Maintain temperature at around 400°F by opening vents to increase heat and closing vents to reduce heat. Cook chickens until thermometer inserted into thickest part of thigh registers 170°F, about 50 minutes. Turn off grill, but do not open. Let chickens rest in covered grill 10 minutes.Slide chickens off spit and onto platter. Cut each chicken into 6 or 8 pieces and arrange on platter.If using a charcoal grill,arrange coals on either side of a disposable aluminum baking pan, dividing coals equally. If using a three-burner gas grill, light burners on left and right, leaving center burner off. If using a two-burner gas grill, light burner on side opposite disposable pan. Insert an instant-read thermometer into top vent of grill or place oven thermometer inside grill on grate over pan. Bring temperature to 350°F to 375°F. Place chicken on grate above pan. Close grill. Adjust grill vents or heat setting as needed to maintain temperature.",
                "Crudites Slaw with Honey-Mustard Dressing: Pulse the crudites in a food processor until chopped into about 1/4-inch pieces (some will remain a little bigger--that is okay).Combine the mustard, honey, vinegar, sour cream, 1/4 teaspoon salt and a few grinds of black pepper in a large bowl. Add the chopped vegetables and toss well to coat. Transfer to a serving bowl.",
                "Jiaozi Dumplings : To make the filling, toss the cabbage and salt together in a large bowl and let sit for 15 minutes. Drain the cabbage in a colander over a sink and use your hands to squeeze out excess moisture.In a large mixing bowl, combine the cabbage, pork, soy sauce, rice wine, sesame oil, ginger, green onions, and pepper. Stir in one direction with a chopstick until just mixed.To form the dumplings, rest a wrapper in the palm of your hand and place a heaping teaspoon of filling in the center. Dip your finger in a bowl of water and run it around the edge to help make a good seal. Lightly fold the wrapper over on itself but don't touch the edges together. Starting at one end, use your fingers to make a small pleat on the side of the wrapper closed to you, then press the pleat into the other side and pinch together firmly. Keep making pleats down the dumpling opening in this way until completely sealed. Repeat this process with the remaining filling and wrappers.Bring a large pot of water to a boil. Drop half of the dumplings into the water and stir once so they don't stick together. When the water boils again, add 1 cup of cold water to the pot. Then when it boils again, add 3 cups of cold water. The third time the water boils, the dumplings are cooked. Remove them with a slotted spoon and repeat with the remaining dumplings. Serve immediately with small bowls of Chinese black rice vinegar for dipping.",
                "Poached Oranges with Candied Zest and Ginger : Peel ginger and halve crosswise. Cut pieces lengthwise into 1/16-inch-thick slices, then cut slices into 1/8-inch-wide julienne strips and transfer to a 2-quart heavy saucepan.Remove zest from 3 oranges in long wide strips with a vegetable peeler, removing any white pith from zest with a paring knife, and add to ginger in pan. Fill pan three-fourths full with cold water and bring to a boil. Boil 1 minute, then drain in a sieve. Return zest and ginger to pan and refill with cold water. Bring to a boil, then reduce heat and simmer, uncovered, 10 minutes. Drain zest and ginger. Repeat simmering with more cold water for another 10 minutes, then drain.Bring 1 1/2 cups water, 1 cup sugar, and salt to a boil in saucepan, stirring until sugar is dissolved. Add zest and ginger and gently simmer, uncovered, stirring occasionally, until zest and ginger are completely translucent and syrup is thickened, 15 to 20 minutes. Drain candied zest and ginger in a sieve, discarding syrup.Meanwhile, cut 1/2 inch from top and bottom of all oranges with a sharp knife, exposing fruit at both ends. Cut peel and pith from sides (leaving no white parts) with paring knife, trimming fruit if large (but retaining orange shape) to 2 1/2 to 2 3/4 inches wide at middle. Discard trimmings.Bring wine, orange juice, 1/2 cup Grand Marnier, and remaining cup sugar to a boil in a deep 12-inch heavy skillet, stirring until sugar is dissolved, then boil 3 minutes. Add oranges, arranging in 1 layer, and simmer, covered with a tight-fitting lid, 10 minutes. Transfer oranges with a slotted spoon to a serving dish, inverting them (so syrup coats oranges). Add candied zest and ginger to syrup and boil over moderate heat, uncovered, until syrup is thickened and mixture is reduced to about 1 1/4 cups, 10 to 15 minutes. Remove from heat and stir in remaining 2 tablespoons Grand Marnier.When oranges are cool enough to handle, cut each crosswise into thirds on a cutting board, then reassemble \"whole\" in serving dish. Spoon zest mixture, including syrup, over oranges, arranging zests and ginger decoratively over them. Chill oranges in serving dish until cold, at least 1 hour.Just before serving, spoon syrup in dish over oranges to coat. Serve chilled or at room temperature.",
                "Classic Skillet Cornbread : Preheat oven to 375°F. Set dry skillet over low heat to heat while you make the batter. Whisk cornmeal, baking soda, and salt in a medium bowl. Make a well in the center and add egg and buttermilk, then whisk vigorously, starting in the center to incorporate egg and working your way out, until dry ingredients are incorporated and batter is smooth.Increase heat to medium-high and add bacon fat to skillet. Swirl to coat bottom and sides of skillet. Whisk batter once more to reincorporate, then pour into skillet and smooth top (batter will sputter around edges).Bake cornbread in oven until the edges are golden brown and the top is golden, cracked in places, and firm to the touch, 25–30 minutes. Let cool in pan at least 5 minutes before cutting into wedges. Serve with Hot Honey Butter.Cornbread can be baked 8 hours ahead. Let cool; store tightly wrapped at room temperature.",
                "Farro-Vegetable Hash With Chermoula: Toast coriander seeds and cumin seeds in a dry small skillet over medium-high heat, tossing occasionally, until fragrant and just beginning to take on color, about 3 minutes. Transfer to a spice mill or mortar and pestle and let cool. Add peppercorns and finely grind; set aside.Purée cilantro, parsley, mint, 1 Tbsp. lemon juice, and ¼ cup water in a blender, adding more water 1 Tbsp. at a time if needed, until a coarse purée forms. Transfer to a small bowl. Add oil, lemon zest, red pepper flakes, and reserved spice mixture. Season chermoula with salt and more lemon juice if needed.",
                "A  Jolly Good Mince Pie : Cut the butter and lard into small pieces and rub it into the flour with your fingertips until you have what looks like coarse, fresh breadcrumbs. If you do this in the food processor it will take a matter of seconds. Add the egg yolk, then mix briefly with just enough cold water to bring to a smooth dough. You will probably need only one or two tablespoons. Bring the dough together into a firm ball, then knead it gently on a floured board for a couple of minutes until it softens. Reserve half of the dough, then roll the remainder out thinly. Set the oven at 400°F/200°C/Gas 6.Using cookie cutters or the top of an espresso cup, cut out eighteen discs of pastry: (There may be a tiny bit left over.) Place twelve discs of the pastry in the tartlet tins, reserving six for the second batch, smoothing them up the sides so the edges stand very slightly proud of the tin. Fill each one with a dollop of mincemeat. A level tablespoon is probably all you will get into them, unless you have especially deep tins. Be generous. Roll out the reserved pastry with any leftover trimmings and make a further eighteen discs of pastry, reserving six again. Slightly dampen each of these round the edge with cold water then lay them over each tart and press firmly to seal the edges.Using the point of a small kitchen knife cut a small slit in the centre of each pie and bake for twenty minutes until golden. Let them cool for a few minutes, then slide them out of their tins with a palette knife and serve warm, dusted with powdered sugar. Repeat with the remaining pastry discs and mincemeat.",
                "Dad's Mashed Potato Salad: Cover the potato chunks with cold water in a large saucepot. Bring to a boil and cook until the potatoes are fork-tender. Drain and return the potatoes to the pot. Add the butter, salt, pepper and nutmeg. Mash with a potato masher or electric hand mixer (essentially you are making mashed potatoes), adding warm half-and-half as needed until the potatoes are smooth and creamy. You should have a little over 6 cups of mashed potatoes.Add the Miracle Whip, mustard, celery, onion, pickles, pickle juice, and sugar, mixing after each addition. Stir in the eggs until combined. Chill at least 1 hour or make the night before and refrigerate. Sprinkle with the chopped freshly parsley before serving.",
                "Garlic Grits Casserole: Preheat the oven to 350 degrees F. Grease a 9-by-12-by-2-inch casserole dish.Cook the grits in the boiling water with the salt until thickened, about 5 minutes. Add the cheese and butter to the hot grits and stir until melted and incorporated. Beat the eggs and add the milk to the beaten eggs. Slowly stir the egg mixture into the grits. Pour the mixture into the prepared dish. Pour the melted butter over the cornflakes and stir to distribute the butter. Sprinkle the crumb mixture on top of the grits. Bake for 45 minutes.",
                "Collard Greens Salad With Fried Plantain and Sumac: Heat vegetable oil in a small skillet, preferably cast iron, over medium-high. Cook plantain, stirring often and reducing heat if needed, until light golden, about 2 minutes. Transfer to paper towels to drain. Let cool 10 minutes. Reserve skillet.Smash each plantain slice with a flat-bottomed measuring cup. Return to skillet and set over medium-high heat. Fry, stirring occasionally, until browned, about 2 minutes. Return to paper towels; season generously with salt.Meanwhile, whisk olive oil, vinegar, lime juice, sumac, mustard, and molasses in a large bowl to combine; season with salt. Add collard greens, fennel bulb, and shallot; toss to coat. Let sit until softened slightly, about 10 minutes. Taste and season with more salt if needed.To serve, toss plantain and blueberries into salad. Divide among bowls and top with fennel fronds.",
                "Fried Bologna Sandwich: Mix mustard, mayonnaise, and chopped pickles in a small bowl to combine; season with pepper.Arrange half of bologna slices in a neat stack. Starting near the center and working toward the edges of the stack, cut four 1\"-long slits, spacing evenly. Repeat with remaining bologna.Chelsie CraigHeat a dry large skillet, preferably cast iron, over medium-high. Working in batches, arrange bologna slices in a single layer in skillet and cook until browned all over and crisp, about 2 minutes per side. Transfer to a plate as they are done. Save skillet with any fat.Arrange bread in a single layer in reserved skillet and cook over medium high until golden brown, about 2 minutes per side. Transfer to a cutting board.To build sandwiches, spread mustard mixture evenly over each slice of bread. Divide bologna between 2 slices and top with lettuce; drizzle with pickle brine. Close up sandwiches and cut in half.",
                "Smoked Bologna: 1. Score entire bologna with a paring knife 1/2 an inch deep about every inch horizontally and vertically.2. Brush bologna all over with mustard, and sprinkle with barbecue rub.3. Fire up smoker or grill to 225°F, adding chunks of smoking wood chunks when at temperature. When the wood is ignited and producing smoke, place bologna in the smoker or grill, and smoke until outside has darkened, 2 to 3 hours. Remove from smoker, let cool for 5 to 10 minutes, then slice and serve.4. To make crispy smoked bologna sandwiches: Light one chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Place bologna slices on grill and cook until browned and crisp on both sides, 2 to 3 minutes per side. Transfer to a roll and top with mustard barbecue sauce.",
                "Chicken and Corn Soup with Chile-Mint Salsa: Char chiles over a gas flame or under a broiler, turning occasionally, until blackened all over (this adds a smoky flavor and makes the skins easy to remove). Let cool. Using a small knife, scrape skin from chiles; discard. Coarsely chop chiles (for a milder salsa, discard seeds).Make a paste by mincing garlic and 1 tsp. salt on a work surface, scraping with the side of knife occasionally. Add chiles and finely chop, then add mint and finely chop. Transfer to a bowl; stir in oil. Season with more salt, if desired. DO AHEAD: Salsa can be made 1 day ahead. Cover; chill. Return to room temperature before using.",
                "Crispy Rice: Bring a large pot of well-salted water to a boil.Place the rice in a large bowl, rinse with cold water and drain in a colander until the water runs totally clear. Drain well.Add the rice to the pot and boil until the grains are soft on the outside but still hard at the center, about 6 minutes. Drain the rice and rinse under cold water.Measure out 1 1/4 cups of the parcooked rice and transfer to a bowl; stir in the yogurt, the 1 tablespoon melted butter and 1/4 teaspoon salt.Melt the oil and the remaining 1 tablespoon butter together over medium-low heat in a 2- to 3-quart nonstick pot with a tight-fitting lid. Add the yogurt rice and spread it evenly to cover the bottom of the pot. Add the remaining rice, mounding it into a pyramid shape. Insert the handle of a wooden spoon into the mound 3 or 4 times to make vents for steam to escape. Increase the heat to medium-high and cook until the rice starts to steam, about 2 minutes. Reduce the heat to medium-low and cover the pot, first with a clean towel and then with a lid. Steam until the rice is fully cooked and a golden brown crust has formed on the bottom, about 50 minutes.Spoon the loose rice onto a platter, then use a firm spatula to remove the crust from the pan. Top the rice with the crust and sprinkle with the parsley and sumac if using. Serve immediately.",
                "Chunky White Bean-Avocado Dip: In a medium bowl, combine avocados, white beans and garlic. Mash with a fork until chunky. Fold in cilantro and lime juice. Season, to taste, with salt and black pepper.",
                "Pressure-Cooker Turkey Stock for Gravy : Preheat oven to 400°F. Cut turkey backbone and breastbone into pieces. Place backbone and breastbone pieces, wing tips, neck, and giblets in a roasting pan. Sprinkle with milk powder, if using, and toss to coat. Roast, stirring once halfway through, until turkey pieces are dark golden brown, 40–50 minutes.Transfer turkey pieces to pressure cooker. Add carrot, onion, and 9 cups water. Seal pressure cooker according to manufacturer's instructions and cook on high pressure 1 1/2 hours. Manually release pressure and let cool 30 minutes.Pour turkey stock through a fine-mesh sieve into a large bowl, gently but firmly pressing on solids to extract as much liquid as possible. Discard solids.",
                "Beef & ale stew: Method If using the oven to cook the stew, preheat it to 180ºC/350ºF/gas 4.Put a large shallow ovenproof casserole pan on a medium heat with 2 tablespoons of oil.Trim the celery, wash the carrots, peel the onions, then roughly chop it all about the same size as your beef chunks, adding the veg to the pan as you go.Season the veg with sea salt and black pepper, and fry for 10 minutes, or until softened and starting to caramelise, stirring occasionally.Strip in the rosemary leaves, stir in the flour for 2 minutes, then pour in the booze and let it cook away. Pour in the tomatoes, breaking them up with the back of the spoon. Fill the tin with water, swirl around, and pour into the pan. Bring just to the boil, then stir in the meat, season, and cover. Either simmer slowly on the hob or place in the oven for 2 hours, or until the meat falls apart easily.Taste the stew and tweak the seasoning, if needed, then serve with rice or mashed potato, and some lovely veggies, or check out the topping ideas below. Tips HOT-POT TOPPING: Fill a large baking dish with the cooked stew. Peel and slice 600g of potatoes into 1cm-thick slices and parboil in boiling, salted water for 5 minutes, then carefully drain and leave for 5 minutes to cool slightly. Lay the potatoes over the stew. Drizzle with a little olive oil or brush with melted butter, and pick over some rosemary leaves, if you have them, then cook in the oven for 40 minutes. This stew would also be delicious topped with pastry, mashed potato or dumplings. EASY SWAPS: – You can use leeks instead of onions, no problem. – Rosemary and beef are good friends, bay would also work a treat, or you could chuck in some dried herbs, like oregano. – Run out of plain flour? Try wholemeal flour instead. – If you don’t want to use any alcohol, simply add an extra tin of tomatoes and a bit of water.",
                "Beef Wellington: Sprinkle the tenderloin generously on all sides with salt and pepper. Heat 2 tablespoons oil in a large skillet over high heat. Sear the beef on all sides, 8 to 10 minutes. Remove to a baking sheet and cool completely, about 20 minutes.Add half of the mushrooms to a food processor and pulse until they are very finely chopped. Remove the finely chopped mushrooms to a bowl and continue with the other half of the mushrooms. Reserve.Heat the butter and remaining tablespoon of oil in a large pan over medium-high heat. Once melted and foaming, add the shallots and sweat until fully softened, about 4 minutes. Add the mushrooms to the pan and saute until they release all their moisture and then dry, about 10 minutes. Add the heavy cream and simmer until thick, about 2 minutes. Turn off the heat and stir in the breadcrumbs and parsley. Remove the mushrooms to a small bowl, cool completely and chill in the refrigerator for at least 1 hour. The mushrooms should now look like a paste.Combine the Dijon and horseradish in a small bowl. Once the meat is cool to the touch, snip off the butcher's twine and discard, and then spread the mustard and horseradish mixture all over the beef. Place in the refrigerator to chill for 1 hour.Adjust a rack to the center of the oven and preheat to 400 degrees F. Line a baking sheet with parchment paper.Crack the egg into a small bowl and beat until smooth. Dust the work area lightly with flour. Roll out the puff pastry with a rolling pin so it's 4 inches longer than the tenderloin and 6 to 7 inches wider. Brush a 3-inch edge of the pastry with the beaten egg. Spread and pat the mushroom mixture all over the top and sides of the beef. Lay the beef mushroom-side down in the center of the pastry and pat the remaining mushrooms onto the exposed side. Tuck the 2 ends of the pastry into the beef and then fold up the other sides. Place the beef seam-side down on the baking sheet. Brush all over with the egg wash. Cut 3 slits on the top of the roast and sprinkle lightly with flaky sea salt.Roast until a thermometer inserted into the beef reads 120 degrees F, about 40 minutes. Remove from the oven and rest for 20 minutes before slicing into 1-inch-thick pieces. The temperature will rise to 125 degrees F, leaving you with a nice ruby red medium rare.",
                "Potato Knish: 1. For the Dough: In a large bowl combine flour, baking powder, and salt and whisk to combine. In a separate bowl whisk together egg, vegetable oil, lemon juice, and water. Pour wet ingredients over dry and using a wooden spoon mix until a dough forms. Using your hands knead until dough comes together and is smooth, about 1 minute. Wrap dough tightly with plastic wrap and let sit for 1 hour at room temperature or up to overnight in the refrigerator. Allow to come to room temperature before proceeding.2. For the Filling: In a large pot cover the potatoes with water, season well with salt, and bring to a simmer. Cook until potatoes are easily pierced with a knife, about 10 minutes. Drain potatoes and let dry for a few minutes before adding the butter and mashing until almost smooth. Add scallions and mix, then season to taste with salt and pepper. Allow to cool to room temperature.3. Adjust oven rack to middle position and preheat to 375°F. Line a baking sheet with foil or parchment paper.4. Divide the dough in half and roll it out into a wide, thin rectangle, less than 1/4-inch thick. Divide half the filling into 4 balls and place them along the bottom of the dough. Loosely roll the dough around the filling balls then twist and pinch off the dough between each ball. Leaving one end of each knish open, pinch the dough on the opposite end of the knish until sealed and place the knish sealed side down on the baking sheet and press gently on the top to form a short, squat roll. Repeat with remaining dough and filling then brush the knishes with beaten egg. Bake until golden, about 45 minutes. Serve immediately.",
                "Crisp Cocoa Pecan Cookies: Whisk flour, cocoa, baking soda, and 1/2 teaspoon (generous) salt in medium bowl. Stir butter and next 5 ingredients in another medium bowl until smooth. Stir in flour mixture, then nuts. Cover and chill until firm enough to scoop, at least 4 hours. DO AHEAD Can be made 1 day ahead. Keep chilled.Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 325°F. Line 3 large baking sheets with parchment. Measure 2 level tablespoonfuls dough; roll between palms into ball. Place on prepared sheet. Using fingers, spread out dough to 3-inch-diameter disk. Repeat with remaining dough, spacing 5 inches apart.Bake cookies 8 minutes; reverse sheets. Bake cookies until flat and beginning to darken around edges, about 10 minutes. Transfer cookies on parchment to rack (cookies will crisp as they cool). DO AHEAD Can be made 4 days ahead. Store airtight at room temperature.Place rack inside rimmed baking sheet. Place chocolate chips in small microwave-safe bowl. Heat chips in microwave in 15-second intervals until smooth, stirring occasionally. Place cookies on rack. Drizzle melted chocolate over cookies. Let stand until chocolate sets, about 30 minutes.",
                "Fettuccine ai Frutti di Mare: Heat oil in a large saucepan over medium. Cook onion and garlic, stirring, until onions are translucent, 5–8 minutes; season with salt and pepper. Add anchovies and tomato paste and cook, stirring, until color deepens, about 2 minutes.Stir in tomatoes, tomato juice, basil, red pepper flakes, and 2 tsp. salt. Bring to a boil, then reduce heat and simmer until sauce is thickened, about 15 minutes.Add clam juice and wine and bring to a boil; cook 2 minutes. Lower heat and bring to a rapid simmer. Add clams and cook until they open, 8–10 minutes. Transfer clams to a large warm bowl; discard any that do not open.Add mussels and cook until they open, 3–5 minutes. Transfer mussels to bowl with clams; discard any that do not open.Return sauce to a boil, add shrimp and scallops, cover, and remove from heat. Let sit until shrimp and scallops are cooked through, 5–8 minutes. Transfer shrimp and scallops to another large warm bowl.Meanwhile, cook fettuccine in a large pot of boiling salted water until barely al dente, about 2 minutes if using fresh pasta, reserving 2 Tbsp. pasta cooking liquid.Return sauce to a boil, add spinach, and cook until spinach is wilted, about 1 minute. Add pasta and pasta cooking liquid; simmer until sauce thickens, 2–5 minutes. Add shrimp and scallops and continue cooking until well combined, 30–60 seconds. Transfer pasta mixture to a large bowl; season with salt and pepper. Arrange clams and mussels over pasta.Do Ahead: Sauce can be made 2 days ahead. Let cool, store in an airtight container, and chill, or freeze up to 3 months.",
                "Sweet and Sour Sauce: 1. In a small bowl, whisk together cornstarch and water. Set aside.2. In a medium saucepan, combine pineapple juice, rice vinegar, brown sugar, ketchup, and soy sauce and bring to a boil over medium heat. Stir in cornstarch slurry and cook until thickened, about 1 to 2 minutes. Remove from heat and use immediately or store in an airtight container in the refrigerator for up to 2 weeks.",
                "Latkes with Caviar and Cream From 'Joy of Kosher': 1. Fill a large bowl with cold water. Peel the potatoes, cut them into quarters lengthwise, and place them in the bowl of cold water to prevent browning.2. Combine the eggs, salt, and pepper in a large bowl; set aside.3. Heat about 1 inch of the canola oil in a large saute pan over medium-high heat.4. Put the onion and potatoes in a food processor and pulse until puréed. Transfer the mixture to the large bowl with the eggs. Add the cornmeal and mix to combine.5. Line a baking sheet with paper towels.6. Using a 1/4 cup measuring cup, scoop up the potato mixture and carefully drop it into the hot oil. Use the back of the measuring cup to flatten the latke. Fill the pan with as many latkes as you can, but do not let them touch. Do not overcrowd your pan, or the latkes will be soggy instead of crispy. Fry until golden brown and crispy, 3 to 5 minutes per side. Drain on the prepared baking sheet. Repeat with the remaining batter.7. To keep the latkes warm and crispy once fried, spread them in a single layer on a baking sheet and place in a 200°F oven until ready to serve.8. To serve, place the latkes on a large serving tray and garnish each with a generous tablespoon of crème frâiche and caviar.",
                "Rabbit Stroganoff: Cut rabbit meat into cubes and toss in seasoned flour. Heat oil over medium-high heat in a large, deep frying pan. Add rabbit and cook until browned. Add beef broth, water, and onion and simmer for 20 to 25 minutes. Add sour cream and wine and simmer for an additional 5 to 10 minutes. Serve over a bed of rice or pasta.",
                "3-Ingredient Curried Chicken Thighs : Season chicken with 1 tsp. salt. Whisk oil, curry powder, and 1/2 cup yogurt in a large bowl. Add chicken and toss to coat. Transfer to a resealable plastic bag and chill at least 3 hours.Position a rack in upper third of oven; preheat to 425°F. Transfer chicken, skin side up, and marinade to a 13x9\" baking dish. Roast chicken until skin is browned and an instant-read thermometer inserted near bone registers 165°F, 30–35 minutes.Transfer chicken to a serving platter, reserving pan juices. Skim off excess fat from juices with a spoon, then transfer 1/4 cup juices to a small bowl. Whisk in remaining 1/2 cup yogurt; season with remaining 1/2 tsp. salt. Serve alongside chicken.Chicken can be marinated 1 day ahead; keep chilled.",
                "Savory Vegetable Bread Pudding From 'The Beekman 1802 Heirloom Vegetable Cookbook': 1. In a large, deep skillet, heat the oil and butter over medium heat. Add the onions and cook for 35 minutes, stirring occasionally, until golden brown and soft. Add the mushrooms and cook for 5 to 7 minutes, or until the mushrooms are tender.2. Preheat the oven to 350ºF. Brush a 9 × 13-inch baking dish with oil.3. In a large bowl, whisk together the eggs, milk, cream, salt, pepper, and sage. Add the bread, the onion mixture, and Fontina and stir to combine.4. Pour the mixture into the baking dish, pressing so the bread is covered with liquid, and set aside to soak for at least 10 minutes, until the bread has absorbed most of the liquid.5. Bake for 35 minutes, or until the bread is crisp and the custard is set. Serve hot or at room temperature.",
                "Richard Blais's Potato \"Linguine\" with Conch and White Wine: 1. Using a Japanese mandoline or a very sharp long knife, cut the potatoes lengthwise into long, thin sheets (as thin as possible—ideally, you should be able to see through them). Stack the slices a few at a time and cut them lengthwise into 1/4-inch-wide ribbons.2. Pour the chicken stock into a large skillet and bring to a simmer over medium-high heat. Add the potatoes and butter and cook until the potatoes begin to absorb the stock, about 4 minutes. Add the conch, oregano, and chiles and cook until the potatoes are al dente and most of the stock is absorbed, about 5 minutes. Season with salt and pepper.3. Pour in the wine and toss the potatoes gently until it evaporates. Stir in the parsley.4. Divide the “linguine” among four warmed shallow bowls. Squeeze some lemon juice over each bowl and top with a sprinkling of bread crumbs. Serve immediately.",
                "Sicilian-style tuna carpaccio: Method Place the capers into a small bowl, cover with the rosé, then leave to soak for 10 minutes or so. Meanwhile, hold the chilli over a direct flame on the hob (or place under the grill) for around 5 minutes, or until blackened and blistered all over, turning occasionally. Transfer to a bowl, cover with cling film and leave to cool for around 10 minutes. Meanwhile, using a long sharp knife, slice off and discard the veiny stub of meat from the tuna, then thinly slice against the grain. Place on a plate and squeeze over the juice from half the lemon – the acidity will start to cook the fish.Pick and finely chop the basil, finely chop the dill fronds, then peel and finely chop the garlic. Drain and finely chop the capers, then add the chopped ingredients to a bowl with 2 tablespoons of extra virgin olive oil. Scrape off and discard the blackened skin from the cooled chilli. Halve, deseed and finely chop most of it, then add the chopped chilli to the bowl, reserving the rest to one side. Stir well to combine.Arrange the tuna on a clean serving platter, drizzle with a little extra virgin olive oil, then spoon over the herb paste. Finely slice the reserved chilli lengthways and arrange on top, then serve with dressed rocket and lemon wedges for squeezing over.",
                "Parisian Gnocchi: 1. Bring water, butter, and salt to a boil in a medium saucepan over high heat. Add flour all at once and stir with a wooden spoon until a smooth dough forms. Reduce heat to medium-low and continue to stir, beating dough forcefully and rapidly to prevent it from sticking to the pot. Continue cooking until dough pulls away from sides of pot leaving a thin layer and steams slightly.2. To Finish with Stand Mixer: Transfer hot dough to the bowl of a stand mixer fitted with a paddle attachment. Add mustard and cheese and beat on medium-low speed. Add eggs one at a time, allowing dough to fully incorporate egg before adding the next one. When final egg has been added, add herbs and beat to combine. Transfer mixture to a gallon-sized zipper-lock bag or a pastry bag fitted with a 1/2-inch tip. Proceed to Step 4.3. To Finish by Hand: Remove pot from heat. Add mustard and cheese and beat with wooden spoon until homogenous. Add eggs one at a time, beating vigorously with each addition to prevent eggs from curdling and allowing dough to fully incorporate egg before adding the next one. When final egg has been added, add herbs and beat to combine. Transfer mixture to a gallon-sized zipper-lock bag or a pastry bag fitted with a 1/2-inch tip.4. Let mixture rest 15 to 25 minutes at room temperature. Meanwhile, bring a large pot of salted water to a simmer and have a rimmed baking sheet. If using a zipper-lock bag, cut off a 1/2-inch opening in one corner. Holding the bag over the boiling water, squeeze the mixture out of the bag, cutting it off with a paring knife into 1-inch lengths and letting them fall directly into the simmering water. Continue cutting off as many as you can in one minute, then stop.5. When all gnocchi have floated to the top, continue cooking until gnocchi are fully cooked to the center, about 3 minutes longer. Lift gnocchi with a fine mesh strainer or a metal spider and transfer to rimmed baking sheet. Drizzle with a little bit of olive oil and toss to coat. Repeat with remaining dough. Cooled gnocchi can be refrigerated until ready to continue cooking in either the Parisian Gnocchi with Roasted Cherry Tomatoes, Corn, and Zucchini, or in the Parisian Gnocchi Soufflé.",
                "Roasted Cauliflower: Place oven rack in lowest position and preheat to 450°. Toss cauliflower and oil on a large rimmed baking sheet; season with salt and pepper. Arrange cauliflower so a flat side is facing down and roast until dark brown and crisp on bottom, 15–20 minutes. Remove from oven and turn pieces over. Roast until second side is dark brown and crisp, 10–15 minutes. Let cool slightly.Transfer warm cauliflower to a platter. If using, spoon relish over top and season with more salt and pepper.Read More: The 29 New Essential Recipes from the Bon Appétit Test Kitchen",
                "Rhubarb Juice: 1. Slice the rhubarb stalks crosswise into one-inch segments. Place rhubarb segments into the pot along with the water. Bring to a boil over high heat, then cover and reduce heat to simmer for 15 minutes.2. Strain liquid through a fine-mesh strainer into a pitcher or spouted bowl, pressing on the solids in the strainer to extract as much juice as possible. You can line the strainer with cheesecloth if you like, but it's not necessary.3. After 20 minutes, the juice will separate, leaving a yellowish sludge at the bottom. Decant the clear pink liquid into a clean bottle or pitcher, leaving the sludge behind. Chill for a few hours at least, and serve cold over ice.",
                "Dinner Tonight: Chicken with Sichuan Peppercorn Paste: 1. Using your fingers, shred the chicken into bite-sized pieces. You should have about 2 cups. Set aside.2. Place all the ingredients for the Sichuan peppercorn paste in a mortar and pestle and crush until it is a coarse puree. Alternatively, you could place the ingredients in a small food processor and puree them.3. Mix all the ingredients for the sauce together in a medium-sized bowl. Add the Sichuan peppercorn paste and stir well. Add chicken and toss well.4. Place the chicken in the middle of a large plate. Ring with the sliced iceberg lettuce.",
                "Baked Lasagna Roll-Ups: Bring a large saucepan of generously salted water to a boil. Add half the noodles, dropping each in separately, and cook, stirring gently, until pliable but still firm, about 4 minutes. Lift the noodles out of the water with a slotted spoon then lay them on a sheet of foil in a single layer, not touching. Lightly drizzle the noodles with 1 tablespoon olive oil then rub them all over to coat well. Repeat with the remaining noodles and 1 tablespoon olive oil.Heat 2 tablespoons of the olive oil in a medium saucepan over medium-low heat Add the onion and cook, stirring occasionally, until completely soft and starting to caramelize, about 20 minutes. Stir in the tomato paste and garlic and cook, stirring until lightly caramelized, 1 to 2 minutes. Add the tomatoes, bay leaf and 1 cup water and bring to a boil over high heat. Reduce the heat to maintain a simmer and cook, stirring occasionally, until the sauce is slightly thickened, about 10 minutes. Discard the bay leaf. Carefully puree the sauce in a blender until smooth and return it to the pot. Stir in the parsley and season with salt and pepper.Preheat the oven to 375 degrees F. Shred half of the mozzarella on the large holes of a box grater. Add it to a large bowl, along with the ricotta, Parmesan, basil, eggs, 1 teaspoon salt and the 1/2 teaspoon pepper and stir to combine. Divide the ricotta mixture among the noodles, putting 2 to 3 tablespoons in each, and spread into an even layer. Reserve the remaining piece of mozzarella.Lightly grease a 9-inch springform pan with the remaining 1 tablespoon olive oil and spread 1/2 cup of the sauce over the bottom. Cut each lasagna noodle in half lengthwise then roll each noodle strip into a pinwheel. Rotate the pinwheels so the frilly ends are on top, then transfer them to the prepared pan in a snug, even layer. Pour the remaining sauce over the noodles, using the back of a spoon to spread it evenly over the top and into any gaps.Cover the pan with foil and bake until the noodles are tender and the lasagna is warmed through and bubbling, about 30 minutes. Remove the pan from the oven. Tear the remaining mozzarella into pieces and scatter them over the noodles. Return the lasagna to the oven until the mozzarella is just melted, 5 minutes. Let cool 10 minutes before unmolding. Carefully remove the sides of the pan, top with basil leaves and serve immediately."
            ]
        }, {
            "tag": "healthy",
            "patterns": [
                "Tropical Oatmeal Smoothie: Add the oats to a blender, cover and blend to a fine powder. Add 2 ice cubes, banana, coconut milk, lemon juice, vanilla and 1/8 teaspoon salt, cover and blend until smooth. Add the mango and pineapple, cover and blend until smooth, at least 1 minute.Pour the smoothie into two large chilled glasses and garnish with a pineapple wedge.",
                "Banana, Nutella, and Coconut Yogurt Shake with Chai Spices: 1. Combine frozen bananas, yogurt, Nutella, coconut milk, cinnamon, cardamom, ginger, and clove in a blender and blend on high until smooth. Serve garnished with coconut flakes if desired.",
                "Iceberg Wedges with Pancetta Gorgonzola Dressing: Heat the oil in a heavy medium skillet over medium heat. Add the pancetta and saute until crisp and golden, about 5 minutes. Using a slotted spoon, transfer the pancetta to a paper towel-lined plate to drain the excess oil.Stir the buttermilk, sour cream, and garlic in a medium bowl to blend; mix 2/3 of the cheese. Season the dressing with salt and pepper, to taste.(The dressing can be made up to 2 days ahead. Cover and refrigerate. Stir to blend before using, adding more milk to thin the sauce, if necessary.)Arrange each of 6 lettuce wedges on 6 plates. Spoon the dressing over the lettuce. Sprinkle with the pancetta and remaining cheese and serve.",
                "Roasted Asparagus Salad with Fried Sage: Preheat the oven to 450 degrees.Trim bottom of asparagus spears at point where they turn pale and tough. If spears are medium to thick, peel lower two thirds of the trimmed spears with sharp vegetable peeler. Thin spears needn't be peeled. Place them in a bowl, add chopped sage, olive oil and a light sprinkle of salt and toss lightly. Spread asparagus in a single layer on a baking sheet and roast until the spears are slightly limp -- 4 to 8 minutes depending on their thickness. Remove from oven and let cool. Heat olive oil in a 1 1/2 to 2 quart saucepan to 330 degrees. Drop in half of the sage leaves and turn them in the oil with a wire skimmer or slotted spoon. Fry for only 10 to 15 seconds, do not let the leaves brown. Then remove them to paper towels to drain. Fry the remaining sage leaves and sprinkle them all lightly with salt. They should crisp when they cool. The sage can be fried up to 1 day ahead of time -- store in airtight container at room temperature. Shave the Parmigiano cheese into thin curls. For the dressing, combine lemon zest, lemon juice, chopped sage, salt, pepper in a small mixing bowl, whisk in the oil. When ready to serve, toss asparagus with the dressing in a large bowl. Arrange the dressed asparagus on a serving platter, sprinkle with Parmigiano curls and with the fried sage leaves.",
                "Kale and Walnut Meatloaf with Sweet and Tangy Glaze: Preheat the oven to 350 degrees F. Line a rimmed baking sheet with parchment paper.Combine the meatloaf mix, kale, breadcrumbs, walnuts, parsley, eggs, onion, garlic, 1/4 cup of the ketchup, 1 1/2 teaspoons salt and 1/2 teaspoon pepper in a large bowl. Using your hands, mix together until well combined.Transfer the mixture to the prepared baking sheet and form it into a compact oval-shaped loaf, about 9 inches by 5 inches. Bake for 30 minutes.Stir together the apricot preserves, soy sauce, ginger, vinegar and remaining 1/4 cup ketchup in a small bowl for the glaze. Remove the meatloaf from the oven and brush the top and sides all over with the glaze. Return to the oven and bake until the glaze starts to caramelize and a thermometer inserted in the center of the meatloaf registers 160 degrees F, about 25 minutes more. Let rest for 10 minutes before slicing and serving.",
                "Vegan Chickpea Cakes with Mashed Avocado: 1. Bring 2 cups of water to a boil over high heat. Add bulgur wheat and cook until tender, about 10 minutes. Drain carefully.2. While wheat cooks, combine parsley, mint, cilantro, garlic, jalapeño and coriander in the bowl of a food processor. Pulse until finely chopped, scraping down sides as ncessary, about 10 to 12 short pulses. Add half of chickpeas and pulse until a rough puree is formed, scraping down sides as necessary, about 8 to 10 short pulses. Transfer to a large bowl.3. Add remaining chickpeas to food processor and pulse until roughly chopped, 4 to 6 pulses. Transfer to bowl with chickpea/herb mixture. When bulgur wheat has drained, add to bowl. Season with salt and pepper, then fold mixture together, starting with a rubber spatula, and finishing by hand when cool enough to handle. Form mixture into patties roughly 3/4-inch thicka dn 3 inches wide (you should be able to work 8 to 12 patties)4. Combine flour and water in a medium bowl and whisk until smooth. Place breadcrumbs in second medium bowl.5. Working one patty at a time, dip in flour mixture to coat, then transfer to breadcrumbs. Cover with breadcrumbs on all sides, then transfer to a plate. Repeat with remaining patties.6. Heat half of oil in a large cast iron or non-stick skillet over medium-high heat until shimmering. Add half the patties in a single layer and cook, swirling pan occasionally, until golden brown on bottoms, about 2 minutes. Carefully flip and cook second side, swirling pan occasionally as they cook, about 2 minutes longer. Transfer to a plate and keep warm while you cook the remaining patties.7. Place avocado in a medium bowl and mash the flesh with a fork. Season with salt and add lime juice. serve fried chickpea patties with mashed avocado, sliced onions, herbs, and lime or lemon wedges.",
                "The Crisper Whisperer: Braised Kale with Caramelized Onions, Walnuts, and Blue Cheese: 1. Wash kale and shake to remove excess water, leaving some water clinging to leaves. Strip leaves from stems and discard stems. Cut leaves crosswise into bite-sized pieces.2. In large Dutch oven, heat 1/4 cup olive oil over medium-high heat until shimmering. Add garlic and cook, stirring frequently, until fragrant, about 1 minute. Add stock and vinegar and raise heat to high. Begin adding kale by the handful, pausing to let it wilt as necessary, until all the kale is in the pot. Cover and reduce heat to medium-low. Cook, stirring occasionally, until kale is very tender, about 25 minutes.3. Meanwhile, in medium skillet, heat remaining 1/4 cup olive oil over medium heat until shimmering. Add onions along with pinch salt and cook, stirring occasionally, until lightly browned and reduced to half their original volume, about 20 minutes. Add chopped walnuts and cook 5 minutes more.4. Stir onions, walnuts and blue cheese into kale. Season to taste with salt and pepper. Serve hot.",
                "Tropical Carrot, Ginger, and Turmeric Smoothie: Using smoothie or ice crush setting, purée orange, carrot, mango, coconut water, hemp seeds, ginger, turmeric, cayenne, salt, and ½ cup ice in a blender until smooth.",
                "Spinach, Artichoke and Red Pepper Dip: Preheat the oven to 400 degrees F. Cut a thin slice from the top of the bread to expose the inside. With a paring knife, cut out the center of the bread to make a bread shell about 1-inch thick.Cut the bread top and center into cubes and set aside.Combine the cream cheese, mayonnaise, sour cream, chopped jalapeno and garlic in a food processor and process until smooth. Add the spinach and artichokes and pulse until chunky. Add the parsley, all but 1 tablespoon of the red peppers, 1 1/4 cup cheese, 1/2 teaspoon salt and some pepper and pulse just until combined.Spoon the mixture into the bread bowl and top with the remaining 1/4 cup cheese, reserved red peppers and finely chopped jalapeno. Place the bread on a baking sheet. Brush the bread all over with olive oil and bake until hot and bubbly, 25 to 30 minutes.Serve with the bread cubes, baguette, crackers and crudites.",
                "Chocolate Avocado Milkshake: 1. Pour milk into freezer safe container and freeze until half frozen, about 1 1/2 hours.2. While milk is freezing, place chocolate and water in microwave safe bowl and heat on high power until chocolate is melted, about 30 seconds. Whisk in cocoa until smooth; set aside.3. Halve and pit avocado. Scoop avocado flesh into blender. Add chocolate mixture, sugar, vanilla, and frozen milk. Blend until smooth, 15 to 30 seconds. Serve.",
                "Caesar Salad: Put the whole romaine leaves in a work bowl. Add enough of the dressing to coat the leaves and toss well. Arrange the leaves in a serving bowl with their tips up, and intersperse the pizzetta's, if desired. Sprinkle the Parmesan over all.Place the egg yolk, mustard, anchovies, garlic, vinegar, lemon juice, and a dash of Worcestershire sauce into a salad bowl. Blend with whisk and then add the olive oil in a slow, steady stream until it is fully incorporated. If the dressing stops gets too thick, add the warm water and then continue until all the oil is added. Add the cheese and continue to blend.Preheat oven to 375 degrees F.Stir the garlic into the tapenade. Separate the ready made/store bought pizza dough into 1 1/2-ounce pieces and roll them out to 1/8-inch (if possible, roll out to desired thickness by using a pasta machine). Cover the top of the rolled out dough with olive paste and garlic mixture. Sprinkle the thyme on top. Lay the pecorino on top of pizzetta. Season with salt and pepper, to taste.Bake the pizza for 15 minutes or until light brown (a cracker like thinness and texture). Let cool for about 10 minutes, and serve."
            ]
        }
    ]
}
